Repository: NethServer/docs
Catalog: administrator-manual/*/locale/*/LC_MESSAGES/*_system2.po
Languages: it

source: The :index:`storage` section configures and monitors disks. The administrator can mount new local or remote disks, manage RAID arrays and LVM volumes.
it: La sezione :index:`storage` consente di configurare e monitorare i dischi. L'amministratore può montare nuovi dischi locali o remoti, gestire array RAID e volumi LVM.

source: Trusted networks
it: Reti fidate

source: Trusted networks are special networks (local, VPNs or remote) allowed to access special server's services.
it: Le reti fidate sono reti speciali (locali, VPN o remote) a cui è garantito l'accesso a servizi speciali del server.

source: For example, hosts inside trusted networks can access to:
it: Ad esempio, i computer sulle reti fidate possono accedere a:

source: Shared folders (SAMBA)
it: Cartelle condivise (SAMBA)

source: New trusted networks can be added using the :guilabel:`Add network` button.
it: Nuove reti fidate possono essere create cliccando sul pulsante :guilabel:`Aggiungi rete`.

source: If the remote network is reachable using a router, remember to add a static route inside :ref:`static_routes-section` page.
it: Se la rete remota è raggiungibile attraverso un router, ricordarsi di creare la rotta statica corrispondente nel pannello :ref:`static_routes-section`.

source: The :menuselection:`System > SSH` page displays the number of current SSH connections. From this section the administrator can change the OpenSSH listening port and disable weak ciphers, root login, and password authentication.
it: La pagina :menuselection:`System > SSH` mostra il numero di connessioni SSH attive. Da questa sezione l'amministratore può modificare la porta di ascolto OpenSSH, disabilitare l'accesso root e l'autenticazione tramite password.

source: By default, SSH and SFTP access is granted to the following groups of administrators:
it: Di default, l'accesso SSH e SFTP è garantito per i seguenti gruppi di amministratori:

source: When an account provider is configured, the access is granted to ``domain admins``, too. See :ref:`admin-account-section` for details.
it: Quando viene configurato un provider di account, l'accesso viene concesso anche ai ``domain admins``. Vedi :ref:`admin-account-section` per i dettagli.

source: It is possible to grant access to normal users and groups with the :guilabel:`Allow SSH/SFTP access` selector.
it: È possibile concedere l'accesso a utenti e gruppi non privilegiati con il selettore :guilabel:`Consenti accesso SSH/SFTP`.

source: The administrator can harden SSH by restricting the usage of weak ciphers, algorithms and macs. After enabling the :guilabel:`Disable weak ciphers` option, the host key will change and clients will have to accept the new one. Also, note that big files transfer can be slower with the strong encryption and very old SSH clients may not be able to connect to the server.
it: L'amministratore può rafforzare SSH limitando l'uso di cifrari, algoritmi e mac deboli. Dopo aver abilitato l'opzione :guilabel:`Disabilita cifrari deboli`, la chiave host cambierà e i client dovranno accettare quella nuova. Inoltre, è necessario tenere presente che il trasferimento di file di grandi dimensioni potrà essere più lento con la crittografia avanzata e che i client SSH molto vecchi potrebbero non essere in grado di connettersi al server.

source: For |product| up to version 7.7:
it: Per |product| fino alla versione 7.7:

source: The :guilabel:`Allow SSH/SFTP access` selector is available once the :guilabel:`Override the shell of users` option has been enabled in :menuselection:`System > Settings > Shell policy`. If that option is disabled, only users the with :guilabel:`Shell` option can access the Server Manager, and delegation is not required any more.
it: Il selettore :guilabel:`Consenti accesso SSH/SFTP` è disponibile una volta che l'opzione :guilabel:`Ignora la shell degli utenti` è stata abilitata nella sezione :menuelection:`Sistema > Impostazioni > Policy shell`. Se questa opzione è disabilitata, solo gli utenti con l'opzione :guilabel:`Shell` abilitata possono accedere a Server Manager, e la delega non è più richiesta.

source: See :ref:`relnotes-ns78` for more information.
it: Vedi :ref:`relnotes-ns78` per maggiori dettagli.

source: Access of the ``wheel`` group can be revoked with the following commands: ::
it: L'accesso al gruppo ``wheel`` può essere revocato con i seguenti comandi: ::

source: The ``AllowLocalGroups`` property accepts a comma separated list of ``/etc/groups`` names and can be adjusted according to the actual needs (e.g. ``wheel,srvadmins``).
it: La proprietà ``AllowLocalGroups`` accetta un elenco separato da virgole di nomi provenienti da ``/etc/groups`` e può essere regolata in base alle effettive esigenze (ad esempio ``wheel,srvadmins``).

source: Disk analyzer
it: Analizzatore disco

source: This tool is used to visualize :index:`disk usage` in a simple and nice graph in which you can interact with, click, and double click to navigate in the directories tree.
it: Questo strumento consente di visualizzare l':index:`utilizzo del disco` in un semplice grafico in cui è possibile interagire con click e doppio click per navigare nelle cartelle.

source: The chart is updated overnight. Click the :guilabel:`Update now` in order to index the file system and update the chart. Please note that this process can take several minutes depending on the occupied disk space.
it: Il grafico viene aggiornato durante la notte. Fare clic su :guilabel:`Aggiorna ora` per indicizzare il file system e aggiornare il grafico. Si noti che questo processo può richiedere diversi minuti a seconda dello spazio su disco occupato.

source: Well known folders are:
it: Alcune cartelle note sono:

source: Shared folders: :file:`/var/lib/nethserver/ibay`
it: Cartelle condivise: :file:`/var/lib/nethserver/ibay`

source: User home directories: :file:`/var/lib/nethserver/home`
it: Home degli utenti: :file:`/var/lib/nethserver/home`

source: Faxes: :file:`/var/lib/nethserver/fax`
it: Fax: :file:`/var/lib/nethserver/fax`

source: MySQL databases: :file:`/var/lib/mysql`
it: Database MySQL: :file:`/var/lib/mysql`

source: Settings
it: Impostazioni

source: The :index:`settings` page allows the configuration of some options which could impact multiple system applications.
it: La pagina :index:`impostazioni` consente la configurazione di alcune opzioni che potrebbero avere un impatto su più applicazioni di sistema.

source: Many system applications, like cron, can generate mail notification. If the server can't directly deliver those mails, the administrator can configure a SMTP relay. When the smarthost is enabled, all mail messages will be delivered to the configured server.
it: Molte applicazioni di sistema, come cron, possono generare notifiche via mail. Se il server non dovesse essere in grado di recapitare direttamente questi messaggi, l'amministratore può configurare un server di inoltro SMTP. Quando lo smarthost è abilitato, tutti i messaggi di posta verranno recapitati attraverso il server configurato.

source: Email notifications
it: Notifiche email

source: As default, notifications are sent to the local root maildir. The administrator can change the root forward address adding one or more mail address to the :guilabel:`Destination` field.
it: Per impostazione predefinita, le notifiche vengono inviate alla maildir locale di root. L'amministratore può cambiare l'indirizzo di inoltro a root aggiungendo uno o più indirizzi di posta elettronica nel campo :guilabel:`Destinazione`.

source: It's also a good practice to set a custom :guilabel:`Sender address`: messages from the root user (like cron notifications) will be sent using the specified address. A good value could be: ``no-reply@<domain>`` (where ``<domain>`` is the domain of the server). If not set, messages will be sent using ``root@<fqdn>`` as sender address.
it: È buona pratica impostare un :guilabel:`Indirizzo mittente` personalizzato: i messaggi dell'utente root (come le notifiche cron) verranno inviati usando l'indirizzo specificato. Una buona scelta potrebbe essere: ``no-reply@<domain>`` (in cui ``<domain>`` è il dominio del server). Se non impostato, i messaggi verranno inviati usando ``root@<fqdn>`` come indirizzo mittente.

source: As default, access to the Server Manager is granted from all firewall zones. From this section the administrator can restrict the access to the Server Manager only to a list of trusted IP addresses.
it: Per impostazione predefinita, l'accesso al Server Manager è autorizzato da tutte le zone del firewall. Da questa sezione l'amministratore può limitare l'accesso al Server Manager solo a un elenco di indirizzi IP affidabili.

source: Log files
it: File di log

source: All log files are managed by :index:`logrotate`. Logrotate is designed to ease administration of a large numbers of log files. It allows automatic rotation, compression, and removal of log files. Each log file may be handled daily, weekly, monthly.
it: Tutti i file di log sono gestiti da :index:`logrotate`. Logrotate è progettato per facilitare l'amministrazione di un gran numero di file di log. Consente la rotazione, la compressione e la rimozione automatica dei log. Ogni file può essere gestito giornalmente, settimanalmente, mensilmente.

source: The administrator can set logrotate defaults from this page. The configuration will apply to all applications. But please note that some applications can override such configuration to meet specific needs.
it: L'amministratore può impostare la configurazione predefinita di logrotate da questa pagina. La configurazione si applicherà a tutte le applicazioni. Tuttavia, alcune applicazioni possono ignorare tale configurazione per rispondere ad esigenze specifiche.

source: Configuration hints
it: Suggerimenti di configurazione

source: Most Server Manager pages can display some configuration hints to help guide the administrator on a better system configuration. Hints are just suggestions and can be disabled from this menu.
it: La maggior parte delle pagine del Server Manager possono visualizzare alcuni suggerimenti per aiutare l'amministratore ad adottare una migliore configurazione del sistema. I suggerimenti sono solo dei consigli e possono essere disabilitati da questo menu.

source: Password change
it: Cambio password

source: The settings page also includes a panel to let users change their password, including the root user.
it: La pagina delle impostazioni include anche un pannello per consentire agli utenti, incluso l'utente root, di cambiare la propria password.

source: Shell policy
it: Criteri shell

source: This setting was added since |product| 7.8, to select how the user's shell is configured.
it: Questa impostazione è stata aggiunta a partire dalla versione 7.8 di |product|, per selezionare la modalità di configurazione della shell dell'utente.

source: If the :guilabel:`Override the shell of users` option is enabled, the old user's :guilabel:`Shell` setting under the :guilabel:`Users & Groups` page is hidden and it is considered always enabled.
it: Se l'opzione :guilabel:`Ignora la shell degli utenti` è abilitata, la vecchia impostazione :guilabel:`Shell` presente nella pagina :guilabel:`Utenti & Gruppi` viene nascosta ed è considerata sempre abilitata.

source: This is required by some features introduced starting from |product| 7.8, like the new Server Manager based on Cockpit, the :guilabel:`User settings page` and the fine grained SSH and SFTP permissions. See :ref:`relnotes-ns78` for details.
it: Ciò è richiesto da alcune funzionalità introdotte a partire da |product| 7.8, come il nuovo Server Manager basato su Cockpit, la :guilabel:`Pagina impostazioni utente` e le autorizzazioni più granulari per SSH e SFTP. Fare riferimento alla sezione :ref:`relnotes-ns78` per maggiori dettagli.

source: User settings page
it: Pagina impostazioni utente

source: When the :guilabel:`Enable user settings page` options is enabled, users can change their password and other settings on a web page outside Cockpit (on port 443). The default page is :guilabel:`/user-settings`. This feature can be enabled only if :guilabel:`Shell Policy` is enabled as well.
it: Quando l'opzione :guilabel:`Abilita pagina impostazioni utente` è abilitata, gli utenti possono modificare la propria password e altre impostazioni del profilo attraverso una pagina Web esterna a Cockpit (sulla porta 443). La pagina predefinita è :guilabel:`/ user-settings`. Questa funzione può essere abilitata solo se è attiva l'opzione :guilabel:`Criteri Shell`.

source: The access to the page can be limited only from Trusted Networks.
it: L'accesso alla pagina può essere limitato alle sole reti fidate.

source: Logs
it: Log

source: The system provides an indexed log named journal. Journal can be browsed from this page: messages can be filtered by service, severity and date.
it: Il sistema fornisce un registro indicizzato denominato journal. Il journal può essere sfogliato da questa pagina: i messaggi possono essere filtrati per servizio, gravità e data.

source: Applications
it: Applicazioni

source: The :guilabel:`Applications` page lists all installed applications. An :index:`application` is a Server Manager module usually composed by multiple pages including a dashboard, one or more configuration sections and the access to application logs. A click on the :guilabel:`Settings` button will open the application.
it: La pagina :guilabel:`Applicazioni` elenca tutte le applicazioni installate. Una :index:`applicazione` è un modulo del Server Manager generalmente composto da più pagine tra cui una dashboard, una o più sezioni di configurazione e l'accesso ai registri dell'applicazione. Un clic sul pulsante :guilabel:`Impostazioni` aprirà l'applicazione.

source: There are also simpler applications which include only a link to an external web pages. To access such applications click on the :guilabel:`Open` button.
it: Esistono anche applicazioni più semplici che includono solo un collegamento a pagine Web esterne. Per accedere a tali applicazioni fare clic sul pulsante :guilabel:`Apri`.

source: Shortcuts
it: Scorciatoie

source: The administrator can add shortcuts to applications which are frequently used. Applications with a shortcut, will be linked to the left menu.
it: L'amministratore può aggiungere dei collegamenti per le applicazioni utilizzate più di frequente. I collegamenti alle applicazioni saranno mostrati nel menu di sinistra.

source: Only *root* user has access to this feature.
it: Solo l'utente *root* ha accesso a questa funzionalità.

source: Add to home page
it: Aggiungi alla home page

source: :index:`Launcher` is an application of the new Server Manager available to all users on HTTPS and HTTP ports. The launcher is accessible on the server FQDN (eg. ``https://my.server.com``) and it's enabled if there is no home page already configured inside the web server (no index page in :file:`/var/www/html`)
it: Il :index:`Launcher` è un'applicazione del nuovo Server Manager disponibile per tutti gli utenti su porte HTTPS e HTTP. Il launcher è accessibile tramite l'FQDN del server (ad es. ``https://my.server.com``) e viene automaticamente abilitato se non esiste alcuna home page già configurata all'interno del server Web (nessuna index page nel percorso :file:`/var/www/html`)

source: Installed applications can be added to the launcher by clicking on the :guilabel:`Add to home page` button. All users will be able to access the public link of the application.
it: Le applicazioni installate possono essere aggiunte al launcher facendo clic sul pulsante :guilabel:`Aggiungi alla home page`. Tutti gli utenti saranno in grado di accedere al link pubblico dell'applicazione.

source: See :ref:`launcher-section`.
it: Vedi :ref:`launcher-section`.

source: Removing applications
it: Rimozione applicazioni

source: To remove an installed module click :guilabel:`Remove` button on the corresponding application.
it: Per rimuovere un modulo installato, fare clic sul pulsante :guilabel:`Rimuovi` dell'applicazione corrispondente.

source: When removing a module other modules could be removed, too! Read carefully the list of affected packages to avoid removing required features.
it: Quando si disinstalla un modulo, è possibile che vengano rimossi anche altri moduli! Leggere attentamente l'elenco dei pacchetti interessati per evitare di rimuovere delle funzionalità necessarie.

source: This feature is not available in |product| Enterprise.
it: Questa funzionalità non è supportata in |product| Enterprise

source: Authentication
it: Autenticazione

source: The Server Manager can be always accessed from the following users:
it: Il Server Manager è sempre accessibile per i seguenti utenti:

source: members of ``domain admins`` groups
it: membri del gouppo ``domain admins``

source: Role delegation
it: Delega

source: In complex environments, the *root* user can :index:`delegate` the access of some Server Manager pages to specific groups of users.
it: In ambienti strutturati, l'utente *root* può :index:`delegare` l'accesso ad alcune sezioni del Server Manager a specifici gruppi di utenti.

source: The *admin* user and the *domains admins* group are implicitly delegated to all pages. See also :ref:`admin-account-section` for more information.
it: L'utente *admin* e il gruppo *domains admins* sono implicitamente delegati a tutte le pagine. Fare riferimento alla sezione :ref:`admin-account-section` per maggiori informazioni.

source: Other groups can be delegated to access:
it: Altri gruppi possono essere delegati ad accedere a:

source: one or more pages under the :guilabel:`System` section
it: una o più pagine della sezione :guilabel:`Sistema`

source: one or more installed applications
it: una o più applicazioni installate

source: the :guilabel:`Subscription` page
it: la pagina :guilabel:`Registrazione`

source: the :guilabel:`Software Center` page
it: la pagina :guilabel:`Software Center`

source: To create a new delegation, go to the :guilabel:`System > User & Groups > List > [Groups]` section then select the :guilabel:`Delegations` action of an existing group. Pick one or more items from the :guilabel:`System views` and :guilabel:`Applications` menus.
it: Per creare una nuova delega, accedere alla sezione :guilabel:`Sistema > Utenti & Gruppi > Lista > [Gruppi]` quindi selezionare l'azione :guilabel:`Deleghe` per un gruppo esistente. Selezionare quindi uno o più elementi dai menu :guilabel:`Viste sistema` e :guilabel:`Applicazioni`.

source: The following pages are implicitly added to the delegated set:
it: Le pagine seguenti vengono aggiunte in modo implicito al set di deleghe:

source: :guilabel:`Applications`
it: :guilabel:`Applicazioni`

source: :guilabel:`Terminal`
it: :guilabel:`Terminale`

source: Even if a user has been delegated, it must be explicitly granted the shell access before being able to log into the Server Manager.
it: Anche se un utente è stato delegato, gli deve essere concesso esplicitamente l'accesso alla shell prima di poter accedere a Server Manager.

source: Two-factor authentication (2FA)
it: Autenticazione a due fattori (2FA)

source: Two-factor authentication (2FA) can be used to add an extra layer of security required to access the new Server Manager. First, users will enter user name and password, then they will be required to provide a temporary verification code generated by an application running on their smartphone.
it: L'autenticazione a due fattori (2FA) può essere utilizzata per aggiungere un ulteriore livello di sicurezza per l'accesso al nuovo Server Manager. Innanzitutto, gli utenti inseriranno nome utente e password, quindi dovranno fornire un codice di verifica temporaneo generato da un'applicazione in esecuzione sul proprio smartphone.

source: 2FA is disabled by default. Users can enable it by themselves, accessing the :guilabel:`Two-factor authentication` section under their :guilabel:`System > Settings` page or by pointing the web browser to the ``/user-settings`` URL as explained in :ref:`user_settings-section`. Thereafter they have to follow these steps:
it: Il 2FA è disabilitato per impostazione predefinita. Gli utenti possono abilitarlo autonomamente, accedendo alla sezione :guilabel:`Autenticazione a due fattori` nella pagina :guilabel: Sistema> Impostazioni` o indirizzando il browser web all'URL ``/user-settings`` come spiegato nella sezione :ref:`user_settings-section`. Successivamente devono seguire questi passaggi:

source: download and install the preferred 2FA application inside the smartphone
it: scaricare e installare nello smartphone l'applicazione 2FA preferita

source: scan the QR code with the 2FA application
it: scansionare il QR code con l'applicazione 2FA

source: generate a new code and copy it inside :guilabel:`Verification code` field, than click :guilabel:`Check code`
it: generare un nuovo codice e copiarlo all'interno del campo :guilabel:`Codice di verifica`, quindi fare clic su :guilabel:`Verifica codice`

source: if the verification code is correct, click on the :guilabel:`Save` button
it: se il codice di verifica è corretto, fare clic sul pulsante :guilabel:`Salva`

source: Two-factor authentication can be enabled for the following core applications:
it: L'autenticazione a due fattori può essere abilitata per le seguenti applicazioni principali:

source: the new Server Manager
it: il nuovo Server Manager

source: SSH when using username and password (access with public key will never require 2FA)
it: SSH quando si utilizzano nome utente e password (l'accesso con chiave pubblica non richiederà mai il 2FA)

source: Recovery codes
it: Codici di recupero

source: Recovery codes can be used instead of temporary codes if the user cannot access the 2FA application on the smartphone. Each recovery code is a one-time password and can be used only once.
it: È possibile utilizzare i codici di ripristino anziché dei codici temporanei se l'utente non può accedere all'applicazione 2FA sullo smartphone. Ogni codice di ripristino è una one-time password e può essere utilizzato una sola volta.

source: To generate new recovery codes, disable 2FA, then re-enable it by registering the application again following the above steps.
it: Per generare nuovi codici di ripristino, disabilitare il 2FA, quindi riattivarlo registrando nuovamente l'applicazione, seguendo i passaggi precedenti.

source: Smartphone applications
it: Applicazioni per smartphone

source: There are several commercial and open source 2FA applications:
it: Esistono diverse applicazioni, commerciali e open source, per il 2FA:

source: Available for both Android and iOS:
it: Disponibili sia per Android che per iOS:

source: `FreeOTP <https://freeotp.github.io/>`_: available for both Android and iOS
it: `FreeOTP <https://freeotp.github.io/>`_: disponibile sia per Android che per iOS

source: `Authenticator <https://mattrubin.me/authenticator/>`_: available on iOS only
it: `Authenticator <https://mattrubin.me/authenticator/>`_: disponibile solo per iOS

source: `andOTP <https://github.com/andOTP/andOTP>`_: available for both Android and iOS https://github.com/andOTP/andOTP
it: `andOTP <https://github.com/andOTP/andOTP>`_: disponibile sia per Android che per iOS

source: Emergency recovery
it: Ripristino d'emergenza

source: In case of emergency, 2FA can be disabled accessing the server from a physical console like a keyboard and a monitor, a serial cable or a VNC-like connection for virtual machines:
it: In caso di emergenza, il 2FA può essere disabilitato accedendo al server da una console fisica, come una tastiera e un monitor, un cavo seriale o una connessione VNC - o simili - per macchine virtuali:

source: access the system with user name and password
it: accedere al sistema con nome utente e password

source: execute: ::
it: eseguire: ::
