Repository: NethServer/docs
Catalog: administrator-manual/*/locale/*/LC_MESSAGES/*_system2.po
Languages: it

source: Base system
it: Sistema base

source: This chapter describes all available modules at the end of installation. All modules outside this section can be installed from the :ref:`software-center-section` page.
it: Questo capitolo descrive tutti i moduli disponibili al termine dell'installazione. Tutti i moduli al di fuori di questa sezione possono essere installati dalla pagina del :ref:`software-center-section`.

source: The default installation includes the following main modules:
it: L'installazione predefinita include i seguenti moduli principali:

source: :ref:`Terminal <terminal-section>`
it: :ref:`Terminale <terminal-section>`

source: While the *root* user can see all configuration pages, access of each section and application may be also delegated to specific users. See :ref:`authentication-section`.
it: L'utente *root* può visualizzare tutte le pagine di configurazione ma l'accesso a ciascuna sezione e applicazione può anche essere delegato ad altri utenti. Vedi la sezione :ref:`authentication-section`.

source: System
it: Sistema

source: The :index:`System` page is the landing section after a successful login. The page will display the :index:`status` and configuration of the system.
it: La pagina :index:`Sistema` è la sezione che viene visualizzata a seguito di un login riuscito. La pagina visualizzerà lo :index:`status` e la configurazione del sistema.

source: From the system dashboard, the administrator can:
it: Dalla dashboard di sistema, l'amministratore può:

source: change the machine FQDN and server :ref:`dns_alias-section`
it: modificare il nome FQDN del server ed i relativi :ref:`dns_alias-section`

source: set upstream :ref:`dns-section` servers
it: configurare i server :ref:`dns-section` upstream

source: configure date time and NTP servers
it: configurare la date, l'orario e i server NTP

source: customize the organization details
it: personalizzare l'anagrafica della azienda

source: The basic system includes also:
it: Il sistema basa include inoltre:

source: Terminal
it: Terminale

source: Execute a standard shell inside a terminal directly accessible from the browser. The shell and the processes will run with the user privileges.
it: Eseguire una shell standard all'interno di un terminale direttamente accessibile dal browser. La shell e i processi verranno eseguiti con i privilegi dell'utente.

source: Network
it: Rete

source: The :guilabel:`Network` page configures how the server is connected to the local network (LAN) and/or other networks (i.e. Internet).
it: La pagina :guilabel:`Rete` consente di stabilire in quale modo il server è collegato alla rete locale (LAN) oppure alle reti pubbliche (Internet).

source: If the server has firewall and gateway functionality, it will handle extra networks with special functions like DMZ (DeMilitarized Zone) and guests network.
it: Se il server svolge la funzionalità di firewall e gateway, sarà in grado di gestire reti aggiuntive con funzionalità speciali come DMZ (DeMilitarized Zone) o rete ospiti.

source: |product| supports an unlimited number of network interfaces. Any network managed by the system must follow these rules:
it: |product| supporta un numero illimitato di schede di rete. Le reti gestite devono sottostare alle regole seguenti:

source: networks must be physically separated (multiple networks can't be connected to the same switch/hub)
it: le reti devono essere fisicamente separate (non possono essere collegate allo stesso switch/hub)

source: networks must be logically separated: each network must have different addresses
it: le reti devono essere logicamente separate (essere configurate su sotto-reti differenti)

source: private networks, like LANs, must follow address's convention from :ref:`RFC1918 <RFC1918-section>` document
it: le reti private, come le LAN, devono rispettare le convenzioni per gli indirizzamenti vontenute nel documento :ref:`RFC1918 <RFC1918-section>`

source: Every network interface has a specific *role* which determines its behavior. All roles are identified by colors. Each role corresponds to a well-known *zone* with special network traffic rules:
it: Ogni interfaccia di rete ha un ruolo specifico che ne determina l'utilizzo e il comportamento. I ruoli sono indicati tramite colori. Ogni colore indica la zona di appartenenza della scheda di rete e le regole ad essa applicate:

source: *green*: local network (green role/zone). Hosts on this network can access any other configured network
it: **green**: rete locale (ruolo/zona green). I computer su questa rete possono accedere a qualsiasi altra rete configurata sul server

source: *blue*: guests network (blue role/zone). Hosts on this network can access orange and red networks, but can't access the green network
it: *blue*: rete ospiti (ruolo/zona blue). I computer su questa rete possono accedere alle reti orange e red, ma non possono accedere alla zona green

source: *orange*: DMZ network (orange role/zone). Hosts on this network can access red network, but can't access to blue and green networks
it: *orange*: rete DMZ (ruolo/zona orange). I computer su questa rete possono accedere alle reti red, ma non possono accedere alle zone blue e green

source: *red*: public network (red role/zone). Hosts on this network can access only the server itself
it: *red*: rete pubblica (ruolo/zona red). I computer in questa rete possono accedere solo al server stesso

source: See :ref:`policy-section` for more information on roles and firewall rules.
it: Si veda :ref:`policy-section` per maggiori informazioni sull'uso dei ruoli nelle regole del firewall.

source: The server must have at least one network interface. When the server has only one interface, this interface must have green role.
it: Il server deve avere almeno un'interfaccia di rete. Quando il server ha una sola scheda di rete, tale scheda deve avere il ruolo green.

source: If the server is installed on a public VPS (Virtual Private Server), it should must be configured with a green interface. All critical services should be closed using :ref:`services-section` panel.
it: In caso di installazione su VPS (Virtual Private Server) pubblico, il server deve essere configurato con una schede di rete green. Si consiglia quindi di chiudere le porte dei servizi critici usando il pannello :ref:`services-section`.

source: A role can be removed from an existing network interface by clicking on the tree-dots menu :guilabel:`⋮`, then select :guilabel:`Release role` action.
it: Un ruolo può essere rimosso da un'interfaccia di rete esistente facendo clic sul menu tree-dots :guilabel:`⋮`, quindi selezionando l'azione :guilabel:`Libera ruolo`.

source: Addresses for private networks (RFC1918)
it: Indirizzi delle reti private (RFC1918)

source: TCP/IP private networks not directly connected to Internet should use special addresses selected by Internet Assigned Numbers Authority (IANA).
it: Per reti private TCP/IP indirettamente connesse a Internet dovrebbero utilizzare indirizzi speciali selezionati dall’Internet Assigned Numbers Authority (IANA)

source: Private network
it: Rete privata

source: IP addresses interval
it: Intervallo di indirizzi IP

source: IP aliasing
it: Alias IP

source: Use IP aliasing to assign more IP addresses to the same network interface.
it: Per assegnare più indirizzi IP alla stessa scheda di rete è possibile utilizzare gli alias IP.

source: The most common use is with a red interface: when the ISP provides a pool of public IP addresses (within the same subnet) you can add some (or all) of them to the same red interface and manage them individually (e.g. in the port forward configuration).
it: In tal modo è possibile ad esempio associare alla stessa red più indirizzi IP della stessa classe e gestirli in modo indipendente (ad esempio con dei port forward che discriminano in base allo specifico IP di destinazione).

source: To add an alias, click the tree-dots menu :guilabel:`⋮` on right corner of the existing network interface, then select :guilabel:`Create alias` item.
it: Per aggiungere un alias, fare clic sul menu tree-dots :guilabel:`⋮` nell'angolo destro dell'interfaccia di rete esistente, quindi selezionare :guilabel:`Crea alias`.

source: IP aliases on PPPoE interface could not work properly, due to different implementations of internet providers.
it: Gli alias IP sull'interfaccia PPPoE potrebbero non funzionare correttamente, a causa delle diverse implementazioni adottate dai vari provider internet.

source: Logical interfaces
it: Interfacce logiche

source: Click on the :guilabel:`Add logical interface` button to create a new virtual network device. As first step, select a role for the network interface. You can also create a logical interface without a role to use it later with modules like :ref:`dedalo-section`.
it: Fare clic sul pulsante :guilabel:`Nuova interfaccia logica` per creare un nuovo dispositivo di rete virtuale. Come primo passaggio, selezionare un ruolo per l'interfaccia di rete. È anche possibile creare un'interfaccia logica senza un ruolo per usarla in seguito con moduli come :ref:`dedalo-section`.

source: Supported logical interfaces are:
it: Interfacce logiche supportate:

source: :index:`bond`: arrange two or more network interfaces (provides load balancing and fault tolerance)
it: :index:`bond`: combina due o più interfacce, garantisce bilanciamento del traffico e tolleranza ai guasti

source: :index:`bridge`: connect two different networks (it's often used for bridged VPN and virtual machine)
it: :index:`bridge`: collega due reti distinte, è spesso utilizzata per le VPN in bridge e le macchine virtuali

source: :index:`VLAN` (Virtual Local Area Network): create two or more logically separated networks using a single interface
it: :index:`VLAN` (Virtual Local Area Network): crea due o più reti fisicamente separate usando una singola interfaccia fisica

source: **Bonds** allow you to aggregate bandwidth or tolerate link faults. Bonds can be configured in multiple modes.
it: I bond consentono di aggregare banda o tollerare guasti. I bond posso essere configurati in varie modalità.

source: Modes providing load balancing and fault tolerance:
it: Modalità che forniscono bilanciamento del carico e tolleranza ai guasti:

source: Balance Round Robin (recommended)
it: Balance Round Robin (raccomandato)

source: 802.3ad (LACP): it requires support at driver level and a switch with IEEE 802.3ad Dynamic link aggregation mode enabled
it: 802.3ad (LACP): richiede il supporto nel driver della scheda di rete ed uno switch in cui sia abilitata la modalità IEEE 802.3ad Dynamic link

source: Balance TLB: it requires support at driver level
it: Balance TLB: richiede il supporto nel driver della scheda di rete

source: Modes providing fault tolerance only:
it: Modalità che supportano solo tolleranza ai guasti:

source: Active backup (recommended)
it: Active backup (raccomandato)

source: A **bridge** has the function to connect different network segments, for example by allowing virtual machines, or client connected using a VPN, to access to the local network (green).
it: Un **bridge** ha la funzione di collegare segmenti di rete differenti, per esempio consentendo ai client collegati in VPN o macchine virtuali di accedere alla rete locale (green).

source: When it is not possible to physically separate two different networks, you can use a tagged **VLAN**. The traffic of the two networks can be transmitted on the same cable, but it will be handled as if it were sent and received on separate network cards. The use of VLAN, requires properly configured switches.
it: Quando non è possibile separare fisicamente due reti diverse, è possibile utilizzare le **VLAN** con tag. Il traffico delle due reti può essere trasmesso sullo stesso cavo ma sarà trattato come se fosse inviato e ricevuto da due schede separate. L'utilizzo delle VLAN necessita di switch adeguatamente configurati.

source: :index:`PPPoE` (Point-to-Point Protocol over Ethernet) connects the server to Internet through a DSL modem. To create a new PPPoE connection, make sure to have an unassigned Ethernet network interface.
it: :index:`PPPoE` (Point-to-Point Protocol over Ethernet) permette di collegare il server a Internet tramite un modem DSL. Per creare una nuova connessione PPPoE, assicurarsi di disporre di un'interfaccia di rete Ethernet non assegnata.

source: First, click on the :guilabel:`Configure` button on the unassigned network device, than select the :guilabel:`WAN (red)` role and click :guilabel:`Next`. Finally select PPPoE as interface type and fill all required fields like :guilabel:`Username` and :guilabel:`Password`.
it: Per prima cosa, fare clic sul pulsante :guilabel:`Configura` sul dispositivo di rete non assegnato, quindi selezionare il ruolo :guilabel:`WAN (red)` e fare clic su :guilabel:`Successivo`. Infine selezionare PPPoE come tipo di interfaccia e compilare tutti i campi obbligatori come :guilabel:`Username` e :guilabel:`Password`.

source: Static routes
it: Rotte statiche

source: A static route is a rule that specifies how to route some network traffic that must not go through the default gateway.
it: Una rotta statica è una regola che specifica come instradare del traffico di rete che non deve passare per il default gateway.

source: To add a static routes, click the tree-dots menu :guilabel:`⋮` on right corner of an existing network interface, then select :guilabel:`Create route` item. The route must be specified using the CIDR format inside the :guilabel:`Network address` field, like ``10.0.0.0/24``. Static routes are added below the interface name.
it: Per aggiungere una rotta statica, fare clic sul menu tree-dots :guilabel:`⋮` nell'angolo destro di un'interfaccia di rete esistente, quindi selezionare :guilabel:`Crea rotta`. La rotta deve essere specificata usando la notazione CIDR all'interno del campo :guilabel:`Indirizzo di rete`, ad esempio ``10.0.0.0/24``. Le rotte statiche vengono aggiunte sotto al nome dell'interfaccia.

source: To remove and existing static route, click on the interface name then click on the :guilabel:`Delete` button.
it: Per rimuovere una rotta statica esistente, fare clic sul nome dell'interfaccia, quindi fare clic sul pulsante :guilabel:`Elimina`.

source: Remember to add the network to :ref:`trusted_networks-section`, if you wish to allow remote hosts to access local services.
it: Ricordarsi di aggiungere la rete tra le :ref:`trusted_networks-section`, se si desidera consentire agli host remoti di accedere ai servizi locali.

source: Diagnostic tools
it: Strumenti diagnostici

source: Diagnostic tools can be used to troubleshoot network problems. As starting point, use the :guilabel:`Routing info` button to see current routing rules.
it: Gli strumenti diagnostici possono essere utilizzati per risolvere i problemi di rete. Come punto di partenza, usare il pulsante :guilabel:`Tabella di routing` per vedere le regole di routing correnti.

source: Extra diagnostic tools can be accessed by clicking on the tree-dots menu :guilabel:`⋮` just on right of the routing information button. Available tools are:
it: È possibile accedere a strumenti diagnostici aggiuntivi facendo clic sul menu tree-dots :guilabel:`⋮` appena a destra del pulsante delle informazioni di routing. Gli strumenti disponibili sono:

source: Ping: send ICMP packets to a specific host
it: Ping: invia un pacchetto ICMP ad un specifico host

source: DNS lookup: perform a DNS query on a custom DNS server
it: DNS lookup: esegue una query DNS su un server DNS personalizzato

source: Traceroute: print the route packets trace to a target network host
it: Traceroute: stampa il percorso di instradamento dei pacchetti verso un host di rete di destinazione

source: Services
it: Servizi

source: The page contains a detailed list of all running services. Each service has the following fields:
it: La pagina contiene un elenco dettagliato di tutti i servizi in esecuzione. Ogni servizio ha i seguenti campi:

source: **Name**: systemd service name
it: **Nome**: nome del servizio di systemd

source: **Description**: optional description of service purpose
it: **Descrizione**: descrizione opzionale del servizio

source: **Enabled**: it indicates if a service is marked to be automatically started by the system, usually at boot
it: **Abilitato**: indica se un servizio è contrassegnato per essere avviato automaticamente dal sistema, solitamente all'avvio

source: **Running**: it indicates if the service is actually running, regardless of its enabled/disabled state
it: **Avviato**: indica se il servizio è effettivamente in esecuzione, indipendentemente dal suo stato abilitato / disabilitato

source: **Details**: inspect all service options by clicking the :guilabel:`View` link
it: **Dettagli**: consente di ispezionare tutte le opzioni del servizio facendo clic sul collegamento :guilabel:`Visualizza`

source: A :index:`network service` is a service which has network access and can list TCP/UDP ports to accept local or remote connections. Specific fields for network services are:
it: Un :index:`servizio di rete` è un servizio che ha accesso alla rete e può elencare le porte TCP/UDP per accettare connessioni locali o remote. I campi specifici per i servizi di rete sono:

source: **Access**: it can be one ore more network role (like red, green, etc) or a firewall zone
it: **Accesso**: può includere uno o più ruoli di rete (come red, green, ecc.) O una zona firewall

source: **Ports**: list of TCP and/or UDP ports
it: **Porte**: lista di porte TCP e/o UDP

source: Existing services can be started and stopped directly from the buttons under the **Action** field. Extra actions are available by clicking the tree-dots menu :guilabel:`⋮`.
it: I servizi esistenti possono essere avviati e arrestati direttamente dai pulsanti sotto il campo **Azione**. Sono disponibili azioni extra facendo clic sul menu tree-dots :guilabel:`⋮`.

source: Adding new services
it: Aggiungere nuovi servizi

source: All |product| modules automatically configure their own network services.
it: Tutti i moduli di |product| configurano automaticamente i propri servizi di rete.

source: Access to custom network services is denied by default. To overcome this limitation, the administrator can create a new network service by clicking on the :guilabel:`Add network service` button.
it: L'accesso ai servizi di rete personalizzati è negato per impostazione predefinita. Per superare questa limitazione, l'amministratore può creare un nuovo servizio di rete facendo clic sul pulsante :guilabel:`Aggiungi servizio di rete`.

source: Certificates
it: Certificati

source: The :guilabel:`Certificates` page shows the currently installed X.509 certificates, and the default one provided by system services for TLS/SSL encrypted communications.
it: La pagina :guilabel:`Certificati` mostra i certificati X.509 attualmente installati e il certificato di default fornito dal sistema per cifrare le comunicazioni TLS/SSL.

source: |product| checks the certificates validity and sends an email to the root user if a certificate is near to expire and can't be automatically renewed.
it: |product| controlla la validità del certificato e invia una email all'utente root se il certificato sta per scadere e non può essere rinnovato automaticamente.

source: The :guilabel:`Set as default` button, available under the the tree-dots menu :guilabel:`⋮`, allows choosing the default certificate. When a new certificate is chosen, all services using TLS/SSL are restarted and network clients will be required to accept the new certificate.
it: Il pulsante :guilabel:`Imposta default`, disponibile all'interno del menu tree-dots :guilabel:`⋮`, consente di scegliere il certificato di default. Quando viene scelto un nuovo certificato, tutti i servizi che utilizzano TLS/SSL vengono riavviati e i client di rete devono accettare il nuovo certificato.

source: When |product| is installed a default RSA self-signed certificate is generated. It should be edited by inserting proper values before configuring the network clients to use it. When the self-signed certificate is due to expire a new one is automatically generated from the same RSA key and with the same attributes.
it: Quando si installa |product|, viene automaticamente generato un certificato RSA auto-firmato. Dovrebbe essere modificato inserendo dei valori appropriati prima di utilizzarlo dai client di rete. Quando il certificato auto-firmato sta per scadere ne viene creato automaticamente uno nuovo con la stessa chiave RSA e gli stessi attributi.

source: The :guilabel:`Server certificate` page also allows:
it: La pagina :guilabel:`Certificato del server` permette anche di:

source: uploading an existing certificate and private RSA/ECC key. Optionally a certificate chain file can be specified, too. All files must be PEM-encoded.
it: caricare un certificato esistente e la chiave privata RSA/ECC. In aggiunta può essere specificato anche un chain file. Tutti i file devono essere codificati nel formato PEM.

source: requesting a new `Let's Encrypt <https://letsencrypt.org/>`_ certificate. This is possible if the following requirements are met:
it: richiedere un nuovo certificato `Let's Encrypt <https://letsencrypt.org/>`_ . Questo è possibile se sono rispettati i seguenti requisiti:

source: The server must be reachable from outside at port 80. Make sure your port 80 is open to the public Internet (you can check with sites like `CSM <http://www.canyouseeme.org/>`_);
it: il server deve essere raggiungibile dall'esterno alla porta 80. Assicurarsi che la porta 80 è aperta alle connessioni da Internet (si può effettuare un test da siti come `CSM <http://www.canyouseeme.org/>`_):

source: The domains that you want the certificate for must be public domain names associated to server own public IP. Make sure you have public DNS name pointing to your server (you can check with sites like `VDNS <http://viewdns.info/>`_).
it: I domini che si vogliono associare al certificato devono essere domini pubblici, associati all'indirizzo IP pubblico del server. Assicurarsi di avere un nome registrato nel DNS pubblico che punta correttamente al proprio server (si può effettuare un test da siti come `VDNS <http://viewdns.info/>`_).

source: Wild card certificates (i.e. ``*.nethserver.org``) are not supported.
it: I certificati wildcard (es. ``*.nethserver.org``) non sono supportati.

source: The :guilabel:`Notification email` will be used by Let's Encrypt to send notifications about the certificate.
it: Il campo :guilabel:`Invia notifiche a` verrà usato da Let's Encrypt per inviare notifiche sul certificato.

source: The Let's Encrypt certificate is automatically renewed 30 days before expiration date.
it: Il certificato Let's Encrypt viene automaticamente rinnovato 30 giorni prima della scadenza.

source: To avoid problems while importing the certificate in Internet Explorer, the Common Name (CN) field should match the server FQDN.
it: Per evitare problemi di importazione certificato con Internet Explorer, si consiglia di configurare il campo CN (Common Name) o Nome Comune in modo che corrisponda al FQDN del server.

source: Delete a certificate
it: Eliminare un certificato

source: Unused certificated can be deleted by clicking the by clicking the :guilabel:`Delete` button under the tree-dots menu :guilabel:`⋮`.
it: I certificate non utilizzati possono essere eliminati cliccando il pulsante :guilabel:`Elimina` all'interno del menu :guilabel:`⋮`.

source: The builtin certificate can't be deleted.
it: Il certificato builtin non può essere eliminato.
