Repository: NethServer/docs
Catalog: administrator-manual/*/locale/*/LC_MESSAGES/*_system2.po
Languages: it

source: Eventually, the root user can retrieve recovery codes for a user. Use the following command and replace ``<user>`` with the actual user name : ::
it: Successivamente, l'utente root potrà ottenere i codici di recupero per un utente utilizzando il seguente comando, sostituendo ``<user>`` con il nome utente effettivo: ::

source: Example for user ``goofy``: ::
it: Esempio per l'utente ``goofy``: ::
