Repository: NethServer/docs
Catalog: administrator-manual/*/locale/*/LC_MESSAGES/*_system.po
Languages: es

source: Base system
es: Sistema base

source: This chapter describes all available modules at the end of installation. All modules outside this section must be installed from the :ref:`software-center-section` page, including :ref:`backup-section`.
es: Este capítulo describe todos los módulos disponibles al final de la instalación. Todos los módulos fuera de esta sección deben instalarse desde la página :ref:`software-center-section`, incluyendo :ref:`backup-section`.

source: The :index:`Dashboard` page is the landing page after a successful login. The page will display the :index:`status` and configuration of the system.
es: La página :index:`Dashboard` es la página de destino después de un inicio de sesión satisfactorio. La página mostrará el :index:`estado` y la configuración del sistema.

source: Disk analyzer
es: Analizador de disco

source: This tool is used to visualize :index:`disk usage` in a simple and nice graph in which you can interact with, click, and double click to navigate in the directories tree.
es: Esta herramienta se utiliza para visualizar el :index:`uso del disco` en un simple y agradable gráfico en el que puedes interactuar, hacer clic y hacer doble clic para navegar en el árbol de directorios.

source: After installation go to the :guilabel:`Dashboard`, and then :guilabel:`Disk usage` tab, and click :guilabel:`Update` in order to index the root directory and display the graph. This process can take several minutes depending on the occupied disk space.
es: Después de la instalación, vaya a la pestaña :guilabel:`Dashboard`, y luego :guilabel:`Uso del disco`, y haga clic en :guilabel:`Actualizar` para indexar el directorio raíz y mostrar el gráfico. Este proceso puede tomar varios minutos dependiendo del espacio en disco ocupado.

source: Well known folders are:
es: Las carpetas conocidas son:

source: Shared folders: :file:`/var/lib/nethserver/ibay`
es: Carpetas compartidas: :file:`/var/lib/nethserver/ibay`

source: User home directories: :file:`/var/lib/nethserver/home`
es: Directorios de los usuarios: :file:`/var/lib/nethserver/home`

source: Mail: :file:`/var/lib/nethserver/vmail`
es: Correo: :file:`/var/lib/nethserver/vmail`

source: MySQL databases: :file:`/var/lib/mysql`
es: Bases de datos MySQL: :file:`/var/lib/mysql`

source: Network
es: Red

source: The :guilabel:`Network` page configures how the server is connected to the local network (LAN) and/or other networks (i.e. Internet).
es: La página :guilabel:`Red` configura cómo el servidor está conectado a la red local (LAN) y/o a otras redes (es decir, Internet).

source: If the server has firewall and gateway functionality, it will handle extra networks with special functions like DMZ (DeMilitarized Zone) and guests network.
es: Si el servidor tiene funcionalidad de firewall y gateway, manejará redes adicionales con funciones especiales como DMZ (Zona desmilitarizada) y la red de invitados.

source: |product| supports an unlimited number of network interfaces. Any network managed by the system must follow these rules:
es: |product| soporta un número ilimitado de interfaces de red. Cualquier red administrada por el sistema debe seguir estas reglas:

source: networks must be physically separated (multiple networks can't be connected to the same switch/hub)
es: Las redes deben estar físicamente separadas (no se pueden conectar múltiples redes al mismo conmutador/concentrador)

source: networks must be logically separated: each network must have different addresses
es: Las redes deben estar lógicamente separadas: cada red debe tener direcciones diferentes

source: private networks, like LANs, must follow address's convention from RFC1918 document See :ref:`RFC1918-section`
es: Las redes privadas, como las LAN, deben seguir la convención de la dirección del documento RFC1918 Ver :ref:`RFC1918-section`

source: Every network interface has a specific *role* which determines its behavior. All roles are identified by colors. Each role corresponds to a well-known *zone* with special network traffic rules:
es: Cada interfaz de red tiene un *rol* específico que determina su comportamiento. Todos los roles se identifican por colores. Cada función corresponde a una *zona* conocida con reglas especiales de tráfico de red:

source: *green*: local network (green role/zone). Hosts on this network can access any other configured network
es: *verde*: red local (función/zona verde). Los hosts de esta red pueden acceder a cualquier otra red configurada

source: *blue*: guests network (blue role/zone). Hosts on this network can access orange and red networks, but can't access the green network
es: *azul*: red de invitados (función/zona azul). Los hosts de esta red pueden acceder a redes naranjas y rojas, pero no pueden acceder a la red verde

source: *orange*: DMZ network (orange role/zone). Hosts on this network can access red network, but can't access to blue and green networks
es: *naranja*: red DMZ (función/zona naranja). Los hosts de esta red pueden acceder a la red roja, pero no pueden acceder a redes azules y verdes

source: *red*: public network (red role/zone). Hosts on this network can access only the server itself
es: *roja*: red pública (funcion/zona roja). Los hosts de esta red sólo pueden acceder al servidor en sí

source: See :ref:`policy-section` for more information on roles and firewall rules.
es: Consulte :ref:`policy-section` para obtener más información sobre las funciones y las reglas de firewall.

source: The server must have at least one network interface. When the server has only one interface, this interface must have green role.
es: El servidor debe tener al menos una interfaz de red. Cuando el servidor tiene sólo una interfaz, esta interfaz debe tener rol verde.

source: If the server is installed on a public VPS (Virtual Private Server), it should must be configured with a green interface. All critical services should be closed using :ref:`network_services-section` panel.
es: Si el servidor está instalado en un VPS público (Virtual Private Server), debe estar configurado con una interfaz verde. Todos los servicios críticos deben cerrarse mediante el panel :ref:`network_services-section`.

source: Use alias IP to assign more IP addresses to the same NIC.
es: Utilice alias IP para asignar más direcciones IP a la misma NIC.

source: The most common use is with a red interface: when the ISP provides a pool of public IP addresses (within the same subnet) you can add some (or all) of them to the same red interface and manage them individually (e.g. in the port forward configuration).
es: El uso más común es con una interfaz roja: cuando el ISP proporciona un grupo de direcciones IP públicas (dentro de la misma subred), puede agregar algunas (o todas) a la misma interfaz en rojo y administrarlas individualmente (por ejemplo, en la configuración de reenvío de puertos).

source: Alias IP section can be found in the dropdown menu of the related network interface.
es: La sección IP de alias se puede encontrar en el menú desplegable de la interfaz de red relacionada.

source: Alias IPs on PPPoE interface could not work properly, due to different implementations of the service made by internet providers.
es: Los Alias de las IP en la interfaz PPPoE podrían no funcionar correctamente, debido a las diferentes implementaciones del servicio realizado por los proveedores de Internet.

source: Logical interfaces
es: Interfaces lógicas

source: In :guilabel:`Network` page press the :guilabel:`New interface` button to create a logical interface. Supported logical interfaces are:
es: En la página :guilabel:`Red` pulse el botón :guilabel:`Nueva interfaz` para crear una interfaz lógica. Las interfaces lógicas soportadas son:

source: :index:`bond`: arrange two or more network interfaces (provides load balancing and fault tolerance)
es: :index:`balanceo`: organiza dos o más interfaces de red (proporciona equilibrio de carga y tolerancia a fallos)

source: :index:`bridge`: connect two different networks (it's often used for bridged VPN and virtual machine)
es: :index:`puente`: conecta dos redes diferentes (a menudo se utiliza para puentear VPN y máquina virtual)

source: :index:`VLAN` (Virtual Local Area Network): create two or more logically separated networks using a single interface
es: :index:`VLAN` (Virtual Local Area Network): crea dos o más redes separadas lógicamente utilizando una sola interfaz

source: :index:`PPPoE` (Point-to-Point Protocol over Ethernet): connect to Internet through a DSL modem
es: :index:`PPPoE` (Point-to-Point Protocol over Etherne): conéctese a Internet a través de un módem DSL

source: **Bonds** allow you to aggregate bandwidth or tolerate link faults. Bonds can be configured in multiple modes.
es: **Los balances** le permiten agregar ancho de banda o tolerar errores de enlace. Los balances se pueden configurar en varios modos.

source: Modes providing load balancing and fault tolerance:
es: Modos que proporcionan equilibrio de carga y tolerancia a fallos:

source: Balance Round Robin (recommended)
es: Balance Round Robin (recomendado)

source: 802.3ad (LACP): it requires support at driver level and a switch with IEEE 802.3ad Dynamic link aggregation mode enabled
es: 802.3ad (LACP): requiere soporte a nivel de controlador y un conmutador con IEEE 802.3ad Modo de agregación de vínculo dinámico habilitado

source: Balance TLB: it requires support at driver level
es: Balance TLB: requiere soporte a nivel de driver

source: Modes providing fault tolerance only:
es: Modos que proporcionan tolerancia a fallos solamente:

source: Active backup (recommended)
es: Copia de seguridad activa (recomendado)

source: Broadcast policy
es: Política de difusión

source: A **bridge** has the function to connect different network segments, for example by allowing virtual machines, or client connected using a VPN, to access to the local network (green).
es: Un **puente** tiene la función de conectar los diferentes segmentos de la red, por ejemplo, permitiendo máquinas virtuales, o un cliente conectado a través de una VPN, para acceder a la red local (verde).

source: When it is not possible to physically separate two different networks, you can use a tagged **VLAN**. The traffic of the two networks can be transmitted on the same cable, but it will be handled as if it were sent and received on separate network cards. The use of VLAN, requires properly configured switches.
es: Cuando no es posible separar físicamente dos redes diferentes, puede utilizar una **VLAN** etiquetada. El tráfico de las dos redes se puede transmitir en el mismo cable, pero se manejará como si fuera enviado y recibido en tarjetas de red separadas. El uso de VLAN, requiere switches configurados correctamente.

source: The **PPPoE** logical interface must be assigned the red role, thus requires the gateway functionality. See :ref:`firewall-section` for details.
es: La interfaz lógica **PPPoE** debe asignarse al rol rojo, por lo que se requiere la funcionalidad de la pasarela o gateway. Véase :ref:`firewall-section` para más detalles.

source: Address for private networks (RFC1918)
es: Dirección para redes privadas (RFC1918)

source: TCP/IP private networks not directly connected to Internet should use special addresses selected by Internet Assigned Numbers Authority (IANA).
es: Las redes privadas TCP/IP que no estén conectadas directamente a Internet deben utilizar direcciones especiales seleccionadas por la Autoridad de Números Asignados de Internet (IANA).

source: Private network
es: Red privada

source: Subnet mask
es: Máscara de subred

source: IP addresses interval
es: Intervalo de direcciones IP

source: Network services
es: Servicios de red

source: A :index:`network service` is a service running on the firewall itself.
es: Un :index:`servicio de red` es un servicio que se ejecuta en el propio firewall.

source: Each service has a list of "open" ports on which it answers to connections. Connections can be accepted from selected zones. Finer grained control of access to network services can be configured from the Firewall rules page.
es: Cada servicio tiene una lista de puertos "abiertos" en los que responde a las conexiones. Se pueden aceptar conexiones desde zonas seleccionadas. Puede configurarse un control más detallado del acceso a los servicios de red desde la página de reglas del firewall.

source: Trusted networks
es: Redes de confianza

source: Trusted networks are special networks (local, VPNs or remote) allowed to access special server's services.
es: Las redes de confianza son redes especiales (locales, VPN o remotas) que pueden acceder a los servicios de un servidor especial.

source: For example, hosts inside trusted networks can access to:
es: Por ejemplo, los hosts dentro de redes de confianza pueden acceder a:

source: Server Manager
es: Administrador del servidor

source: Shared folders (SAMBA)
es: Carpetas compartidas (SAMBA)

source: If the remote network is reachable using a router, remember to add a static route inside :ref:`static_routes-section` page.
es: Si la red remota es accesible mediante un router, recuerde agregar una ruta estática dentro de la página :ref:`static_routes-section`.

source: Static routes
es: Rutas estáticas

source: This page allow to create special :index:`static routes` which will use the specified gateway. These routes are usually used to connect private network.
es: Esta página permite crear :index:`rutas estáticas` especiales que usará la puerta de enlace especificada. Estas rutas se utilizan generalmente para conectar la red privada.

source: Remember to add the network to :ref:`trusted_networks-section`, if you wish to allow remote hosts to access local services.
es: Recuerde agregar la red a :ref:`trusted_networks-section`, si desea permitir que los hosts remotos tengan acceso a los servicios locales.

source: Organization contacts
es: Organización contactos

source: The :guilabel:`Organization contacts` page fields are used as default values for user accounts. The organization name and address are also displayed on the Server Manager login screen.
es: Los campos de la página :guilabel:`Organización contactos` se utilizan como valores predeterminados para las cuentas de usuario. El nombre y la dirección de la organización también se muestran en la pantalla de inicio de sesión del Administrador del servidor.

source: Server certificate
es: Certificado del servidor

source: The :guilabel:`Server certificate` page shows the currently installed X.509 certificates, and the default one provided by system services for TLS/SSL encrypted communications.
es: La página del :guilabel:`Certificado del servidor` muestra los certificados X.509 actualmente instalados y el predeterminado proporcionado por los servicios del sistema para las comunicaciones cifradas TLS/SSL.

source: The :guilabel:`Set as default` button allows choosing the default certificate. When a new certificate is chosen, all services using TLS/SSL are restarted and network clients will be required to accept the new certificate.
es: El botón: guilabel: `Establecer predeterminado` permite elegir el certificado por defecto. Cuando se elige un nuevo certificado, todos los servicios que utilizan TLS/SSL se reinician y los clientes de red deben aceptar el nuevo certificado.

source: When |product| is installed a temporary default self-signed certificate is generated automatically. It should be edited by inserting proper values before configuring the network clients to use it. As alternatives, the :guilabel:`Server certificate` page allows:
es: Cuando |product| se instala un certificado autofirmado predeterminado temporal se genera automáticamente. Debe ser editado insertando los valores correctos antes de configurar los clientes de la red para usarlos. Como alternativa, la página :guilabel:`Certificado del servidor` permite:

source: uploading an existing certificate and private RSA key. Optionally a certificate chain file can be specified, too. All files must be PEM-encoded.
es: cargar un certificado existente y una clave RSA privada. También se puede especificar un archivo de cadena de certificados. Todos los archivos deben estar codificados con PEM.

source: requesting a new *Let's Encrypt* [#Letsencrypt]_ certificate. This is possible if the following requirements are met:
es: solicitar un nuevo certificado de *Let's Encrypt* [#Letsencrypt]_. Esto es posible si se cumplen los siguientes requisitos:

source: The server must be reachable from outside at port 80. Make sure your port 80 is open to the public Internet (you can check with sites like [#CSM]_);
es: El servidor debe ser accesible desde el exterior en el puerto 80. Asegúrese de que su puerto 80 está abierto a la Internet pública (puede consultar con sitios como [#CSM]_);

source: The domains that you want the certificate for must be public domain names associated to server own public IP. Make sure you have public DNS name pointing to your server (you can check with sites like [#VDNS]_).
es: Los dominios que desea que el certificado de debe ser los nombres de dominio público asociado a la IP pública del servidor propio. Asegúrese de que tiene un nombre DNS público que apunta a su servidor (puede consultar con sitios como [#VDNS]_).

source: To avoid problems while importing the certificate in Internet Explorer, the Common Name (CN) field should match the server FQDN.
es: Para evitar problemas al importar el certificado en Internet Explorer, el campo Nombre Común (CN) debe coincidir con el FQDN de servidor.

source: Let's Encrypt website https://letsencrypt.org/
es: Sitio web Let's Encrypt https://letsencrypt.org/

source: Website http://www.canyouseeme.org/
es: Sitio web http://www.canyouseeme.org/

source: Website http://viewdns.info/
es: Sitio web http://viewdns.info/

source: Shutdown
es: Apagar

source: The machine where |product| is installed can be rebooted or halted from the :menuselection:`Shutdown` page. Choose an option (reboot or halt) then click on submit button.
es: La máquina donde |product| está instalado puede reiniciarse o detenerse desde la página :menuselection:`Apagar`. Seleccione una opción (reiniciar o detener) y, a continuación, haga clic en el botón Enviar.

source: Always use this module to avoid bad shutdown which can cause data damages.
es: Utilice siempre este módulo para evitar un apagado incorrecto que pueda causar daños en los datos.

source: Log viewer
es: Visor de registro

source: All services will save operations inside files called :dfn:`logs`. The :index:`log` analysis is the main tool to find and resolve problems. To analyze log files click in :menuselection:`Log viewer`.
es: Todos los servicios guardarán las operaciones dentro de los archivos llamados :dfn:`logs`. El análisis de :index:`log` es la herramienta principal para encontrar y resolver problemas. Para analizar los archivos de registro, haga clic en :menuselection:`Visor de registro`.

source: This module allows to:
es: Este módulo permite:

source: start search on all server's logs
es: Iniciar la búsqueda en todos los registros del servidor

source: display a single log
es: Mostrar un solo registro

source: follow the content of a log in real time
es: Seguir el contenido de un registro en tiempo real

source: Date and time
es: Fecha y hora

source: After installation, make sure the server is configured with the correct timezone. The machine clock can be configured manually or automatically using public NTP servers (preferred).
es: Después de la instalación, asegúrese de que el servidor esté configurado con la zona horaria correcta. El reloj de la máquina puede configurarse manual o automáticamente utilizando servidores públicos NTP (de preferencia).

source: The machine clock is very important in many protocols. To avoid problems, all hosts in LAN can be configured to use the server as NTP server.
es: El reloj de la máquina es muy importante en muchos protocolos. Para evitar problemas, todos los hosts en LAN se pueden configurar para utilizar el servidor como servidor NTP.

source: Inline help
es: Ayuda en línea

source: All packages inside the Server Manager contain an :index:`inline help`. The inline help explains how the module works and all available options.
es: Todos los paquetes dentro del Administrador del servidor contienen una :index:`ayuda en línea`. La ayuda en línea explica cómo funciona el módulo y todas las opciones disponibles.

source: These help pages are available in all Server Manager's languages.
es: Estas páginas de ayuda están disponibles en todos los idiomas del Administrador de servidores.

source: A list of all available inline help pages can be found at the address: ::
es: Puede encontrar una lista de todas las páginas de ayuda en línea disponibles en la dirección: ::

source: **Example**
es: **Ejemplo**

source: If the server has address ``192.168.1.2``, and you want to see all English help pages, use this address: ::
es: Si el servidor tiene la dirección "192.168.1.2", y desea ver todas las páginas de ayuda en inglés, use esta dirección: ::
