Repository: NethServer/docs
Catalog: administrator-manual/*/locale/*/LC_MESSAGES/access2.po
Languages: it

source: Accessing the Server Manager
it: Accesso al Server Manager

source: Documentation about the old Server Manager is available :ref:`here <access-section>`.
it: La documentazione relativa al vecchio Server Manager è disponibile :ref:`qui <access-section>`.

source: |product| can be configured using the :dfn:`Server Manager` web interface. You need a web browser like Mozilla Firefox or Google Chrome to access the web interface using the address (URL) ``https://a.b.c.d:9090`` or ``https://server_name:9090`` where *a.b.c.d* and *server_name* respectively are the server IP address and name configured during installation.
it: |product| può essere configurato usando l'interfaccia web denominata :dfn:`Server Manager`. E' necessario un browser web come Mozilla Firefox o Google Chrome per accedere all'interfaccia utilizzando l'URL ``https://a.b.c.d:9090`` or ``https://nome-server:9090`` dove *a.b.c.d* e *nome-server* sono rispettivamente l'indirizzo IP e il nome host configurati durante l'installazione.

source: Since the Server Manager uses a self-signed SSL certificate as default, the first time you access the server you should explicitly accept the certificate. Despite the warning, the connection is safe and encrypted, but you are advised to configure a valid certificate, later.
it: Siccome, di default, il Server Manager utilizza un certificato SSL auto-firmato, al primo accesso verrà richiesto di accettare il certificato. Nonostante l'avviso, la connessione è sicura e cifrata, ma è consigliato configurare un certificato valido, in seguito.

source: The login page will give you a trusted access to the web interface. Log in as **root** and type the password chosen during |product| installation.
it: La pagina di login consente l'accesso fidato all'interfaccia web. Accedere come **root** e digitare la password scelta durante l'installazione di |product|.

source: The *unattended* install procedure sets the root password to the default ``Nethesis,1234``.
it: La procedura di installazione *unattended* imposta la password al default ``Nethesis,1234``.

source: Besides root, all users with a :ref:`delegated<delegation-section>` panel can access the Server Manager.
it: Oltre a root, tutti gli utenti con almeno una :ref:`delega<delegation-section>` possono accedere al Server Manager.

source: The web interface language is automatically chosen depending on your browser configuration. If you wish to change the language, go to your user name on the upper right corner of the screen and select :guilabel:`Display Language`.
it: La lingua dell'interfaccia web è selezionata automaticamente in base alla configurazione del proprio browser. Se si desidera cambiare lingua, selezionarla dal menù :guilabel:`Display Language` sul proprio nome utente nell'angolo in alto a destra dello schermo.

source: Login to remote servers
it: Accesso a server remoti

source: The login page allows access the local machine (default) or a remote one. To access a remote server, first make sure the server is accessible using SSH. Then click on :guilabel:`Other options` and enter the host name (or IP address) of the remote server inside the :guilabel:`Connect to` field.
it: La pagina di login permette di accedere alla macchina locale (default) o a macchine remote. Per accedere ad un server remoto, per prima cosa, assicurarsi che il server sia accessibile via SSH. Poi fare clic su :guilabel:`Other options` a inserire l'hostname (o l'indirizzo IP) del server remoto nel campo :guilabel:`Connect to`.

source: The Server Manager will try to access the remote machine using SSH on port 22. If the remote server use a different port, you can specify it with the ``host:port`` syntax (eg. ``a.b.c.d:222``).
it: Il Server Manager prova ad accedere al sistema remoto in SSH sulla porta 22. Se il server remoto utilizza una porta diversa, è possibile specificarla con la sintassi ``host:port`` (es. ``a.b.c.d:222``).

source: Hints
it: Suggerimenti

source: After login, the system is ready to be used but you're advised to review the list of hints which will guide you to correctly configure the machine. Hints are shown as yellow markers with a number over the left menu items.
it: Dopo il login, il sistema è pronto all'uso, ma viene suggerito di controllare un elenco di suggerimenti per configurare correttamente la macchina. I suggerimenti vengono mostrati sotto forma di marcatori gialli con un numero sopra le voci del menù di sinistra.

source: As best practice you should at least:
it: Come miglior prassi si dovrebbe almeno:

source: change the default root password
it: cambiare la password di default per l'utente root

source: set the correct date and time
it: configurare correttamente data e ora

source: Change the current password
it: Cambiare la password attuale

source: All users with access to the Server Manager can change their own password from the :guilabel:`Settings` menu.
it: Tutti gli utenti con accesso al Server Manager possono cambiare la propria password dal menù :guilabel:`Impostazioni`.

source: Users without shell access should use the old Server Manager. See :ref:`access-section`.
it: Gli utenti senza accesso alla shell devono usare il vecchio Server Manager. Vedere :ref:`access-section`.

source: Terminate the current Server Manager session by going to your user name on the upper right corner of the screen and by clicking on :guilabel:`Log Out`.
it: Concludere la sessione corrente del Server Manager cliccando :guilabel:`Esci` sul proprio nome utente nell'angolo in alto a destra dello schermo.
