Repository: NethServer/docs
Catalog: administrator-manual/*/locale/*/LC_MESSAGES/backup.po
Languages: es, it

source: Choose carefully the new interfaces assignment: doing a mistake here could lead to a system isolated from the network!
es: Elija cuidadosamente la nueva asignación de interfaces: ¡cometer un error aquí podría conducir a tener un sistema aislado de la red!
it: Assegnare con attenzione i ruoli alle nuove interfacce. Un errore può portare ad un sistema isolato dalla rete.

source: If the missing role is ``green`` an automatic procedure attempts to fix the configuration at boot-time, to ensure a minimal network connectivity and login again on the Server Manager.
it: Nel caso in cui fosse il ruolo ``green`` a mancare, in fase di avvio del sistema una procedura automatica tenterà di ripristinare la configurazione di rete essenziale per consentire di accedere nuovamente al Server Manager.

source: Backup
es: Copia de seguridad

source: :index:`Backup` is the only way to restore a machine when disasters occur. The system handles two kinds of backup:
es: :Index:`Backup` es la única manera de restaurar una máquina cuando ocurren desastres. El sistema maneja dos tipos de copia de seguridad:

source: Configuration backup contains only system configuration files. It's scheduled to be executed every night and it will create a new archive, :file:`/var/lib/nethserver/backup/backup-config.tar.xz`, only if any file is changed in the last 24 hours. The configuration backup also saves a list of installed modules. All modules will be reinstalled during the configuration restore process. The purpose of this kind of backup is to quickly restore a machine in case of disaster recovery. When the machine is functional, a full data restore can be done even if the machine is already in production.
es: La copia de seguridad de la configuración sólo contiene los archivos de configuración del sistema. Está programada para ser ejecutada cada noche y creará un nuevo archivo, :file:`/var/lib/nethserver/backup/backup-config.tar.xz`, sólo si algún archivo se cambia en las últimas 24 horas. La copia de seguridad de la configuración también guarda una lista de módulos instalados. Todos los módulos se reinstalarán durante el proceso de restauración de la configuración. El propósito de este tipo de copia de seguridad es restaurar rápidamente una máquina en caso de recuperación de desastres. Cuando la máquina está funcionando, se puede realizar una restauración completa de los datos incluso si la máquina ya está en producción.

source: Data backup is enabled installing "backup" module and contains all data like user's home directories and mails. It runs every night and can be full or incremental on a weekly basis. This backup also contains the archive of the configuration backup.
es: La copia de seguridad de datos está habilitada para instalar el módulo de "copia de seguridad" y contiene todos los datos como los directorios y correos de inicio del usuario. Se ejecuta cada noche y puede ser completa o incremental sobre una base semanal. Esta copia de seguridad también contiene el archivo de la copia de seguridad de configuración.

source: Data backup can be saved on different destinations:
es: Los datos de respaldo pueden ser guardados en destinos diferentes

source: CIFS: Windows shared folder, it's available on all NAS (Network Attached Storage)
es: CIFS: Carpeta compartida de Windows, está disponible en todas las NAS (Network Attached Storage)

source: WebDAV: available on many NAS and remote servers (Use a server with a valid SSL certificate as webDAV target, otherwise the system will fail mounting the filesystem)
es: WebDAV: disponible en muchos NAS y servidores remotos (Utilice un servidor con un certificado SSL válido como destino webDAV, de lo contrario el sistema fallará al montar el sistema de archivos)

source: The backup status can be notified to the system administrator or to an external mail address.
es: El estado de la copia de seguridad se puede notificar al administrador del sistema o a una dirección de correo externa.

source: The destination directory is based on the server host name: in case of FQDN change, the administrator should take care to copy backup data from the old directory to the new one.
es: El directorio de destino se basa en el nombre de host del servidor: en caso de cambio de FQDN, el administrador debe tener cuidado de copiar los datos de copia de seguridad del directorio antiguo al nuevo.

source: Data restore
es: Restauración de datos

source: Make sure that backup destination is reachable (for example, USB disk must be connected).
es: Asegúrese de que el destino de la copia de seguridad está accesible (por ejemplo, debe estar conectado el disco USB).

source: Command line
es: Linea de comandos

source: Listing files
es: Listado de archivos

source: It's possible to list all files inside the last backup using this command: ::
es: Es posible listar todos los archivos dentro de la última copia de seguridad usando este comando: ::

source: The command can take some times depending on the backup size.
es: El comando puede tomar algún tiempo dependiendo del tamaño de la copia de seguridad.

source: File and directory
es: Archivo y directorio

source: The ``-t`` option allows to specify the number of days (15 in this scenario).
es: La opción ``-t`` permite especificar el número de días (15 en este escenario).

source: Graphic interface
es: Interfaz gráfica

source: In the :menuselection:`Restore files` menu section it is possible to search, select and restore one or more directories from backup, navigating the graphical tree with all paths included in the backup.
es: En la sección :menuselection:`Restaurar archivos`, es posible buscar, seleccionar y restaurar uno o más directorios desde la copia de seguridad, navegar por el árbol gráfico con todas las rutas incluidas en la copia de seguridad.

source: By default, last backup tree is shown. If you want to restore a file from a previous backup, select the backup date from *"Backup File"* selector.
es: De forma predeterminada, se muestra el último árbol de la copia de seguridad. Si desea restaurar un archivo de una copia de seguridad anterior, seleccione la fecha de la copia de seguridad en el selector *"Archivo de copia de seguridad"*.

source: There are two options to restore:
es: Hay dos opciones para restaurar:

source: Restore files in the original path, the current files in the filesystem are overwritten by the restored files from backup.
es: Al restaurar archivos en la ruta original, los existentes en el sistema de archivos se sobrescriben por los archivos restaurados desde la copia de seguridad.

source: Restore files in original path but the restored files from backup are moved on a new directory (the files are not overwritten) in this path: ::
es: Restaura archivos en la ruta original pero los archivos restaurados de la copia de seguridad se mueven a un nuevo directorio en esta ruta de acceso (los archivos no se sobrescriben): ::

source: To use the search field, simply insert at least 3 chars and the searching starts automatically, highlighting the matched directories
es: Para usar el campo de búsqueda, simplemente inserte al menos 3 caracteres y la búsqueda se inicia automáticamente, resaltando los directorios coincidentes

source: It is possible to restore the directories by clicking on **Restore** button.
es: Es posible restaurar los directorios haciendo clic en el botón **Restaurar**.

source: Multiple selection can be done with Ctrl key pressed.
es: La selección múltiple se puede hacer con la tecla Ctrl presionada.

source: Disaster recovery
es: Recuperación de desastres

source: The system is restored in two phases: configuration first, then data. Right after configuration restore, the system is ready to be used if proper packages are installed. You can install additional packages before or after restore. For example, if mail-server is installed, the system can send and receive mail.
es: El sistema se restablece en dos fases: primero configuración, luego datos. Justo después de la restauración de la configuración, el sistema está listo para ser utilizado si se instalan paquetes adecuados. Puede instalar paquetes adicionales antes o después de la restauración. Por ejemplo, si el servidor de correo está instalado, el sistema puede enviar y recibir correo.

source: Install the new machine with the same host name as the old one
es: Instale la nueva máquina con el mismo nombre de host que el antiguo

source: Configure a data backup, so the system can retrieve saved data and configuration
es: Configurar una copia de seguridad de datos, para que el sistema pueda recuperar datos guardados y configuración

source: Restore the configuration backup from page :guilabel:`Backup (configuration) > Restore` in Server Manager, or executing: :command:`restore-config`
es: Restaurar la copia de seguridad de la configuración desde la página :guilabel:`Copia de seguridad (configuración) > Restaurar` en el Administrador de servidores, o ejecutar: :command:`restore-config`

source: Restore data backup executing: :command:`restore-data`
es: Restaurar la copia de seguridad de datos ejecutando: :command:`restore-data`

source: If the missing role is ``green`` an interactive procedure asks to fix the configuration at boot-time, to ensure a minimal network connectivity and login again on the Server Manager.
es: Si el papel que falta es ``green``, un procedimiento interactivo pide que se fije la configuración durante el arranque, para asegurar una conectividad de red mínima y volver a iniciar sesión en el Administrador del servidor.

source: Restore installed modules
es: Restaure los módulos instalados

source: By default the process of configuration restore will also restore all previously installed modules.
es: De forma predeterminada, el proceso de restauración de la configuración también restaurará todos los módulos previamente instalados.

source: To skip the automatic installation, execute the command with the ``--no-reinstall`` argument: ::
es: Para omitir la instalación automática, ejecute el comando con el argumento ``--no-reinstall``: ::

source: Same syntax applies to configuration backup. Modification should be done inside the file :file:`/etc/backup-config.d/custom.exclude`.
es: La misma sintaxis se aplica a la copia de seguridad de configuración. Modificar el archivo :file:`/etc/backup-config.d/custom.exclude`.

source: For example, to backup :file:`/etc/httpd/conf.d/mycustom.conf` file , add this line: ::
es: Por ejemplo, al archivo de copia de seguridad :file:`/etc/httpd/conf.d/mycustom.conf`, agregue esta línea: ::

source: Do not add big directories or files to configuration backup.
es: No agregue directorios o archivos grandes a la copia de seguridad de la configuración.

source: If you wish to exclude a file or directory from configuration backup, add a line to the file :file:`/etc/backup-config.d/custom.exclude`.
es: Si desea excluir un archivo o directorio a la copia de seguridad de la configuración, agregue una línea al archivo :file:`/etc/backup-config.d/custom.exclude`.

source: The best filesystem for USB backup disks is EXT3. FAT filesystem is supported but *not recommended*, while NTFS is **not supported**.
es: El mejor sistema de archivos para copias de seguridad en unidades USB es EXT3. El sistema FAT se puede usar pero *no es recomendado*. Con NTFS directamente **no funciona**.

source: Create the filesystem on *sdc1* partition with a label named *backup*: ::
es: Cree el sistema de archivos en la partición *sdc1* con una etiqueta denominada *backup*: ::
