Repository: NethServer/docs
Catalog: administrator-manual/*/locale/*/LC_MESSAGES/backup.po
Languages: es, it

source: ``S3AccessKey``: user access key
it: ``S3AccessKey``: chiave d'accesso utente

source: ``S3Bucket``: bucket (directory) name
it: ``S3Bucket``: nome del bucket (directory)

source: ``S3Host``: S3 host, use ``s3.amazonaws.com`` for Amazon
it: ``S3Host``: host S3, utilizzare ``s3.amazonaws.com`` per Amazon

source: ``S3SecretKey``: secret access key
it: ``S3SecretKey``: chiave d'accesso secret

source: How to setup Amazon S3 access keys: https://restic.readthedocs.io/en/stable/080_examples.html
it: Come configurare le chiavi d'accesso su Amazon S3: https://restic.readthedocs.io/en/stable/080_examples.html

source: Backblaze B2, ``VFSType`` is ``b2``. Supported only by restic.
it: Backblaze B2, ``VFSType`` è ``b2``. Supportato solo da restic.

source: ``B2AccountId``: B2 account name
it: ``B2AccountId``: Nome account B2

source: ``B2AccountKey``: B2 account secret key
it: ``B2AccountKey``: chiave secret dell'account B2

source: ``B2Bucket``: B2 bucket (directory)
it: ``B2Bucket``: bucket (directory) B2

source: Restic REST server, ``VFSType`` is ``rest``. Supported only by restic.
it: Restic REST server, ``VFSType`` è ``rest``. Supportato solo da restic.

source: ``RestDirectory``: destination directory
it: ``RestDirectory``: directory di destinazione

source: ``RestHost``: REST server hostname or IP address
it: ``RestHost``: Nome host o indirizzo IP del server REST

source: ``RestPort``: REST sever port (default for server is 8000)
it: ``RestPort``: porta server REST (il default è 8000)

source: ``RestProtocol``: REST protocol, can be ``http`` or ``https``
it: ``RestProtocol``: Protocollo REST, può essere ``http`` o ``https``

source: ``RestUser``: user for authentication (optional)
it: ``RestUser``: utente per l'autenticazione (opzionale)

source: ``RestPassword``: password for authentication (optional)
it: ``RestPassword``: password per l'autenticazione (opzionale)

source: Examples
it: Esempi

source: Rsync backup, every day at 7:15 to a remote server. The SFTP backend requires the password of the remote server to execute SSH key exchange. ::
it: Backup rsync, ogni giorno alle 7:15 su un server remoto. Il backend SFTP richiede la password del server remoto per eseguire lo scambio di chiavi SSH: ::

source: Restic backup every day at 3:00 to Amazon S3, no retention limit: ::
it: Backup restic ogni giorno alle 3:00 su Amazon S3, nessun limite di conservazione: ::

source: Duplicity backup every day at 22:00 to CIFS, 10 days retention: ::
it: Backup duplicity ogni giorno alle 22:00, su CIFS, 10 giorni di conservazione:

source: To manually start a backup, execute: ::
it: Per avviare manualmente un backup, eseguire: ::

source: Where ``name`` is the backup name. For the examples above, the name is ``mybackup1``.
it: Dove ``name`` è il nome del backup. Per gli esempi sopra, il nome è ``mybackup1``.

source: Data backup customization
es: Personalización de la copia de seguridad de datos
it: Personalizzazione backup dati

source: If additional software is installed, the administrator can edit the list of files and directories included (or excluded).
es: Si se instala software adicional, el administrador puede editar la lista de archivos y directorios incluidos (o excluidos).
it: In caso di installazione di software aggiuntivi, potrebbe esser necessario modificare la lista delle directory e dei file inclusi (o esclusi) dal backup.

source: If you wish to add a file or directory to data backup, add a line to the file :file:`/etc/backup-data.d/custom.include`.
es: Si desea agregar un archivo o carpeta para copias de seguridad, agregue una línea al archivo :file:`/etc/backup-data.d/custom.include`.
it: Se si desidera includere una directory o un file nel backup dei dati, aggiungere una linea al file :file:`/etc/backup-data.d/custom.include`.

source: For example, to backup a software installed inside :file:`/opt` directory, add this line: ::
es: Por ejemplo, para hacer una copia de seguridad de un software instalado en el directorio :file:`/opt`, agregue esta línea: ::
it: Ad esempio, per eseguire il backup di un software installato nella directory :file:`/opt`, aggiungere la linea: ::

source: The same syntax applies to configuration backup. Modifications should be done inside the file :file:`/etc/backup-config.d/custom.include`.
it: La stessa sintassi si applica al backup della configurazione. Le modifiche dovranno essere incluse all'interno del file :file:`/etc/backup-config.d/custom.include`.

source: If you wish to exclude a file or directory from data backup, add a line to the file :file:`/etc/backup-data.d/custom.exclude`.
es: Si desea excluir un archivo o carpeta de hacer copias de seguridad, agregue una línea al archivo :file:`/etc/backup-data.d/custom.exclude`.
it: Se si desidera escludere una directory o un file dal backup dei dati, aggiungere una linea al file :file:`/etc/backup-data.d/custom.exclude`.

source: For example, to exclude all directories called *Download*, add this line: ::
es: Por ejemplo, para excluir todos los directorios llamados *Download*, agregue esta línea: ::
it: Ad esempio, per escludere dal backup tutte le directory chiamate *Download*, aggiungere la linea: ::

source: To exclude a mail directory called *test*, add this line: ::
es: Para excluir un listado de direcciones llamado *test*, agrege la siguiente línea: ::
it: Per escludere una casella di posta *test*, aggiungere la riga: ::

source: The same syntax applies to configuration backup. Modifications should be done inside the file :file:`/etc/backup-config.d/custom.exclude`.
it: La stessa sintassi si applica al backup della configurazione. Le modifiche dovrebbero essere fatte all’interno del file :file:`/etc/backup-config.d/custom.exclude`.

source: All multiple backups read the same configuration of the single backup, but the list of saved and excluded files can be customized using two special files, where ``name`` is the name of the multiple backup:
it: Tutti i backup multipli utilizzano la stessa configurazione del backup singolo, ma l'elenco dei file salvati ed esclusi può essere personalizzato utilizzando due file speciali, dove ``name`` è il nome del backup multiplo:

source: Both files will override the list of included and excluded data set from the single backup. The accepted syntax is the same as the single backup (see paragraph above).
it: Entrambi i file sostituiranno il set di dati inclusi ed esclusi dal singolo backup. La sintassi accettata è la stessa del backup singolo (vedere il paragrafo precedente).

source: For example, given a backup named ``mybackup1`` create the following files:
it: Ad esempio, dato un backup chiamato ``mybackup1`` creare i seguenti file:

source: Example
it: Esempio

source: It's possible to configure the single backup to save all data and create a multiple backup which includes only the mail and is scheduled each our.
it: E' possibile configurare il backup predefinito per salvare tutti i dati e creare un backup multiplo addizionale che include solo le email e viene eseguito ogni ora.

source: Configure the new ``mymailbackup``: ::
it: Configurare il nuovo backup ``mymailbackup``: ::

source: Create a custom include containing only the mail directory: ::
it: Creare un file include custom contenente solo la directory delle email: ::

source: Create an empty custom exclude file: ::
it: Creare un file exclude custom vuoto: ::

source: Apply the configuration: ::
it: Applicare la configurazione: ::

source: Make sure not to leave empty lines inside edited files.
es: Asegúrese de no dejar líneas vacías dentro de los archivos editados.
it: Assicurarsi di non lasciare linee vuote nei file modificati.

source: Selective restore of files
it: Ripristino selettivo dei file

source: Make sure that backup destination is reachable (for example, the USB disk must be connected).
it: Assicurarsi che la destinazione del backup sia raggiungibile (ad esempio, il disco USB deve essere collegato).

source: In the :guilabel:`Restore files` menu section it is possible to search, select and restore one or more directories from the backup, navigating the graphical tree with all paths included in the backup.
it: Nella sezione :guilabel:`Ripristino file` è possibile cercare, selezionare e ripristinare una o più directory dal backup, navigando tutti i percorsi inclusi nel backup nell'albero grafico.

source: By default, the latest backup tree is shown. If you want to restore a file from a previous backup, select the backup date from :guilabel:`Backup File` selector.
it: Per impostazione predefinita, viene mostrato l'albero del backup più recente. Se si desidera ripristinare un file da un backup precedente, selezionare la data di backup dal selettore :guilabel:`Backup file`.

source: There are two options when restoring:
it: Sono disponibili due opzioni in fase di ripristino:

source: Restore files in the original path, the current files in the filesystem are overwritten by the restored files from backup
it: Ripristina i file nel percorso originale, i file correnti nel filesystem vengono sovrascritti dai file ripristinati dal backup

source: Restore files in original path but the restored files from backup are moved to a new directory (the files are not overwritten) in this path: ::
it: Ripristina i file nel percorso originale ma i file ripristinati dal backup vengono spostati in una nuova directory (i file non vengono sovrascritti) in questo percorso: ::

source: To use the search field, simply insert at least 3 chars and the searching starts automatically, highlighting the matched directories.
it: Per utilizzare il campo di ricerca, è sufficiente inserire almeno 3 caratteri e la ricerca inizia automaticamente evidenziando le directory corrispondenti.

source: It is possible to restore the directories by clicking on the **Restore** button.
it: È possibile ripristinare le directory facendo clic sul pulsante **Ripristina**.

source: Multiple selection can be done with :kbd:`Ctrl` key pressed.
it: E' possibile effettuare una selezione multipla mantenendo premuto il tasto :kbd:`Ctrl`.

source: Command line procedure
it: Procedura da riga di comando

source: All relevant files are saved under :file:`/var/lib/nethserver/` directory:
es: Todos los archivos relevantes se guardan en el directorio :file:`/var/lib/nethserver/`
it: Tutti i dati sono sono posizionati nella directory :file:`/var/lib/nethserver/` :

source: Mails: :file:`/var/lib/nethserver/vmail/<user>`
es: Correos: :file:`/var/lib/nethserver/vmail/<user>`
it: Cartelle di posta: :file:`/var/lib/nethserver/vmail/<user>`

source: Shared folders: :file:`/var/lib/nethserver/ibay/<name>`
es: Carpetas compartidas: :file:`/var/lib/nethserver/ibay/<name>`
it: Cartelle condivise: :file:`/var/lib/nethserver/ibay/<name>`

source: User's home: :file:`/var/lib/nethserver/home/<user>`
es: Página de inicio del usuarios: :file:`/var/lib/nethserver/home/<user>`
it: Home utenti: :file:`/var/lib/nethserver/home/<user>`

source: It is possible to list all files inside the last backup using this command: ::
it: E' possibile elencare tutti i file all'interno dell'ultimo backup utilizzando il comando: ::

source: The command can take some time depending on the backup size.
it: L'esecuzione del comando può richiedere del tempo a seconda delle dimensioni del backup.

source: To restore a file/directory, use the command: ::
es: Para restaurar un archivo/directorio, utilice el comando: ::
it: Dopo aver individuato il file da ripristinare, usare il comando:

source: Example, restore *test* mail account to :file:`/tmp` directory: ::
es: Ejemplo, restaure la cuenta de correo *prueba* al directorio :file:`/tmp`: ::
it: Esempio, ripristinare nella directory :file:`/tmp` la cartella di posta *test*: ::

source: Example, restore *test* mail account to original position: ::
es: Ejemplo, restaure la cuenta del correo *prueba* a la posición original: ::
it: Esempio, ripristinare la cartella di posta *test* nella posizione originale: ::

source: The system can restore a previous version of directory (or file).
es: El sistema puede restaurar una versión anterior de directorio (o archivo).
it: Il sistema supporta la possibilità di ripristinare directory (o file) ad una versione precedente rispetto all’ultimo backup.

source: Example, restore the version of a file from 15 days ago: ::
es: Ejemplo, restaure la versión de un archivo de hace 15 días: ::
it: Esempio, ripristinare un file alla versione di 15 giorni fa: ::

source: The ``-t`` option allows to specify the number of days (15 in this scenario). When used with snapshot-based engines, the ``-t`` option requires the name of the snapshot to restore.
it: L'opzione ``-t`` consente di specificare il numero di giorni (15 in questo scenario). Quando viene utilizzato con engine basati su snapshot, l'opzione ``-t`` richiede il nome dello snapshot da ripristinare.

source: To list data inside a multiple backup, use: ::
it: Per elencare i dati all'interno di un backup multiplo, utilizzare: ::

source: To restore all data in the original location, use: ::
it: Per ripristinare tutti i dati nella posizione originale, utilizzare: ::

source: To restore a file or directory, use: ::
it: Per ripristinare un file o una directory, utilizzare: ::

source: When you are using *CIFS* to access the share, and the command doesn't work as expected, verify that user and password for the network share are correct. If user or password are wrong, you will find NT_STATUS_LOGON_FAILURE errors in :file:`/var/log/messages`. Also, you can use the :command:`backup-data-list` to check if the backup is accessible.
es: Cuando está utilizando *CIFS* para tener acceso al recurso compartido y el comando no funciona como se espera, compruebe que el usuario y la contraseña del recurso compartido de red son correctos. Si el usuario o la contraseña están equivocados, encontrará los errores NT_STATUS_LOGON_FAILURE en :file:`/var/log/messages`. Además, puede utilizar el :command:`backup-data-list` para comprobar si la copia de seguridad es accesible.
it: Nel caso si utilizzi *CIFS* per accedere alla condivisione e il comando di restore non funzioni nel modo atteso, verificare che utente e password della condivisione di rete siano corretti. Se la coppia utente/password è sbagliata nel file :file:`/var/log/messages` si troveranno degli errori di NT_STATUS_LOGON_FAILURE. Allo stesso tempo il comando backup-data-list non andrà a buon fine e uscirà immediatamente riportando degli errori.

source: USB disk configuration
es: Configuración del disco USB
it: Configurazione disco USB

source: The best filesystem for USB backup disks is EXT3 or EXT4. FAT filesystem is supported but *not recommended*, while NTFS is **not supported**. EXT3 or EXT4 is mandatory for the rsync engine.
it: Il miglior filesystem per dischi di backup USB è EXT3 o EXT4. Il filesystem FAT è supportato ma *non raccomandato*, mentre NTFS **non è supportato**. EXT3 o EXT4 è obbligatorio per il engine rsync.

source: Before formatting the disk, attach it to the server and find the device name: ::
es: Antes de formatear el disco, adjúntelo al servidor y busque el nombre del dispositivo: ::
it: Per eseguire la formattazione, è necessario collegare il disco e identificarlo correttamente: ::

source: Another good command could be: ::
es: Otro buen comando podría ser: ::
it: Un altro buon comando da utilizzare può essere: ::

source: In this scenario, the disk is accessibile as *sdc* device.
es: En este escenario, el disco es accesible como dispositivo *sdc*.
it: In questo esempio, il disco è stato riconosciuto come device *sdc*.

source: Create a Linux partition on the whole disk: ::
es: Crear una partición Linux en todo el disco:
it: Creare una unica partizione Linux sull’intero disco sdc: ::

source: Create the filesystem on *sdc1* partition with a label named *backup*. The filesystem should be tuned on the backup engine used: rsync and restic require a lot of inodes, where duplicity performs better on file systems optimized for large files.
it: Crea il filesystem sulla partizione *sdc1* con un'etichetta denominata *backup*. Il filesystem dovrebbe essere ottimizzato per l'engine di backup usato: rsync e restic richiedono molti inode, duplicity ha prestazioni migliori su file system ottimizzati per file di grandi dimensioni.

source: For duplicity use: ::
it: Per duplicity usare: ::

source: For rsync and restic use: ::
it: Per rsync e restic usare: ::

source: Detach and reconnect the USB disk:
es: Desconecte y vuelva a conectar el disco USB:
it: Scollegare e ricollegare il disco USB:

source: You can simulate it with the following command: ::
es: Puede simularlo con el siguiente comando:
it: E’ possibile utilizzare il comando seguente per simulare il collegamento del disco: ::

source: Now the *backup* label will be displayed inside the :guilabel:`Backup (data)` page.
es: Ahora la etiqueta *backup* aparecerá en la página :guilabel:`Copia de seguridad (datos)`.
it: A questo punto la voce *backup* sarà selezionabile dalla pagina :guilabel:`Backup (data)`.

source: The system is restored in two phases: configuration first, then data. Right after configuration restore, the system is ready to be used if the proper packages are installed. You can install additional packages before or after the restore. For example, if the mail-server is installed, the system can send and receive mails.
it: Il sistema viene ripristinato in due fasi: prima la configurazione, poi i dati. Subito dopo il ripristino della configurazione, il sistema è pronto per essere utilizzato se sono installati i pacchetti corretti. È possibile installare pacchetti aggiuntivi prima o dopo il ripristino. Ad esempio, se il server di posta è installato, il sistema può inviare e ricevere posta.

source: Other restored configurations:
es: Otras configuraciones restauradas:
it: Altre configurazioni ripristinate:

source: Users and groups
es: Usuarios y grupos
it: Utenti e gruppi

source: SSL certificates
es: Certificados SSL
it: Certificati SSL

source: The root/admin password is not restored.
es: La contraseña de root/admin no se ha restaurado.
it: La password di root/admin non viene ripristinata, verrà mantenuta quella impostata nel nuovo sistema.

source: Steps to be executed:
es: Pasos a ejecutar:
it: I passi da eseguire sono:

source: Install the new machine. If possible, enable a network connection at boot (refer to :ref:`installation-manual` section) to automatically re-install the required modules
it: Installa la nuova macchina. Se possibile, abilitare una connessione di rete all'avvio (fare riferimento alla sezione: ref:`installation-manual`) per reinstallare automaticamente i moduli richiesti

source: Access the Server Manager and follow the :ref:`first-configuration-wizard-section` procedure
it: Accedere al Server Manager e seguire la procedura :ref:`first-configuration-wizard-section`

source: At step :guilabel:`Restore configuration`, upload the configuration archive. The option :guilabel:`Download modules automatically` should be enabled.
it: Allo step :guilabel:`Ripristino configurazione` caricare il backup della configurazione. L'opzione :guilabel:`Scarica automaticamente moduli` può essere abilitata.

source: If a warning message requires it, reconfigure the network roles assignment. See :ref:`restore-roles-section` below.
es: Si un mensaje de advertencia lo requiere, reconfigure la asignación de roles de red. Ver :ref:`restore-roles-section` a continuación.
it: Se un avviso lo richiede, riconfigurare le interfacce di rete. Vedi :ref:`restore-roles-section`

source: Verify the system is functional
es: Verificar que el sistema es funcional
it: Verificare che la macchina sia funzionante

source: Restore data backup executing on the console ::
it: Ripristinare il backup dei dati eseguendo dalla console ::

source: Please note that the disaster recovery should be always performed from a local media (eg. NFS or USB) to speed up the process.
it: Si noti che il disater recovery dovrebbe essere sempre eseguito da un supporto locale (ad esempio NFS o USB) per velocizzare il processo.

source: Restore network roles
es: Restaurar funciones de red
it: Assegnamento delle interfacce di rete

source: If a role configuration points to a missing network interface, the :guilabel:`Dashboard`, :guilabel:`Backup (configuration) > Restore` and :guilabel:`Network` pages pop up a warning. This happens for instance in the following cases:
es: Si la configuración de roles apunta a una placa de red ausente, las páginas :guilabel:`Dashboard`, :guilabel:`Copia de seguridad (configuración) > Restaurar` y :guilabel:`Red` muestran una advertencia. Esto podría suceder en los siguientes casos:
it: Se la configurazione contiene una scheda di rete assente, le pagine :guilabel:`Dashboard`, :guilabel:`Backup (configurazione) > Ripristino` e :guilabel:`Network` mostrano un avviso. Questo può accadere per esempio nei seguenti casi:

source: configuration backup has been restored on a new hardware
es: La copia de seguridad de la configuración se ha restaurado en un nuevo hardware
it: dopo il ripristino del backup della configurazione su un nuovo hardware

source: one or more network cards have been substituted
es: Una o más tarjetas de red han sido sustituidas
it: una o più schede di rete sono state sostituite

source: system disks are moved to a new machine
es: Los discos del sistema se mueven a una nueva máquina
it: i dischi del sistema sono stati spostati su una nuova macchina

source: The warning points to a page that lists the network cards present in the system, highlighting those not having an assigned :ref:`role <network-section>`. Such cards have a drop down menu where to select a role available for restoring.
es: La advertencia sugiere una página que muestra una lista de placas de red instaladas en el sistema, resaltando las que no tienen asignadas un rol :ref:`rol <network-section>`. A estas últimas, se les puede restaurar el rol desde el menú desplegable.
it: L’avviso porta a una pagina che elenca le schede di rete fisiche presenti nel sistema, evidenziando quelle che non hanno un :ref:`ruolo <network-section>` assegnato. Per ogni scheda di questo tipo, un menù a discesa mostra i ruoli da assegnare.

source: For instance, if a card with the *orange* role has been replaced, the drop down menu will list an element ``orange``, near the new network card.
es: Por ejemplo, si una placa de red de rol "naranja" ha sido reemplazada; en el menú desplegable aparecerá listado un elemento "naranja" cerca de la placa de red.
it: Per esempio, se una scheda con ruolo *orange* è stata sostituita, il menù a discesa elencherà un elemento ``orange`` in corrispondenza della nuova scheda di rete.

source: The same applies if the old card was a component of a logical interface, such as a bridge or bond.
es: Lo mismo se aplica si la tarjeta antigua era un componente de una interfaz lógica, como un puente o enlace.
it: Lo stesso accade se la vecchia scheda era il componente di una interfaccia logica, come un bridge o un bond.

source: By picking an element from the drop down menu, the old role is transferred to the new physical interface.
es: Escogiendo un elemento del menú desplegable, el rol antiguo se transfiere a la nueva interfaz física.
it: Selezionando un elemento dal menù a discesa, le impostazioni del ruolo sono trasferiti alla nuova scheda.

source: Click the :guilabel:`Submit` button to apply the changes.
es: Haga clic en el botón :guilabel:`Submit` para aplicar los cambios.
it: Premendo il pulsante :guilabel:`Salva` le modifiche vengono applicate.
