Repository: NethServer/docs
Catalog: administrator-manual/*/locale/*/LC_MESSAGES/backup.po
Languages: es, it

source: :index:`Backup` is the only way to restore a machine when disasters occur. The system handles two kinds of backups:
it: Il :index:`backup` è l'unica procedura che consenta di ripristinare una macchina in caso di disastro. Il sistema gestisce due tipi di backup:

source: :index:`configuration backup`
es: :index:`copia de seguridad configuración`
it: :index:`backup della configurazione`

source: :index:`data backup`
es: :index:`copia de seguridad datos`
it: :index:`backup dei dati`

source: **Configuration backup** contains only system configuration files. The purpose of this kind of backup is to quickly restore a machine in case of :ref:`disaster recovery <disaster-recovery-section>`. When the machine is functional, a full data restore can be done even if the machine is already in production.
it: **Il backup della configurazione** contiene solo i file di configurazione del sistema. Lo scopo di questo tipo di backup è ripristinare rapidamente una macchina in caso di :ref:`disaster recovery <disaster-recovery-section>`. Quando la macchina è funzionate, è possibile eseguire un ripristino completo dei dati anche se la macchina è già in produzione.

source: **Data backup** is enabled by installing the "Backup" module and, by default, contains all the data stored in the system (user's home directories, shared folders, emails, etc). The *single backup* runs once a day and can be full or incremental on a weekly basis. This backup also contains the archive of the configuration backup. More backups can be configured to save different data at different intervals.
it: **Il backup dei dati** si abilita installando il modulo "Backup" e, per impostazione predefinita, contiene tutti i dati memorizzati nel sistema (home dell'utente, cartelle condivise, e-mail, ecc.). Il *backup singolo* viene eseguito una volta al giorno e può essere completo od incrementale su base settimanale. Questo backup contiene anche l'archivio del backup di configurazione. È possibile configurare più backup per salvare dati diversi a intervalli diversi.

source: Configuration backup
it: Backup configurazione

source: From page :guilabel:`Backup (configuration)` the system configuration can be saved, downloaded, uploaded and restored again.
it: Dalla pagina :guilabel:`Backup (configurazione)` è possibile salvare, scaricare, eseguire l'upload o ripristinare la configurazione del sistema

source: Furthermore, an automated task runs every night at 00.15 and creates a new archive, :file:`/var/lib/nethserver/backup/backup-config.tar.xz`, if the configuration has changed during the previous 24 hours. Under :guilabel:`Backup (configuration) > Configure` page, specify the number of :guilabel:`Automatic backups to keep`.
it: Inoltre, un'attività automatizzata viene eseguita ogni notte alle 00.15 e crea un nuovo archivio, :file:`/var/lib/nethserver/backup/backup-config.tar.xz`, se la configurazione è stata modificata nelle ultime 24 ore. E' possibile specificare il numero di :guilabel:`Backup automatici da mantenere` dal pannello :guilabel:`Backup (configurazione)> Configura`.

source: The list of installed modules is included in the backup archive. The restore procedure can download and install the listed modules automatically.
it: L'elenco dei moduli installati è incluso nell'archivio di backup. La procedura di ripristino consente di scaricare e installare automaticamente i moduli elencati.

source: Configuration backup customization
es: Personalización de la copia de seguridad de la configuración
it: Personalizzazione backup configurazione

source: In most cases it is not necessary to change the configuration backup. But it can be useful, for example, if you have a custom httpd configuration. In this case you can add the file that contains the customization to the list of files to backup.
es: En la mayoría de los casos no es necesario cambiar la copia de seguridad de la configuración. Pero puede ser útil, por ejemplo, si tiene una configuración personalizada de httpd. En este caso se puede añadir el archivo que contiene la personalización de la lista de archivos de copia de seguridad.
it: Nella maggior parte dei casi non è necessario modificare il backup della configurazione. Ma può essere utile, ad esempio, se si è aggiunta una configurazione custom per httpd. In questo caso è possibile aggiungere il percorso del file che contiene la personalizzazione al backup della configurazione.

source: **Inclusion**
it: **Inclusione**

source: If you wish to add a file or directory to configuration backup, add a line to the file :file:`/etc/backup-config.d/custom.include`.
es: Si desea agregar un archivo o directorio a la copia de seguridad de la configuración, agregue una línea al archivo :file:`/etc/backup-config.d/custom.include`.
it: Se si desidera includere una directory o un file nel backup della configurazione, aggiungere una linea al file :file:`/etc/backup-config.d/custom.include`.

source: For example, to backup :file:`/etc/httpd/conf.d/mycustom.conf` file, add this line: ::
it: Ad esempio, per eseguire il backup del file :file:`/etc/httpd/conf.d/mycustom.conf`, aggiungere la riga: ::

source: Do not add big directories or files to the configuration backup.
it: Non aggiungere mai directory e file voluminosi al backup della configurazione.

source: **Exclusion**
it: **Esclusione**

source: If you wish to exclude a file or directory from the configuration backup, add a line to the file :file:`/etc/backup-config.d/custom.exclude`.
it: Se si desidera escludere una directory o un file dal backup della configurazione, aggiungere una riga al file :file:`/etc/backup-config.d/custom.exclude`.

source: Make sure not to leave empty lines inside edited files. The syntax of the configuration backup supports only simple file and directory paths.
es: Asegúrese de no dejar líneas vacías dentro de los archivos editados. La sintaxis de la copia de seguridad de configuración sólo admite rutas de directorio y de archivos simples.
it: Assicurarsi di non lasciare linee vuote nei file modificati. La sintassi del backup della configurazione supporta solo percorsi file e directory semplici.

source: Data backup
it: Backup dati

source: |product| implements 2 types of data backup:
it: |product| implementa 2 tipi di backup dati:

source: Single backup (primary, default, backward compatible)
it: Backup singolo (primario, predefinito, compatibile con le versioni precedenti)

source: Multiple backups (multi-backup, multi-engine)
it: Backup multipli (multi-backup, multi-engine)

source: The data backup can be performed using different engines:
it: Il backup dei dati può essere eseguito utilizzando diversi engine:

source: When selecting an engine, the system administrator should carefully evaluate multiple aspects:
it: Quando si seleziona un engine, l'amministratore di sistema deve valutare attentamente molteplici aspetti:

source: Compression: data is compressed on the destination, disk usage can vary in function of compression efficiency which depends also on the data set
it: Compressione: i dati vengono compressi sulla destinazione, l'utilizzo del disco può variare in funzione dell'efficienza della compressione, che dipende anche dal set di dati

source: Deduplication: instead of compressing files, data is split into chunks and only a copy of each chunk is kept. Efficiency depends highly on the data set
it: Deduplicazione: invece di comprimere i file, i dati vengono suddivisi in blocchi e viene conservata solo una copia di ciascun blocco. L'efficienza dipende molto dal set di dati

source: Encryption: data saved inside the destination storage is encrypted. Usually data is encrypted before transfer
it: Crittografia: i dati salvati nella memoria di destinazione sono crittografati. Di solito i dati vengono crittografati prima del trasferimento

source: Size: space used on the destination for each backup, may be smaller or equal than the original data set. When using engines without encryption support, the destination should always be bigger than the source
it: Dimensione: lo spazio utilizzato nella destinazione per ciascun backup può essere inferiore o uguale al set di dati originale. Quando si utilizzano engine senza supporto per la crittografia, lo spazio sulla destinazione dovrebbe sempre essere più grande rispetto a quello occupato nella sorgente

source: Retention: the policy which sets the amount of time in which a given set of data will remain available for restore
it: Conservazione: la politica che fissa la quantità di tempo in cui un set di dati rimarrà disponibile per il ripristino

source: Integrity: it's the engine ability to check if the performed backup is valid in case of restore
it: Integrità: è la capacità dell'engine di verificare se il backup eseguito è valido in caso di ripristino

source: Type: a backup can be full, incremental or snapshot based (incremental-forever):
it: Tipo: un backup può essere completo, incrementale o basato su snapshot (sempre incrementale):

source: full: all files are copied to the destination each time
it: completo: tutti i file vengono copiati nella destinazione ogni volta

source: incremental: compare the data with last full backup and copy only changed or added items. The full backup and all the intermediate incrementals are needed for the restore process. A full backup is required on a regular basis.
it: incrementale: confronta i dati con l'ultimo backup completo e copia solo gli elementi modificati o aggiunti. Il backup completo e tutti gli incrementali intermedi sono necessari per il processo di ripristino. È richiesto che venga eseguito regolarmente un backup completo.

source: snapshot: create a full backup only the first time, then create differential backups. Snapshots can be deleted and consolidated and only one full backup is needed
it: snapshot: crea un backup completo solo la prima volta, successivamente crea solo backup differenziali. Le istantanee possono essere eliminate e consolidate ed è necessario un solo backup completo

source: Compression
it: Compressione

source: Deduplication
it: Deduplicazione

source: Encryption
it: Crittografia

source: Integrity
it: Integrità

source: Type
it: Tipo

source: Yes
it: Sì

source: full / incremental
it: completo / incrementale

source: Partial
it: Parziale

source: Engines
it: Engine

source: :index:`Duplicity` is the well-known default engine for |product|. It has a good compression algorithm which will reduce storage usage on the destination. Duplicity requires a full backup once a week, when the data set is very big the process may take more than 24 hours to complete. |product| doesn't implement backup encryption if the engine is Duplicity.
it: :index:`Duplicity` è l'engine di backup predefinito per |product|. Ha un buon algoritmo di compressione che riduce in modo apprezzabile l'utilizzo della spazio sulla destinazione. Duplicity richiede un backup completo una volta alla settimana, quando il set di dati è molto grande il processo potrebbe richiedere più di 24 ore per essere completato. |product| non implementa la crittografia per il backup se l'engine è Duplicity.

source: Supported storage backends:
it: Backend di archiviazione supportati:

source: WebDAV (only when used as single backup)
it: WebDAV (solo quando usato come *backup singolo*)

source: :index:`Restic` implements a snapshot-based and always-encrypted backup. It has support for deduplication and can perform backup on cloud services. Since Restic requires only one full backup, all runs after the first should be fast and could be scheduled multiple times a day.
it: :index:`Restic` implementa un backup basato su snapshot e sempre crittografato. Supporta la deduplicazione e può eseguire il backup sui servizi cloud. Poiché Restic richiede solo un backup completo, tutte le esecuzioni successive alla prima dovrebbero essere veloci e potrebbero essere programmate più volte al giorno.

source: WebDAV (only when used as *single backup*)
it: WebDAV (solo quando usato come *backup singolo*)

source: Amazon S3 (or any compatible server like `Minio <https://www.minio.io/>`_)
it: Amazon S3 (o altro server compatibile come `Minio <https://www.minio.io/>`_)

source: :index:`Time machine-style` backup engine using :index:`rsync`. After the first full backup, it copies only modified or new files using fast incremental file transfer. On the destination, partial deduplication is obtained using hard links. If the backup destination directory is full, the oldest backups are automatically deleted to free space.
it: L'engine di backup stile :index:`Time machine utilizza: index:` rsync`. Dopo il primo backup completo, copia solo i file modificati o nuovi utilizzando un effiecente sistema di trasferimento incrementale. Sulla destinazione, la deduplicazione parziale viene ottenuta attraverso l'uso di link fisici. Se la directory di destinazione del backup è piena, i backup più vecchi vengono automaticamente eliminati per liberare spazio.

source: Rsync doesn't support encryption nor compression on the destination. During data transfer, SFTP assures encryption and data is compressed to minimize bandwidth usage.
it: Rsync non supporta la crittografia né la compressione sulla destinazione. Durante il trasferimento dei dati, SFTP assicura la crittografia e i dati vengono compressi per ridurre al minimo l'utilizzo della banda utilizzata.

source: When using rsync engine, make sure the storage backend supports symbolic and hard links. Please note that |product| doesn't support links on Samba shares due to security implications. Also symlinks are not supported on WebDAV.
it: Quando si utilizza l'engine rsync, assicurarsi che il backend di destinazione supporti link simbolici e fisici. Si rammenta che |product| non supporta collegamenti su condivisioni Samba per implicazioni di sicurezza. Inoltre i link simbolici non sono supportati su WebDAV.

source: Single backup
it: Backup singolo

source: This is the default system backup which can be configured and restored using the web interface. It can be scheduled once a day, can include system logs and implements notifications to the system administrator or to an external mail address.
it: Questo è il backup di sistema predefinito che può essere configurato e ripristinato utilizzando l'interfaccia web. Può essere pianificato una volta al giorno, può includere i log di sistema ed implementa le notifiche mail all'amministratore di sistema o a un indirizzo di posta esterno.

source: Storage backends
it: Backend di archiviazione

source: Single backup can be saved on a destination chosen between:
it: Il backup singolo può essere salvato su una destinazione scelta tra:

source: USB: disk connected to a local USB port (See: :ref:`backup_usb_disk-section`)
es: USB: disco conectado a un puerto USB local (Ver: :ref:`backup_usb_disk-section`)
it: USB: disco collegato via USB, utile in caso di molti dati, ma limitato dalla velocità dell’USB (Vedi: :ref:`backup_usb_disk-section`)

source: CIFS: Windows shared folder, it's available on all NAS (Network Attached Storage). Use access credentials like: MyBindUser,domain=mydomain.com
it: CIFS: cartella condivisa Windows, disponibile su tutti i NAS (Network Attached Storage). Utilizza credenziali di accesso come: MioUtente,domain=miodominio.com

source: NFS: Linux shared folder, it's available on all NAS, usually faster than CIFS
es: NFS: Carpeta compartida de Linux, está disponible en todas las NAS, generalmente más rápido que CIFS
it: NFS: cartella condivisa Linux, disponibile su tutti i NAS, solitamente più veloce di CIFS

source: WebDAV: available on many NAS and remote servers (use a server with a valid SSL certificate as WebDAV target, otherwise the system will fail mounting the filesystem)
it: WebDAV: disponibile su molti server NAS e remoti (utilizzare come destinazione WebDAV un server con un certificato SSL valido, altrimenti il sistema non riuscirà a montare il filesystem)

source: The destination directory is based on the server host name: in case of FQDN change, the administrator should take care to copy/move the backup data from the old directory to the new one.
it: La directory di destinazione è basata sul nome host del server: in caso di modifica dell'FQDN, l'amministratore dovrà occuparsi di copiare/spostare i dati di backup dalla vecchia directory a quella nuova.

source: Change backup engine
it: Modifica dell'engine di backup

source: Duplicity is the default engine for the *single backup*. You can change it executing one of the commands below.
it: Duplicity è l'engine predefinito per il *backup singolo*. E' possibile cambiarlo eseguendo uno dei comandi seguenti.

source: To use restic: ::
it: Per utilizzare restic: ::

source: To use rsync: ::
it: Per utilizzare rsync: ::

source: To use duplicity: ::
it: Per utilizzare duplicity: ::

source: The backup will use the selected engine on next run. When the new engine has completed at least one backup, remember to cleanup the destination by removing data from the old engine.
it: Il backup utilizzerà il motore selezionato dalla successiva esecuzione. Quando il nuovo motore avrà completato almeno un backup, ricordarsi di liberare spazio nella destinazione rimuovendo i dati generati dal vecchio engine.

source: Multiple backups
it: Backup multipli

source: The administrator can schedule multiple backups using different engines and destinations. A valid policy could be creating a weekly backup to a local destination using duplicity, while scheduling a daily backup to a cloud storage using restic.
it: L'amministratore può pianificare più backup utilizzando diversi engine e destinazioni. Una buona politica potrebbe essere quella di creare un backup settimanale su una destinazione locale utilizzando Duplicity e pianificare un ulteriore backup giornaliero su uno storage cloud usando Restic.

source: Multiple backups can't be configured using the server-manager web user interface. All operations should be performed from command line.
it: Non è possibile configurare backup multipli utilizzando l'interfaccia utente server-manager. Tutte le operazioni devono essere eseguite dalla riga di comando.

source: When configuring multiple backups, please bear in mind two golden rules:
it: Quando si configurano più backup, tenere presente due regole d'oro:

source: always use different destinations for each engine
it: utilizzare sempre destinazioni diverse per ciascun engine

source: avoid scheduling concurrent backups, each backup should run when the previous one has been completed
it: evitare la pianificazione di backup simultanei, ogni backup deve essere eseguito quando il precedente è stato completato

source: Limitation of multiple backups:
it: Limitazioni dei backup multipli:

source: disk usage report is not implemented
it: il report sull'utilizzo del disco non è implementato

source: WebDAV can't be used as storage backend
it: WebDAV non può essere utilizzato come backend di archiviazione

source: Every backup record is saved inside the ``backups`` database. Each record can have 3 different types:
it: Ogni record di backup viene salvato all'interno del database ``backups``. Ogni record può essere di 3 diversi tipi:

source: Common properties:
it: Proprietà comuni:

source: ``status`` : enable or disable the backup, can be ``enabled`` or ``disabled``
it: ``status``: abilita o disabilita il backup, può essere ``enabled`` o `` disabled``

source: ``Notify``: if set to ``always``, always send a notification with backup status; if set to ``error``, send a notification only on error; if set to ``never``, never send a notification
it: ``Notify``: se impostato su ``sempre``, invia sempre una notifica con lo stato del backup; se impostato su ``error``, invia una notifica solo in caso di errore; se impostato su ``never``, la notifica non viene mai inviata

source: ``NotifyFrom``: set a different sender than ``root@localhost``
it: ``NotifyFrom``: configura un mittente differente da ``root@localhost`` per le notifiche

source: ``NotifyTo``: send the notification to given mail address, default is ``root@localhost``
it: ``NotifyTo``: invia la notifica all'indirizzo mail impostato, l'indirizzo di default è ``root@localhost``

source: ``VFSType`` : set the storage backend
it: ``VFSType``: imposta il backend di archiviazione

source: To list all configured backups: ::
it: Per ottenere un elenco di tutti i backup configurati: ::

source: Output example: ::
it: Output di esempio: ::

source: Schedule
it: Pianificazione

source: The backup schedule uses the cron syntax saved inside the ``BackupTime`` property. Below, some examples.
it: La pianificazione del backup utilizza la sintassi cron, salvata nella proprietà ``BackupTime``. Sotto, alcuni esempi.

source: Every night at 3: ::
it: Ogni notte alle 3: ::

source: Every hour, at minute 15: ::
it: Ogni ora, al minuto 15: ::

source: At 04:05 on every Sunday: ::
it: Alle 4:05 ogni domenica: ::

source: For more examples, see:
it: Per ulteriori esempi fare riferimento a:

source: Retention policy
it: Politica di conservazione

source: Each engine can implement its own retention policy. The policy can be set using the ``CleanupOlderThan`` property.
it: Ogni engine può implementare la propria politica di conservazione. La politica può essere impostata usando la proprietà ``CleanupOlderThan``.

source: The property takes a number followed by D, M or Y (Days, Months, or Years respectively).
it: La proprietà può assumere un valore numerico seguito da D, M o Y (giorni, mesi o anni rispettivamente).

source: Example: cleanup after 30 days: ::
it: Esempio: elimina dopo 30 giorni: ::

source: The retention policy is not supported by the rsync backend.
it: Rsync non supporta la politica di conservazione.

source: Multiple backups support different storage backends. Some backends are engine-specific.
it: I backup multipli supportano diversi backend di archiviazione. Alcuni backend sono specifici dell'engine usato.

source: Samba or Windows share, ``VFSType`` is ``cifs``. Supported by all backends.
it: Samba o Condivisione Windows, ``VFSType`` è ``cifs``. Supportato da tutti i backend

source: Properties:
it: Proprietà:

source: ``SMBShare``: Samba share name
it: ``SMBShare``: Nome della condivisione Samba

source: ``SMBHost``: Samba server host name or IP address
it: ``SMBHost``: Nome host o indirizzo IP del server Samba

source: ``SMBLogin``: Samba login user
it: ``SMBLogin``: Nome utente per l'accesso a Samba

source: ``SMBPassword``: Samba password for the given user
it: ``SMBPassword``: password per l'utente fornito

source: USB-attached disk, ``VFSType`` is ``usb``. Supported by all backends.
it: Disco USB, ``VFSType`` è ``usb``. Supportato da tutti i backend.

source: Network File System, ``VFSType`` is ``nfs``. Supported by all backends.
it: Network File System, ``VFSType`` è ``nfs``. Supportato da tutti i backend.

source: ``NFSHost``: NFS server host name or IP address
it: ``NFSHost``: Nome host o indirizzo IP del server NFS

source: ``NFSShare``: NFS share name
it: ``NFShare``: Nome della condivisione NFS

source: SSH File Transfer Protocol, ``VFSType`` is ``sftp``. Supported only by restic and rsync.
it: SSH File Transfer Protocol, ``VFSType`` è ``sftp``. Supportato solo da restic e rsync.

source: ``SftpHost``: SSH host name or IP address
it: ``SftpHost``: Nome host o indirizzo IP server SSH

source: ``SftpUser``: SSH user
it: ``SftpUser``: Utente SSH

source: ``SftpPort``: SSH port
it: ``SftpPort``: Porta SSH

source: ``SftpDirectory``: destination directory, must be writable by the SSH user
it: ``SftpDirectory``: directory di detinazione, deve essere scrivibile dall'utente SSH utilizzato

source: Amazon S3 (or compatible), ``VFSType`` is ``s3``. Supported only by restic.
it: Amazon S3 (o compatibile), ``VFSType`` è ``s3``. Supportato solo da restic.
