Repository: NethServer/docs
Catalog: administrator-manual/*/locale/*/LC_MESSAGES/blacklist.po
Languages: it

source: The configuration page of this module is available only in the new Server Manager.
it: La pagina di configurazione di questo modulo è disponibile sono nel nuovo Server Manager.

source: The Threat shield blocks connections to and from malicious hosts, preventing attacks, service abuse, malware, and other cybercrime activities using IP blacklists. It also blocks DNS requests for malicious domains using DNS blacklists. The package can be installed both on firewalls and on machines without a red interface, like mail servers or PBXs.
it: La Threat Shield blocca le connessioni da e verso host dannosi, prevenendo attacchi, abusi del servizio, malware e altre attività di criminalità informatica mediante blacklist di IP. Inoltre, blocca le richieste DNS per domini dannosi mediante blacklist DNS. Il pacchetto può essere installato sia su firewall che su macchine senza interfaccia red, come server di posta o PBX.

source: Configuration
it: Configurazione

source: :guilabel:`IP blacklist` and :guilabel:`DNS blacklist` can be enabled and configured on the corresponding pages in the menu. Their configuration is almost identical.
it: :guilabel:`IP blacklist` e :guilabel:`DNS blacklist` possono essere abilitati e configurati nelle corrispondenti pagine del menu dedicato. La loro configurazione è pressoché identica.

source: First, set the :guilabel:`Download URL` for the blacklists. After setting the URL, the administrator can choose which :index:`blacklist` categories should be enabled. Each category can have a :guilabel:`Confidence` score between 0 and 10. Categories with a higher confidence are less prone to false positives.
it: Innanzitutto, è necessario impostare il :guilabel:`Download URL` per le blacklist. Dopo aver impostato l'URL, l'amministratore può scegliere quali categorie di :index:`blacklist` abilitare. Ogni categoria può avere un punteggio :guilabel:`Fiducia` tra 0 e 10. Le categorie con una maggiore fiducia sono meno soggette a falsi positivi.

source: Enabled categories will be automatically updated at regular intervals.
it: Le categorie abilitate verranno aggiornate automaticamente a intervalli regolari.

source: The download URL must contain a valid GIT repository. Administrators can choose a public repository or subscribe to a commercial service. If the machine has a Community or an Enterprise subscription, the access to the URL will be authenticated using system id and secret.
it: Il Download URL deve contenere un repository GIT valido. Gli amministratori possono scegliere un repository pubblico o abbonarsi a un servizio commerciale. Se la macchina dispone di una subscription Community o Enterprise, l'accesso all'URL verrà autenticato utilizzando l'LK di sistema e il token.

source: A popular free IP blacklist is `Firehol <https://github.com/firehol/blocklist-ipsets>`_. Experienced administrators can also `setup their own IP blacklist server <https://docs.nethserver.org/projects/nethserver-devel/en/latest/nethserver-blacklist.html#setup-a-blacklist-server>`_.
it: Una nota blacklist di IP gratuita è `Firehol <https://github.com/firehol/blocklist-ipsets>`_.Gli amministratori esperti possono anche `configurare il proprio server di blacklist <https://docs.nethserver.org/projects/nethserver-devel/en/latest/nethserver-blacklist.html#setup-a-blacklist-server>`_.

source: An example of DNS blacklist is available at `dns-community-blacklist <https://github.com/NethServer/dns-community-blacklist>`_.
it: Un esempio di blacklist DNS è disponibile `qui <https://github.com/NethServer/dns-community-blacklist>`_.

source: If :ref:`proxy-section` is enabled, in any mode, :guilabel:`DNS blacklist` will not work for proxied hosts.
it: Se il :ref:`proxy-section` è abilitato, in qualsiasi modalità, la :guilabel:`blacklist DNS` non funzionerà per gli host proxati.

source: In case of a false positive, an IP address or a CIDR subnet can be added to the local :guilabel:`Whitelist`. If the firewall module is installed, the whitelist will also accept host and CIDR firewall objects.
it: In caso di falso positivo, è possibile aggiungere un indirizzo IP o una rete CIDR alla :guilabel:`Whitelist` locale. Se è installato il modulo firewall, la Whitelist accetterà anche oggetti firewall di tipo host e CIDR.

source: Hosts should be added to the whitelist only for a limited period of time. As a best practice, when a false positive is found, please report it to the blacklist maintainer.
it: Gli host dovrebbero essere aggiunti alla whitelist solo per un periodo di tempo limitato. Come best practice, quando viene trovato un falso positivo, si invita a segnalarlo al manutentore della blacklist.

source: The :guilabel:`Analysis` page displays most recent attacks and DNS requests which can be easily filtered by source, destination and other attributes. Using the :guilabel:`Check IP address or domain` section, administrators can also check if a given IP or domain has been blacklisted by enabled categories.
it: La pagina :guilabel:`Analisi` mostra gli attacchi e le richieste DNS più recenti, che possono essere filtrati per sorgente, destinazione e altri attributi. Usando la sezione :guilabel:`Controlla indirizzo IP o dominio`, gli amministratori possono anche verificare se un determinato IP o dominio sia stato inserito nella blacklist da una delle categorie abilitate.

source: For advanced log analysis with regular expressions support, use the :guilabel:`Logs` page.
it: Per un'analisi avanzata dei log con supporto delle espressioni regolari, usare la pagina :guilabel:`Log`.

source: Statistics
it: Statistiche

source: The :guilabel:`Dashboard` page provides an overview on current status of IP and DNS blacklists and displays graphical information about blocked attacks.
it: La pagina :guilabel:`Dashboard` offre una panoramica dello stato corrente delle blacklist IP e DNS e visualizza informazioni grafiche sugli attacchi bloccati.

source: IP blacklist dashboard provides:
it: La dashboard della blacklist IP fornisce:

source: Today's total number of threats blocked
it: Numero totale di minacce bloccate nella giornata

source: Today's most blocked source hosts
it: Gli host di origine maggiormente bloccati nella giornata

source: Today's most blocked destination hosts
it: Gli host di destinazione maggiormente bloccati nella giornata

source: DNS blacklist dashboard provides:
it: La dashboard della blacklist DNS fornisce:

source: Today's total number of DNS requests
it: Numero totale di richieste DNS della giornata

source: Today's threats percentage
it: Percentuale delle minacce della giornata

source: Top clients performing most DNS requests
it: Lista dei client che eseguono il maggior numero di richieste DNS

source: Top blocked domains
it: Principali domini bloccati

source: Top requested domains
it: Domini più richiesti

source: Threat shield integrates limited support for geo-blocking. This feature is configurable only from the command line. Geo-blocking is disabled by default.
it: Threat shield integra un supporto limitato per il blocco geografico. Questa funzione è configurabile solo dalla riga di comando. Il blocco geografico è disabilitato per impostazione predefinita.

source: To enable geo-blocking execute: ::
it: Per abilitare il blocco geografico impartire i seguenti comandi: ::

source: The event will download network addresses for all countries. Each country is identified by its own `ISO code <https://en.wikipedia.org/wiki/List_of_ISO_3166_country_codes>`_ composed by 2 letters. To list available countries, use: ::
it: L'evento scaricherà gli indirizzi di rete per tutti i paesi. Ogni paese è identificato dal proprio `codice ISO <https://en.wikipedia.org/wiki/List_of_ISO_3166_country_codes>`_ composto da 2 lettere. Per l'elenco dei paesi disponibili, utilizzare: ::

source: Choose which countries should be blocked and set the ``Categories`` accordingly. Example to block China and Russia: ::
it: Scegliere quali paesi devono essere bloccati e impostare le ``Categorie`` di conseguenza. Ad esempio per bloccare Cina e Russia: ::

source: If an IP address has been classified inside the wrong country, it's possible to allow the traffic from/to the host by adding the IP address to the whitelist. Example: ::
it: Se un indirizzo IP è stato classificato all'interno del paese sbagliato, è possibile consentire il traffico da/verso l'host aggiungendo l'indirizzo IP alla whitelist. Esempio: ::

source: All blocked IPs will be logged inside :file:`/var/log/firewall.log`. Example: ::
it: Tutti gli IP bloccati verranno registrati all'interno di :file:`/var/log/firewall.log`. Esempio: ::

source: Finally, to completely disable the GeoIP use: ::
it: Infine, per disabilitare completamente GeoIP eseguire i seguenti comandi: ::
