Repository: NethServer/docs
Catalog: administrator-manual/*/locale/*/LC_MESSAGES/chat.po
Languages: es, it

source: The :index:`chat` service uses the standard protocol :index:`Jabber`/:index:`XMPP` and support TLS on standard ports (5222 or 5223).
es: El servicio: index:`chat` utiliza el protocolo estándar: index:`Jabber`/:index:`XMPP` y soporta TLS en puertos estándar (5222 o 5223).
it: Il servizio di :index:`chat` utilizza il protocollo standard :index:`Jabber`/:index:`XMPP`, supporta TLS sulla porte :index:`XMPP` standard (5222 o 5223).

source: The main features are:
es: Las características principales son:
it: La principali funzionalità sono:

source: Messaging between users of the system
it: messaggi fra gli utenti del sistema

source: Chat server administration
es: Administración del servidor de Chat
it: amministratori chat

source: Broadcast messages
es: Mensajes de difusión
it: messaggi broadcast

source: Group chat
es: Grupo de chat
it: chat di gruppo

source: Offline messages
es: Mensajes sin conexión
it: messaggi offline

source: Transfer files over LAN
es: Transferencia de archivos a través de LAN
it: trasferimenti file in LAN

source: Message archiving
it: Archiviazione dei messaggi

source: All system users can access the chat using their own credentials.
es: Todos los usuarios del sistema pueden acceder al chat usando sus propias credenciales.
it: Tutti gli utenti di sistema possono accedere alla chat usando le proprie credenziali.

source: If |product| is bound to a remote Active Directory account provider a dedicated user account in AD is required by the module to be fully operational! See :ref:`join-existing-ad-section`.
es: Si |product| es unido a un proveedor de cuentas Active Directory remoto, se necesita una cuenta AD dedicada para que el módulo esté completamente operativo. Ver :ref:`join-existing-ad-section`.
it: Se |product| è attestato ad un account provider remoto Active Directory, un account utente AD aggiuntivo e dedicato è necessario al modulo per essere pienamente operativo! Fare riferimento alla sezione :ref:`join-existing-ad-section`.

source: Configuration
it: Configurazione

source: All configuration options are available from *Configuration* page inside the **ejabberd** application. Main options are:
it: Tutte le opzioni di configurazione sono disponibile nella pagina *Configurazione* all'interno dell'applicazione **ejabberd**. Le opzioni principali sono:

source: enable and disable ejabberd daemon
it: abilita e disabilita il demone ejabberd

source: enable built-in web administration interface
it: abilita l'interfaccia web di amministrazione

source: Under the *Advanced options* section, the administrator can also configure:
it: Nella sezione *Opzioni avanzate*, l'amministratore può configurare anche:

source: S2S federation
it: federazione S2S

source: message archive
it: archivio messaggi

source: file upload to exchange data among clients using URL
it: upload di file per scambiare dati fra i client usando un URL

source: file transfer speed
it: velocità di trasferimento file

source: The XMPP system is federated by nature. If :index:`S2S` is enabled, users with accounts on one server can communicate with users on remote servers. S2S allows for servers communicating seamlessly with each other, forming a global 'federated' IM network.
it: Il sistema XMPP è federato nativamente. Se :index:`S2S` è abilitato, gli utenti con account su un server possono comunicare con gli utenti su server remoti. S2S consente ai server di comunicare tra loro, formando una rete IM globale "federata".

source: For this purpose, the SRV DNS record must be configured for your domain (https://wiki.xmpp.org/web/SRV_Records#XMPP_SRV_records) and the server must have a valid SSL/TLS certificate.
it: A tale scopo, il record DNS SRV deve essere configurato per il proprio dominio (https://wiki.xmpp.org/web/SRV_Records#XMPP_SRV_records) e il server deve disporre di un certificato SSL/TLS valido.

source: Message Archive Management
it: Gestione archivio messaggi

source: Message Archive Management (mod_mam) implements Message Archive Management as described in `XEP-0313 <http://xmpp.org/extensions/xep-0313.html>`_. When enabled, all messages will be stored inside the server and compatible XMPP clients can use it to store their chat history on the server.
it: Message Archive Management (mod_mam) implementa la gestione dell'archivio messaggi come descritto in `XEP-0313 <http://xmpp.org/extensions/xep-0313.html>` _. Se abilitato, tutti i messaggi verranno archiviati all'interno del server e i client XMPP compatibili potranno utilizzarlo per archiviare la propria cronologia chat sul server.

source: The database can store a maximum of 2GB of messages, archived messages can be purged automatically. To configure message retention policy, set :guilabel:`Clean messages older than X days` option.
it: Il database può memorizzare fino a 2 GB di messaggi, i messaggi archiviati possono essere eliminati automaticamente. Per configurare i criteri di conservazione dei messaggi, impostare l'opzione :guilabel:`Elimina messaggi più vecchi di X giorni`.

source: If enabled, this module will store every message sent between users. This behavior will affect the privacy of your users.
it: Se abilitato, questo modulo memorizzerà ogni messaggio inviato tra gli utenti. Questa funzionalità impatterà sulla privacy degli utenti.

source: Administrators
es: Administradores
it: Amministratori

source: All users within the group ``jabberadmins`` are considered administrators of the chat server.
es: Todos los usuarios dentro del grupo ``jabberadmins`` son considerados administradores del servidor de chat.
it: Tutti gli utenti all'interno del gruppo ``jabberadmins`` sono considerati amministratori del server di chat.

source: The group ``jabberadmins`` must be created and configured from the :ref:`groups-section` page.
it: Il gruppo ``jabberadmins`` deve essere creato e configurato dalla pagina :ref:`groups-section`.

source: Administrators can:
es: Los administradores pueden:
it: Gli amministratori possono:

source: Send broadcast messages
es: Enviar mensajes de difusión
it: inviare messaggi broadcast

source: Check the status of connected users
es: Compruebe el estatus de los usuarios conectados
it: controllare lo stato degli utenti collegati

source: Clients
it: Client

source: Jabber clients are available for all desktop and mobile platforms.
es: Los clientes Jabber están disponibles para todas las plataformas de escritorio y móviles.
it: I client Jabber sono disponibili per tutte le piattaforme desktop e mobile.

source: Some widespread clients:
es: Algunos clientes comunes:
it: Fra i client più diffusi:

source: Pidgin is available for Windows and Linux
es: Pidgin está disponible para Windows y Linux
it: Pidgin disponibile per Windows e Linux

source: Adium for Mac OS X
es: Adium para Mac OS X
it: Adium per Mac OS X

source: BeejibelIM for Android and iOS, Xabber only for Android
es: BeejibelIM para Android e iOS, Xabber sólo para Android
it: BeejibelIM per Android e iOS, o Xabber solo Android

source: When you configure the client, make sure TLS (or SSL) is enabled. Enter the user name and the domain of the machine.
es: Cuando configure el cliente, asegúrese de que TLS (o SSL) esté habilitado. Introduzca el nombre de usuario y el dominio de la máquina.
it: Quando si configura il client, assicurarsi che sia abilitato TLS (o SSL). Inserire il nome utente e il dominio della macchina.

source: If |product| is also the DNS server of the network, the client should automatically find the server's address through special pre-configured DNS records. Otherwise, specify the server address in the advanced options.
es: Si |product| Es también el servidor DNS de la red, el cliente debe buscar automáticamente la dirección del servidor a través de los registros DNS especiales preconfigurados. De lo contrario, especifique la dirección del servidor en las opciones avanzadas.
it: Se |product| è anche il server DNS della rete, i client dovrebbero trovare automaticamente l'indirizzo del server attraverso speciali record DNS preconfigurati. In caso contrario, specificare l'indirizzo del server nelle opzioni avanzate.

source: With TLS capabilities, strictly configured servers or clients could reject connections with your Ejabberd server if the SSL/TLS certificate doesn't match the domain name. Also, the certificate should contain two sub-domains ``pubsub.*`` and ``conference.*``. This certificate can be obtained for free with Let's Encrypt (see :ref:`server_certificate-section`).
it: Con le funzionalità TLS, server o client rigorosamente configurati potrebbero rifiutare la connessione con il server Ejabberd se nel certificato SSL/TLS non corrispondesse il nome di dominio. Inoltre, il certificato dovrebbe contenere due sottodomini ``pubub.*`` e ``conference.*``. Un certificato con tali caratteristiche può essere generato gratuitamente con Let's Encrypt (vedi :ref:`server_certificate-section`).

source: Client
es: Cliente

source: The group ``jabberadmins`` is configurable from :ref:`groups-section` page.
es: El grupo ``jabberadmins`` es configurable desde la página :ref:`groups-section`.
