Repository: NethServer/docs
Catalog: administrator-manual/*/locale/*/LC_MESSAGES/dhcp.po
Languages: es, it

source: DHCP and PXE server
es: Servidor DHCP y PXE
it: Server DHCP e PXE

source: The :dfn:`Dynamic Host Configuration Protocol` (DHCP) [#DHCP]_ server centralizes the management of the local network configuration for any device connected to it. When a computer (or a device such as a printer, smartphone, etc.) connects to the local network, it can ask the network configuration parameters by means of the DHCP protocol. The DHCP server replies, providing the IP, DNS, and other relevant network parameters.
es: El servidor :dfn:`Dynamic Host Configuration Protocol` (DHCP) [#DHCP]_ centraliza la gestión de la configuración de red local para cualquier dispositivo conectado a ella. Cuando un ordenador (o un dispositivo como una impresora, un teléfono inteligente, etc.) se conecta a la red local, puede solicitar los parámetros de configuración de red mediante el protocolo DHCP. El servidor DHCP responde, proporcionando el IP, DNS y otros parámetros de red relevantes.
it: Il server DHCP (:dfn:`Dynamic Host Configuration Protocol` [#DHCP]_ ) permette di controllare la configurazione di rete di tutti i computer o dispositivi collegati alla LAN. Quando un computer (o un dispositivo come una stampante, smartphone, etc.) si connette alla rete il :index:`DHCP` gli assegna automaticamente un indirizzo IP valido e effettua la configurazione di DNS e gateway.

source: In most cases, the devices are already configured to use DHCP protocol on start up.
es: En la mayoría de los casos, los dispositivos ya están configurados para utilizar el protocolo DHCP al iniciar.
it: Nella maggior parte dei casi i dispositivi sono già configurati per utilizzare il protocollo DHCP.

source: The :dfn:`Preboot eXecution Environment` (PXE) [#PXE]_ specification allows a network device to retrieve the operating system from a centralized network location while starting up, through the DHCP and TFTP protocols. See :ref:`dhcp_pxe` for an example about configuring a such case.
es: La especificación de `Preboot eXecution Environment` (PXE) [#PXE] _ permite a un dispositivo de red recuperar el sistema operativo desde una ubicación de red centralizada mientras se inicia, a través de los protocolos DHCP y TFTP. Véase :ref:`dhcp_pxe` para un ejemplo sobre cómo configurar un caso similar.
it: La specifica PXE (:dfn:`Preboot eXecution Environment` [#PXE]_) consente ad un dispositivo di scaricare da rete il sistema operativo all'avvio da una postazione di rete centralizzata, mediante i protocolli DHCP e TFTP. Vedere :ref:`dhcp_pxe` per un esempio su come configurare un caso simile.

source: DHCP configuration
es: Configuración DHCP
it: Configurazione DHCP

source: The DHCP server can be enabled on all *green* and *blue* interfaces (see :ref:`network-section`). |product| will assign a free IP address within the configured :dfn:`DHCP range` in :guilabel:`DHCP > DHCP server` page.
es: El servidor DHCP se puede habilitar en todas las interfaces *verde * y *azul * (ver :ref:`network-section`). |product| asignará una dirección IP libre dentro de la configuración :dfn:`rango DHCP` en la página :guilabel:`DHCP > Servidor DHCP`.
it: Il server DHCP può essere abilitato su tutte le interfacce *green* e *blue* (vedi :ref:`network-section`). |product| sceglierà un indirizzo IP libero all'interno dell':dfn:`intervallo DHCP` configurato nella pagina :guilabel:`DHCP > Server DHCP`.

source: The DHCP range must be defined within the network of the associated interface. For instance, if the green interface has IP/netmask ``192.168.1.1/255.255.255.0`` the range must be ``192.168.1.2 - 192.168.1.254``.
es: El rango DHCP debe definirse dentro de la red de la interfaz asociada. Por ejemplo, si la interfaz verde tiene IP/netmask ``192.168.1.1/255.255.255.0`` el rango debe ser ``192.168.1.2 - 192.168.1.254``.
it: L'intervallo DHCP deve appartenere alla rete dell'interfaccia associata. Per esempio, se l'interfaccia green ha IP 192.168.1.1 e maschera di rete 255.255.255.0, allora l'intervallo DHCP può andare da 192.168.1.2 a 192.168.1.254.

source: Advanced options
es: Opciones avanzadas
it: Opzioni avanzate

source: There are seven advanced options for DHCP. You can assign zero options, one option or all seven options.
es: Hay siete opciones avanzadas para DHCP. Puede asignar cero opciones, una opción o las siete opciones.
it: Il DHCP ha sette opzioni avanzate. Possono essere utilizzate indistintamente, da 0 a tutte 7.

source: For the servers – DNS, NTP, WINS and TFTP – you can assign zero, one or more for each server; if you place more than one, use a comma between each server with no space.
es: Para los servidores - DNS, NTP, WINS y TFTP - puede asignar cero, uno o más para cada servidor; si coloca más de uno, utilice una coma entre cada servidor sin espacio.
it: Per i campi server – DNS, NTP, WINS and TFTP – è possible assegnare zero, uno o più server; in caso di più di uno, separare i valori con una virgola, senza lasciare spazi.

source: Host IP reservation
es: Reserva IP del host
it: IP riservato a un host

source: The DHCP server leases an IP address to a device for a limited period of time. If a device requires to always have the same IP address, it can be granted an *IP reservation* associated to its MAC address.
es: El servidor DHCP concede una dirección IP a un dispositivo durante un período de tiempo limitado. Si un dispositivo requiere tener siempre la misma dirección IP, se le puede otorgar una *reserva IP* asociada a su dirección MAC.
it: Il server DHCP rilascia un indirizzo IP per un periodo di tempo limitato. Se un dispositivo necessita di avere sempre lo stesso IP, è possibile assegnarli un *IP Riservato* associato all'indirizzo MAC.

source: The page :guilabel:`DHCP > IP reservation` lists the currently assigned IP addresses:
es: La página :guilabel:`DHCP> IP reservation` lista las direcciones IP actualmente asignadas:
it: Nella pagina :guilabel:`Riserva IP` sono elencati tutti gli indirizzi IP correntemente assegnati:

source: a line with :guilabel:`IP reservation` button identifies an host with a temporary lease (gray color);
es: Una línea con botón :guilabel:`IP reservation` identifica un host con un arriendo temporal (color gris);
it: una riga con il pulsante :guilabel:`Riserva IP` identifica un host con un lease temporaneo (colore grigio);

source: a line with :guilabel:`Edit` button identifies an host with a reserved IP (black color). A small two arrows icon near the host name says the DHCP lease is expired: this is a normal condition for hosts with static IP configuration, as they never contact the DHCP server.
es: Una línea con el botón :guilabel:`Edit` identifica un host con una IP reservada (color negro). Un pequeño icono de dos flechas junto al nombre del host indica que la concesión DHCP ha caducado: es una condición normal para los hosts con configuración IP estática, ya que nunca se ponen en contacto con el servidor DHCP.
it: una riga con il pulsante :guilabel:`Modifica` identifica un host con un IP riservato (colore nero). Una piccola icona con due frecce indica che il lease DHCP è scaduto: questa è una condizione normale per gli host con configurazione IP statica, poiché non comunicano mai col server DHCP.

source: Boot from network configuration
es: Arranque desde la configuración de red
it: Configurazione per l'avvio da rete

source: To allow clients to boot from network, the following components are required:
es: Para permitir a los clientes arrancar desde la red, se requieren los siguientes componentes:
it: Per consentire ai client di avviarsi dalla rete, sono richiesti i seguenti componenti:

source: the :ref:`DHCP <dhcp_configuration>` server, as we have seen in the previous sections
es: El servidor :ref:`DHCP<dhcp_configuration>`, como hemos visto en las secciones anteriores
it: il server :ref:`DHCP <dhcp_configuration>`, come visto nelle sezioni precedenti

source: the :dfn:`TFTP` server [#TFTP]_
es: el servidor :dfn:`TFTP` [#TFTP]_
it: il server :dfn:`TFTP` [#TFTP]_

source: the software for the client, served through TFTP
es: El software para el cliente, servido a través de TFTP
it: il software per il client, servito mediante TFTP

source: TFTP is a very simple file transfer protocol and usually it is used for automated transfer of configuration and boot files.
es: TFTP es un protocolo de transferencia de archivos muy simple y por lo general se utiliza para la transferencia automatizada de archivos de configuración y arranque.
it: TFTP è un protocollo di trasferimento file molto semplice e generalmente utilizzato per il trasferimento automatico di file di configurazione o di boot.

source: In |product| the TFTP implementation comes with the DHCP module and is enabled by default. To allow accessing a file through TFTP, simply put it in :file:`/var/lib/tftpboot` directory.
es: En |product| la implementación TFTP viene con el módulo DHCP y está habilitada de forma predeterminada. Para permitir el acceso a un archivo a través de TFTP, basta con ponerlo en :file:`/var/lib/tftpboot`.
it: In |product| l'implementazione di TFTP è contenuta nel modulo DHCP ed è abilitata per default. Per consentire l'accesso a un file mediante TFTP è sufficiente mettere il file nella directory :file:`/var/lib/tftproot`.

source: To disable TFTP type the following commands in a root's console: ::
es: Para deshabilitar TFTP, escriba los siguientes comandos en una consola como root: ::
it: Per disabilitare TFTP digitare i seguenti comandi in una console di root: ::

source: For instance, we now configure a client to boot CentOS from the network. In |product|, type at root's console: ::
es: Por ejemplo, ahora configuramos un cliente para iniciar CentOS desde la red. En |product|, escriba desde la consola de root: ::
it: Per esempio, ora configuriamo un client per avviarsi da rete con CentOS. In |product|, digitare in una console di root: ::

source: Then create the file :file:`/var/lib/tftpboot/pxelinux.cfg/default` with the following content: ::
es: A continuación, cree el archivo :file:`/var/lib/tftpboot/pxelinux.cfg/default` con el siguiente contenido: ::
it: Quindi, creare il file :file:`/var/lib/tftpboot/pxelinux.cfg/default` con il seguente contenuto: ::

source: Create a CentOS directory: ::
es: Crear un directorio CentOS: ::
it: Creare una directory CentOS: ::

source: Copy inside the directory :file:`vmlinuz` and :file:`initrd.img` files. These files are public, and can be found in the ISO image, in :file:`/images/pxeboot` directory or downloaded from a CentOS mirror.
es: Copie dentro del directorio :file:`vmlinuz` y :file:`initrd.img`. Estos archivos son públicos y se pueden encontrar en la imagen ISO, en el directorio :file:`/images/pxeboot` o descargados desde un espejo de CentOS.
it: Copiare dentro la directory appena creata i file :file:`vmlinuz` e :file:`initrd.img`. Questi file sono pubblici e possono essere trovati nella immagine ISO, sotto la directory :file:`/images/pxeboot`, oppure scaricati da un mirror di CentOS.

source: Finally, power on the client host, selecting PXE boot (or boot from network) from the start up screen.
es: Por último, encienda el host del cliente, seleccionando el arranque PXE (o arranque desde la red) desde la pantalla de inicio.
it: Per finire, avviare il client, selezionando dalla schermata di avvio la modalità "PXE boot" o "boot from network", o simile.

source: References
es: Referencias
it: Riferimenti

source: Dynamic Host Configuration Protocol (DHCP) https://en.wikipedia.org/wiki/Dynamic_Host_Configuration_Protocol
es: Dynamic Host Configuration Protocol (DHCP) https://es.wikipedia.org/wiki/Dynamic_Host_Configuration_Protocol

source: Trivial File Transfer Protocol https://en.wikipedia.org/wiki/Tftp
es: Protocolo Trivial de transferencia de archivos https://es.wikipedia.org/wiki/TFTP

source: Preboot eXecution Environment https://en.wikipedia.org/wiki/Preboot_Execution_Environment
es: Preboot eXecution Environment https://es.wikipedia.org/wiki/Preboot_Execution_Environment
