Repository: NethServer/docs
Catalog: administrator-manual/*/locale/*/LC_MESSAGES/fail2ban.po
Languages: it

source: Fail2ban scans log files (e.g. :file:`/var/log/apache/error_log`) and bans IPs that show the malicious signs – too many password failures, seeking for exploits, etc. Generally Fail2ban is then used to update firewall rules to reject the IP addresses for a specified amount of time, although any arbitrary other action (e.g. sending an email) could also be configured. Out of the box Fail2ban comes with filters for various services (Apache, Dovecot, Ssh, Postfix, etc).
it: Fail2ban esegue la scansione dei file di log (ad esempio :file:`/var/log/apache/error_log`) e blocca gli IP che manifestano comportamenti potenzialmente dannosi: troppi errori di password, ricerca di exploit, ecc. In generale Fail2Ban viene quindi utilizzato per aggiornare le regole del firewall per rifiutare le richieste da questi indirizzi IP per un determinato periodo di tempo, sebbene sia possibile configurare qualsiasi altra azione arbitraria (ad esempio l'invio di un'e-mail). Fail2Ban viene fornito con a bordo una serie filtri per vari servizi (Apache, Dovecot, Ssh, Postfix, ecc.).

source: Fail2ban is able to reduce the rate of incorrect authentications attempts however, it cannot eliminate the risk that weak authentication presents. To improve the security, open the access to service only for secure networks using the firewall.
it: Fail2Ban è in grado di ridurre il numero di tentativi di autenticazione errati, tuttavia non può eliminare il rischio che presenta un'autenticazione debole. Per migliorare la sicurezza, aprire l'accesso ai servizi alle sole reti conosciute e protette utilizzando il firewall.

source: Installation
it: Installazione

source: Install from the Software Center or use the command line: ::
it: Installare il modulo dal Software Center o usando la riga di comando: ::

source: Settings
it: Impostazioni

source: Fail2ban is configurable in the security category of the server-manager. Most of settings can be changed in the :guilabel:`Configuration` tab, only really advanced settings must be configured by the terminal.
it: Fail2ban è configurabile tramite una apposita voce presente nella categoria sicurezza del server-manager. La maggior parte delle impostazioni possono essere modificate nella scheda :guilabel:`Configurazione`, solo le impostazioni più avanzate devono essere configurate dal terminale.

source: Jails
it: Jail

source: A jail is enabled and start to protect a service when you install a new module, the relevant jail (if existing) is automatically activated after the package installation.
it: Le jail vengono abilitate e iniziano a proteggere i vari servizi non appena si installa un nuovo modulo, la jail relativa ad un servizio (se esistente) viene automaticamente attivata dopo l'installazione del pacchetto.

source: All jails can be disabled individually in the Jails settings.
it: Ogni jail può essere individualmente disabilitata dalle impostazioni Jail

source: Number of attempts
it: Numero di tentativi

source: Number of matches (i.e. value of the counter) which triggers ban action on the IP.
it: Numero di corrispondenze (vale a dire il valore del contatore) che attiva l'azione di divieto sull'IP.

source: Time span
it: Arco di tempo

source: The counter is set to zero if no match is found within "findtime" seconds.
it: Il contatore viene impostato a zero se non viene trovata nei log alcuna corrispondenza entro i secondi di "ricerca" configurati.

source: Ban time
it: Tempo di ban

source: Duration for IP to be banned for.
it: Periodo di permanenza in ban di un IP.

source: Recidive ban
it: Ban recidivo

source: Extend the ban of persistent abusers. Recidive ban can have 2 different behaviors:
it: Estende il blocco degli attaccanti recidivi. Il ban recidivo può avere 2 comportamenti diversi:

source: *Static ban time*: ban recidive hosts for 2 weeks, like brute force attack bots. The rule applies when an IP address has been already banned multiple times.
it: **Tempo di ban statico: blocca gli host recidivi per 2 settimane, come i bot eseguono attachi di forza bruta. La regola si applica quando un IP è già stato bloccato più volte.

source: *Incremental ban time*: increase the ban time after each failure found in log. When enabled, if you set a short ban time, a valid user can be banned for a a little while but a brute force attacker will be banned for a very long time.
it: *Temp di ban incrementale*: aumenta il tempo di blocco ad ogni tentativo fallito nel log. Quando abilitato, se si configura un tempo di blocco breve, un utente valido sarà bloccato per poco tempo mentre un attaccante verrà bloccato per un periodo molto lungo.

source: Network
it: Consenti ban sulla LAN

source: Allow bans on the LAN
it: Consente i ban sulla LAN

source: By default the failed attempts from your Local Network are ignored, except when you enabled the option.
it: Per impostazione predefinita, i tentativi falliti dalla rete locale vengono ignorati, tranne quando è stata attivata l'opzione.

source: IP/Network Whitelisting
it: IP/reti in whitelist

source: IP listed in the text area will be never banned by fail2ban (one IP per line). Network could be allowed in the Trusted-Network panel.
it: Gli IP elencati nell'area di testo non verranno mai bannato da fail2ban (va indicato un IP per riga). E' possibile consentire intere reti inserendole nel pannello Reti fidate.

source: Send email notifications
it: Invia notifiche email

source: Enable to send administrative emails.
it: Abilitando l'opzione verranno inviate email agli amministratori.

source: Administrators emails
it: Email amministratori

source: List of email addresses of administrators (one address per line).
it: Elenco di indirizzi email degli amministratori (un indirizzo per riga).

source: Notify jail start/stop events
it: Notifica eventi di abilitazione/disabilitazione di una jail

source: Send email notifications when a jail is started or stopped.
it: Invia notifiche via email all'avvio o all'arresto di una jail.

source: IPs are banned when they are found several times in log, during a specific find time. They are stored in a database to be banned again each time your restart the server or the service. To unban an IP you can use the :guilabel:`Unban IP` tab in the status category of the server-manager.
it: Gli IP sono oggetto di ban quando vengono trovati più volte nei log, in uno specifico arco di tempo. Vengono archiviati in un database per essere nuovamente bannati ogni volta che si riavvia il server o il servizio. Per sbloccare un IP è possibile utilizzare la scheda :guilabel:`unban IP` disponibile nella categoria stato del server-manager.

source: Statistics
it: Statistiche

source: The :guilabel:`Ban statistics` tab is available in the status category of the server-manager, it gives you the total number of bans per jail as well as the total of all bans.
it: La scheda :guilabel:`Ban statistics`, disponibile nella categoria stato del server-manager, fornisce il numero di ban per jail e totale.

source: Tools
it: Strumenti

source: Fail2ban-client is part of the fail2ban rpm, it gives the state of fail2ban and all available jails: ::
it: Fail2ban-client fa parte dell'rpm di fail2ban, fornisce lo stato di fail2ban e tutte le jail disponibili: ::

source: To see a specific jail : ::
it: Per ispezionare una jail specifica: ::

source: To see which log files are monitored for a jail: ::
it: Per verificare quali file di log siano monitorati da una jail: ::

source: Fail2ban-listban counts the IPs currently and totally banned in all activated jails, at the end it shows the IPs which are still banned by shorewall. ::
it: Fail2ban-listban permette di contare gli IP attualmente bannati nelle varie jail attivate e mostra anche gli IP che risultano bannati da shorewall. ::

source: Fail2ban-regex is a tool which is used to test the regex on you logs, it is a part of fail2ban software. Only one filter is allowed per jail, but it is possible to specify several actions, on separate lines.
it: Fail2ban-regex è uno strumento che viene utilizzato per testare le regex sui log, è una parte del software fail2ban. È consentito un solo filtro per jail, ma è possibile specificare diverse azioni, su righe separate.

source: The documentation is `readable at the fail2ban project <http://fail2ban.readthedocs.io/en/latest/filters.html>`_.
it: La documentazione è `consultabile sul sito del progetto fail2ban<http://fail2ban.readthedocs.io/en/latest/filters.html>`_.

source: You can also test custom regex directly: ::
it: E' possibile anche testare direttamente una regex personalizzata: ::

source: Fail2ban-unban is used to unban an IP when the ban must be removed manually. ::
it: Fail2ban-unban è utilizzabile per sbloccare un IP nel caso in cui il ban debba essere rimosso manualmente. ::

source: You can use also the built-in command with fail2ban-client: ::
it: È possibile utilizzare anche il comando integrato con fail2ban-client: ::

source: If you desire to query the IP ``whois`` database and obtain the origin of the banned IP by email, you could Install the ``whois`` rpm.
it: Se si desidera ottenere informazioni sull'origine dell'IP bannato via e-mail, è possibile utilizzare il database ``whois`` installando l'rpm ``whois``.
