Repository: NethServer/docs
Catalog: administrator-manual/*/locale/*/LC_MESSAGES/firewall2.po
Languages: it

source: This chapter describes the changes introduced by the *Firewall* application in the new Server Manager. Basic firewall behavior is unchanged and described inside :ref:`firewall-section`.
it: Questo capitolo descrive le modifiche introdotte dall'applicazione *Firewall* del nuovo Server Manager. Il comportamento di base del firewall è invariato e rimane quello descritto nella sezione :ref:`firewall-section`.

source: Please note that some changes made in the new Server Manager may not be reflected in the old one.
it: Si noti che alcune delle modifiche apportate nel nuovo Server Manager potrebbero non riflettersi nella interfaccia precedente.

source: General
it: Generale

source: Main differences from the old Server Manager:
it: Principali differenze rispetto al vecchio Server Manager:

source: the rules panel has been split into 3 different pages:
it: il pannello delle regole è stato separato in 3 diverse pagine:

source: all pages use :ref:`apply_revert-section` behavior
it: tutte le pagine utilizzano la funzione di :ref:`apply_revert-section`

source: smart search: on most panels the full text search can be used to quickly find existing rules or objects
it: ricerca intelligente: nella maggior parte dei pannelli è possibile utilizzare la ricerca full-text per trovare rapidamente regole o oggetti esistenti

source: advanced properties: when creating new rules, only the most common fields are shown. To show other less common parameters click the :guilabel:`Advanced` label
it: proprietà avanzate: quando si creano nuove regole, vengono visualizzati solo i campi più comuni. Per mostrare altri parametri meno comuni è necessario fare clic sull'etichetta :guilabel:`Avanzate`

source: raw address support: the user can use raw IP addresses (or CIDR) whenever creating a rule. Such raw addresses can be later converted to firewall objects using the :guilabel:`Create Host` and :guilabel:`Create CIDR subnet` actions which will appear next to the IP address
it: supporto indirizzo "grezzo": l'utente può utilizzare direttamente indirizzi IP (o reti CIDR) ogni volta che crea una regola. Tali indirizzi possono essere successivamente convertiti in oggetti firewall utilizzando le azioni :guilabel:`Crea Host` e :guilabel:`Crea rete CIDR` che appariranno accanto all'indirizzo IP

source: real-time charts: many pages has real-time charts displaying data from ``netdata``. Since netdata is not installed by default, you can install it from :ref:`software-center-section`.
it: grafici in tempo reale: molte pagine hanno grafici in tempo reale che mostrano i dati raccolti da ``netdata``. Netdata non è installato di default, è possibile installarlo attraverso il :ref:`software-center-section`.

source: list of active :ref:`firewall_connections-section`
it: lista delle :ref:`firewall_connections-section` attive

source: Apply and revert
it: Applica e ripristina

source: Every time the configuration has been changed, modifications are not applied immediately but saved in a temporary store. For the changes to take effect, click on the :guilabel:`Apply` button at the top right corner of the page.
it: Ogni volta che la configurazione viene modificata, le modifiche non vengono applicate immediatamente ma salvate in un archivio temporaneo. Per rendere effettive le modifiche, fare clic sul pulsante :guilabel:`Applica` presente nell'angolo in alto a destra della pagina.

source: As long as the new rules created have not been applied, you can revert all changes clicking the :guilabel:`Revert` button at the top right corner of the page.
it: Finché non sono state applicate le nuove regole create, è possibile riportare il sistema allo stato precedente facendo clic sul pulsante :guilabel: `Ripristina` presente nell'angolo in alto a destra della pagina.

source: The dashboard displays the local firewall network topology along with the number of established connection, the count of configured objects and the list of active services.
it: La dashboard visualizza la topologia della rete firewall locale insieme al numero di connessioni stabilite, al conteggio degli oggetti configurati e all'elenco dei servizi attivi.

source: All red interfaces are listed on the top of the page, just below bandwidth usage charts. Download and upload bandwidth can be automatically calculated using :guilabel:`Speedtest` button. Each red network interface can be also enabled and disabled directly from the list.
it: Tutte le interfacce red sono elencate nella parte superiore della pagina, appena sotto i grafici di utilizzo banda. La banda in download e upload può essere calcolata automaticamente utilizzando il pulsante :guilabel:`Speedtest`. Ogni interfaccia di rete red può anche essere abilitata e disabilitata direttamente dall'elenco.

source: To change WAN mode and link monitoring options click on :guilabel:`Configure` button.
it: Per modificare la modalità WAN e le opzioni di monitoraggio dei provider, fare clic sul pulsante :guilabel:`Configura`.

source: Rules can be created under the :guilabel:`Rules` section on the same page. After creating or editing rules, make sure to :ref:`apply <apply_revert-section>` the changes.
it: Le regole possono essere create dalla sezione :guilabel:`Regole` nella stessa pagina. Dopo aver creato o modificato delle regole, assicurarsi di :ref:`apply <apply_revert-section>` le modifiche per metterle in produzione.

source: Traffic shaping
it: Gestione banda

source: Traffic shaping classes are used to commit bandwidth for specific network traffic. For each class the bandwidth can be specified using the percentage of available network bandwidth or with absolutes values expressed in kbps.
it: Le classi per la gestione banda vengono utilizzate per dedicare una data larghezza di banda ad uno specifico traffico di rete. La larghezza di banda di ogni classe può essere specificata usando valori percentuali per indicare la banda disponibile o valori assoluti espressi in kbps.

source: As default, a traffic shaping class is applied to all red network interfaces. Such behavior can be changed by selecting an existing red interfaces under the :guilabel:`Bind to` menu inside the :guilabel:`Advanced` section. Bound classes and bandwidth expressed in kbps are not usable inside the old Server Manager.
it: Come impostazione predefinita, una classe di gestione banda viene applicata a tutte le interfacce di rete red. Tale comportamento può essere modificato selezionando un'interfaccia red esistente nel menu :guilabel: `Collega a` all'interno della sezione :guilabel:`Avazate`. Le classi vincolate e la banda espressa in kbps non sono utilizzabili nel vecchio Server Manager.

source: SNAT is available only if there is at least one IP alias configured on red network interfaces. See also :ref:`snat-section`.
it: SNAT è disponibile solo se esiste almeno un alias IP configurato sulle interfacce di rete red. Vedi anche :ref:`snat-section`.

source: Objects
it: Oggetti

source: Firewall objects page offer the same features as the :ref:`old Server Manager <firewall_objects-section>`.
it: La pagina degli oggetti del firewall offre le stesse funzionalità presenti nel :ref:`vecchio Server Manager <firewall_objects-section>`.

source: Port forwards are grouped by destination host and support raw IP addresses along with firewall objects.
it: I port forwarding sono raggruppati per host di destinazione e supportano l'utilizzo di oggetti firewall e indirizzi IP "diretti".

source: The following protocols are supported only in the new Server Manager:
it: I seguenti protocolli sono supportati solo nel nuovo Server Manager:

source: For more info on port forward see the :ref:`old Server Manager <port_forward-section>`.
it: Per maggiori informazioni sui port forward dare riferimento alla documentazione del :ref:`vecchio Server Manager <port_forward-section>`.

source: Rules
it: Regole

source: This page allows the management of rules applied only to the network traffic traversing the firewall. To create rules for the traffic from/to the firewall itself, see the :ref:`local_rules-section`.
it: Questa pagina consente la gestione delle regole applicate solamente al traffico di rete che attraversa il firewall. Per creare regole per il traffico da/verso il firewall stesso, consultare la sezione :ref:`local_rules-section`.

source: A rule consists of five main parts:
it: Una regola si compone di cinque parti principali:

source: Source
it: Sorgente

source: Destination
it: Destinazione

source: Service (optional)
it: Servizio (opzionale)

source: Action
it: Azione

source: Time condition (optional)
it: Condizione temporale (opzionale)

source: Available actions are:
it: Le azioni disponibili sono:

source: :dfn:`ACCEPT`: accept the network traffic
it: :dfn:`ACCEPT`: accetta il traffico

source: :dfn:`REJECT`: block the traffic and notify the sender host
it: :dfn:`REJECT`: blocca il traffico ed informa il mittente che la richiesta effettuata non è permessa

source: :dfn:`DROP`: block the traffic, packets are dropped and no notification is sent to the sender host
it: :dfn:`DROP`: blocca il traffico, i pacchetti vengono scartati e il mittente non viene notificato

source: Rules support raw IP addresses and two extra zones:
it: Le regole supportano l'inserimento diretto di indirizzi IP e contemplano due zone extra:

source: ivpn: all traffic from IPSec VPNs
it: ivpn: tutto il traffico proveniente da VPN IPSec

source: ovpn: all traffic from OpenVPN VPNs
it: ovpn: tutto il traffico proveniente da VPN OpenVPN

source: Both zones are available only if VPN application is installed. Rules using such zones, can't be modified from the :ref:`old Server Manager <firewall-rules-section>`.
it: Entrambe le zone sono disponibili solo se è installata l'applicazione VPN. Le regole che usano tali zone, non possono essere modificate dal :ref:`vecchio Server Manager <firewall-rules-section>`.

source: Policies
it: Policy

source: To display active policies click on the :guilabel:`Policies` button. Policies are affected by changes on the :ref:`firewall_settings-section` page.
it: Per visualizzare le policy attive fare clic sul pulsante :guilabel:`Policy`. Le policy sono influenzate dalle modifiche introdotte nella pagina :ref:`firewall_settings-section`.

source: Local rules
it: Regole locali

source: This page allows the management of rules applied only to the network traffic generated from the firewall, or directed to the firewall itself. The configuration is the same as :ref:`firewall_rules_new-section` page.
it: Questa pagina consente la gestione delle regole applicate solo al traffico di rete generato dal firewall o diretto al firewall stesso. La configurazione è la stessa disponibile nella pagina :ref:`firewall_rules_new-section`.

source: Connections
it: Connessioni

source: This page keeps track of all active connections. Connections can be filter by :guilabel:`Protocol` and :guilabel:`State`. The list of connections is not refreshed in real time. To list new connections click the :guilabel:`Refresh` button.
it: Questa pagina tiene traccia di tutte le connessioni attive. Le connessioni possono essere filtrate per :guilabel:`Protocollo` e :guilabel:`Stato`. L'elenco delle connessioni non viene aggiornato in tempo reale. Per visualizzare le nuove connessioni fare clic sul pulsante :guilabel:`Aggiorna`.

source: The administrator can delete a single connection or flush the whole connection tracking table using :guilabel:`Delete all connections` button.
it: L'amministratore può cancellare una singola connessione o svuotare l'intera tabella di tracciamento della connessione usando il pulsante :guilabel:`Elimina tutte le connessioni`.

source: Settings
it: Impostazioni

source: Global settings which affect the whole firewall behavior, like MAC validation. When the :guilabel:`Traffic to Internet (red interface)` option is changed, modifications are reflected inside the :ref:`policies-section` section.
it: Qui si trovano le impostazioni globali che influenzano l'intero comportamento del firewall, come la validazione del MAC. Quando viene modificata l'opzione :guilabel:`Traffico verso Internet (interfacce red)`, le modifiche si riflettono nella sezione :ref:`policy-section`.
