Repository: NethServer/docs
Catalog: administrator-manual/*/locale/*/LC_MESSAGES/firewall.po
Languages: it

source: |product| can act as :index:`firewall` and :index:`gateway` inside the network where it is installed. All traffic between computers on the local network and the Internet passes through the server that decides how to route packets and what rules to apply. Firewall mode is enabled only if the system has at least one network interface configured with red role.
it: | product| può agire da : index: `firewall` e: index:` gateway` all'interno della rete in cui è installato. Tutto il traffico tra i computer della rete locale e Internet passa attraverso il server che decide come instradare i pacchetti e quali regole applicare. La modalità firewall è abilitata solo se il sistema ha almeno un'interfaccia di rete configurata con il ruolo red.

source: The Firewall application can be installed from :ref:`software-center-section` and includes:
it: L'applicazione Firewall può essere installata dal :ref:`software-center-section` e comprende:

source: Multi WAN support up to 15 connections
it: Supporto WAN multiple (fino a 15 connessioni)

source: Firewall rules management
it: Gestione regole firewall

source: Traffic shaping (QoS)
it: Gestione banda (QoS)

source: Routing rules to divert traffic on a specific WAN
it: Regole per routing traffico su una specifica WAN

source: Smart search to quickly find existing rules or objects
it: Ricerca intelligente per individuare rapidamente regole e oggetti

source: Real time charts
it: Grafici in tempo reale

source: Real time charts display traffic and service statistics collected by `Netdata <https://www.netdata.cloud/>`_. To avoid performance penalty on slow hardware, Netdata is not part of the firewall application and can be installed from :ref:`software-center-section`.
it: I grafici in tempo reale mostrano le statistiche sul traffico e sui servizi raccolte da `Netdata <https://www.netdata.cloud/>` _. Per evitare una riduzione delle prestazioni su hardware lento, Netdata non fa parte dell'applicazione firewall e può essere installato da: ref: `software-center-section`.

source: Apply and revert
it: Applica e ripristina

source: Every time the firewall configuration has been changed, modifications are not applied immediately but saved in a temporary store. For the changes to take effect, click on the :guilabel:`Apply` button at the top right corner of the page.
it: Ogni volta che la configurazione viene modificata, le modifiche non vengono applicate immediatamente ma salvate in un archivio temporaneo. Per rendere effettive le modifiche, fare clic sul pulsante :guilabel:`Applica` presente nell'angolo in alto a destra della pagina.

source: As long as the new rules created have not been applied, you can revert all changes by clicking the :guilabel:`Revert` button at the top right corner of the page.
it: Finché le nuove regole non sono state applicate è possibile riportare il sistema allo stato precedente facendo clic sul pulsante :guilabel: `Ripristina` presente nell'angolo in alto a destra della pagina.

source: Each interface is identified with a color indicating its role within the system. See :ref:`network-section`.
it: Ogni interfaccia di rete è identificata da un colore che ne indica il ruolo all'interno del sistema. Vedi :ref:`network-section`.

source: When a network packet passes through a firewall zone, the system evaluates a list of rules to decide whether traffic should be blocked or allowed. :dfn:`Policies` are the default rules to be applied when the network traffic does not match any existing criteria.
it: Quando un pacchetto di rete attraversa una zona del firewall, il sistema valuta una lista di regole per decidere se il traffico debba essere bloccato o permesso. Le :dfn:`policy` sono le regole di default che vengono applicate se il traffico di rete non corrisponde a nessun criterio esistente.

source: Firewall :index:`policies` allow inter-zone traffic accordingly to this schema: ::
it: Le :index:`policy` del firewall permettono il traffico fra zone seguendo lo schema qui sotto: ::

source: Traffic is allowed from left to right, blocked from right to left.
it: Il traffico è permesso da sinistra a destra, bloccato da destra a sinistra.

source: To display the list of active policies click on the :guilabel:`Policies` button inside the :guilabel:`Rules` page.
it: Per visualizzare la lista di policy attive cliccare sul pulsante :guilabel:`Policy` nella pagina :guilabel:`Regole`.

source: Policies can be changed by creating specific rules between zones from the :guilabel:`Rules` page or by accessing the :ref:`traffic_to_internet-section` section inside the :guilabel:`Settings` page.
it: Le policy possono essere modificate creando regole specifiche tra le zone dalla pagina :guilabel:`Regole` o accedendo alla sezione :ref:`traffic_to_internet-section` all'interno della pagina :guilabel:`Impostazioni`.

source: Settings
it: Impostazioni

source: In this section you can change standard firewall behavior.
it: In questa sezione è possibile modificare il comportamento di default del firewall.

source: Traffic to Internet
it: Traffico verso Internet

source: The default firewall policy allows all traffic from green to red interfaces (Internet). To change the default policy for Internet access, enable or disable the :guilabel:`Traffic to Internet (red interface)` option. If disabled all traffic from green to red network is blocked. Specific traffic can be allowed creating rules from :guilabel:`Rules` page.
it: La policy predefinita del firewall consente tutto il traffico dalle interfacce green a quelle red (Internet). Per modificare la policy predefinita per l'accesso a Internet, abilitare o disabilitare l'opzione :guilabel:`Traffico verso Internet (interfaccia red)`. Se disabilitata, tutto il traffico dalla rete green a quella red viene bloccato. È possibile consentire traffico specifico creando apposite regole dalla pagina :guilabel:`Regole`.

source: Traffic between VPNs
it: Traffico fra VPN

source: By default traffic between different VPN tunnels is not allowed, but sometimes you would need to allow it like when a OpenVPN roadwarrior client should reach a remote resource behind an IPsec tunnel. To permit traffic between VPNs, just enable the :guilabel:`Traffic between OpenVPN roadwarrior, OpenVPN tunnels and IPSec tunnels` option. Extra block rules can be created from :guilabel:`Rules` page to customize the network access between VPN zones.
it: Per impostazione predefinita, il traffico tra diversi tunnel VPN non è consentito, ma a volte è necessario consentirlo come, ad esempio, quando un client OpenVPN roadwarrior deve poter raggiungere una risorsa remota dietro un tunnel IPsec. Per consentire il traffico tra le VPN è sufficiente abilitare l'opzione :guilabel:`Traffico fra OpenVPN roadwarrior, tunnel OpenVPN e tunnel IPSec`. È possibile creare regole di blocco extra dalla pagina :guilabel:`Regole` per personalizzare l'accesso alla rete dalle zone VPN.

source: Ping from Internet
it: Ping da Internet

source: Allows |product| to answer ICMP requests from red interfaces (Internet).
it: Consente a |product| di rispondere alle richieste ICMP provenienti dalle interfacce red (Internet).

source: By default, all port forwards are available only for hosts inside the WAN. When Hairpin NAT is active, hosts on the local zones will be able to reach forwarded ports using both public and private firewall IP addresses.
it: Per impostazione predefinita, tutti i port forwarding sono attivi solo per le richieste che arrivano dalla WAN. Quando l'Hairpin NAT è attivo, gli host nelle zone locali saranno in grado di raggiungere le porte inoltrate utilizzando sia gli indirizzi IP pubblici che gli indirizzi IP privati del firewall.

source: Whenever possible it is recommended to avoid enabling this option and correctly configure split DNS to resolve service names inside the LAN.
it: Quando possibile, si consiglia di evitare di abilitare questa opzione e configurare lo split DNS per risolvere correttamente i nomi dei servizi all'interno della LAN.

source: If hair-pinning is still required, check the :guilabel:`Enable hairpin NAT` option.
it: Se l'hair-pin fosse necessario, selezionare l'opzione :guilabel:`Abilita hairpin NAT`.

source: This functionality requires |product| to have a public IP address on the red interface.
it: Per poter abilitare questa funzionalità è necessario che |product| abbia un indirizzo IP pubblico sull'interfaccia red.

source: Application layer gateways handle dynamic firewall rules for certain protocols. Many ALGs are enabled by default on |product|, to allow some protocols (such as FTP, SIP, etc) to operate through NAT. ALGs inspect and rewrite specific network packets and automatically open required ports.
it: Gli application layer gateway gestiscono le regole dinamiche del firewall per determinati protocolli. Molti ALG sono abilitati per impostazione predefinita su |product|, per consentire ad alcuni protocolli (come FTP, SIP, ecc.) di lavorare correttamente anche in presenza di un NAT. Gli ALG ispezionano e riscrivono pacchetti di rete specifici e aprono automaticamente le porte richieste.

source: **Enable SIP-ALG and H.323-ALG**
it: **Abilita gestione SIP-ALG e H.323-ALG**

source: Some PBXs may not work properly with SIP-ALG and H.323-ALG. In case of audio and call problems with your PBX or your VoIP client try to disable them.
it: Alcuni PBX potrebbero non funzionare correttamente con SIP-ALG e H.323-ALG attivi. In caso di problemi audio e di chiamata con PBX o client VoIP provare a disabilitarli.

source: IP/MAC binding
it: Binding IP/MAC

source: The firewall can use the list of DHCP reservations to strictly check all traffic generated from hosts inside local networks. DHCP server should could be disabled but the administrator must still create reservations to associate the IP with a MAC address. See :ref:`dhcp-section` for more details.
it: Il firewall può utilizzare l'elenco delle reservation DHCP per controllare rigorosamente tutto il traffico generato dagli host all'interno delle reti locali. Anche nel caso in cui il server DHCP sia disabilitato, l'amministratore deve comunque creare delle reservation per associare IP a indirizzi MAC. Vedere :ref:`dhcp-section` per maggiori dettagli.

source: When :index:`IP/MAC binding` is enabled, the administrator will choose what policy will be applied to hosts without a DHCP reservation. The common use is to allow traffic only from known hosts and block all other traffic. In this case, hosts without a reservation will not be able to access the firewall nor the external network.
it: Quando il :index:`binding IP/MAC` è abilitato, l'amministratore sceglierà quale criterio applicare agli host senza una reservation DHCP. L'utilizzo comune è consentire il traffico solo da host noti e bloccare tutto il resto del traffico. In questo caso, gli host senza reservation non potranno accedere né al firewall né alla rete esterna.

source: To enable traffic only from well-known hosts, follow these steps:
it: Per abilitare il traffico solo dagli host conosciuti, seguire questi passi:

source: Create a DHCP reservation for a host
it: Creare una DHCP reservation per l'host

source: Go to :menuselection:`Firewall rules` page and select from :guilabel:`Configure` from the button menu
it: Andare sulla pagina :menuselection:`Regole firewall` e selezionare :guilabel:`Configura` dal menu

source: Select :guilabel:`MAC validation (IP/MAC binding)`
it: Selezionare :guilabel:`Validazione MAC (Binding IP/MAC)`

source: Choose :guilabel:`Block traffic` as the policy to apply to unregistered hosts
it: Spuntare :guilabel:`Blocca traffico` come policy per gli host senza riserva DHCP

source: Remember to create at least one DHCP reservation before enabling the IP/MAC binding mode, otherwise, no hosts will be able to manage the server using the web interface or SSH.
it: Ricordarsi di creare almeno una DHCP reservation prima di abilitare la modalità binding IP/MAC, altrimenti nessun host sarà in grado di configurare il server usando l'interfaccia web o SSH.

source: Rules
it: Regole

source: :index:`Rules` apply to all traffic passing through the firewall. When a network packet moves from one zone to another, the system looks among configured rules. If the packet matches a rule, the rule is applied.
it: Le :index:`regole` vengono applicate a tutto il traffico di rete che attraversa il firewall. Quando un pacchetto di rete transita da una zona all'altra, il sistema cerca fra le regole configurate. Se le caratteristiche del pacchetto corrispondono a quelle descritte in una regola, tale regola viene applicata.

source: Rule's order is very important. The system always applies the first rule that matches.
it: L'ordine delle regole è molto importante. Il sistema applica sempre la prima regola che corrisponde al traffico in transito.

source: A rule consists of five main parts:
it: Una regola si compone di cinque parti principali:

source: Action
it: Azione: azione da intraprendere quando si applica la regola

source: Source
it: Origine traffico: indirizzo di origine del traffico, può essere una zona, una rete o un singolo host

source: Destination
it: Destinazione traffico: indirizzo di destinazione del traffico, può essere una zona, una rete o un singolo host

source: Service (optional)
it: Servizio (opzionale)

source: Time condition (optional)
it: Condizione temporale (opzionale)

source: Available actions are:
it: Le azioni disponibili sono:

source: :dfn:`ACCEPT`: accept the network traffic
it: :dfn:`ACCEPT`: accetta il traffico

source: :dfn:`REJECT`: block the traffic and notify the sender host
it: :dfn:`REJECT`: blocca il traffico ed informa il mittente che la richiesta effettuata non è permessa

source: :dfn:`DROP`: block the traffic, packets are dropped and no notification is sent to the sender host
it: :dfn:`DROP`: blocca il traffico, i pacchetti vengono scartati e il mittente non viene notificato

source: Source and destination fields accept built-in roles, :ref:`firewall_objects-section` and raw IPv4 addresses or CIDR. Such raw addresses can be later converted to firewall objects using the :guilabel:`Create Host` and :guilabel:`Create CIDR subnet` actions which will appear next to the address itself.
it: I campi sorgente e destinazione accettano ruoli predefiniti, :ref:`firewall_objects-section` e indirizzi IPv4 o reti in notazione CIDR. Tali indirizzi possono essere successivamente convertiti in oggetti firewall utilizzando le azioni :guilabel:`Crea Host` e :guilabel:`Crea rete CIDR` che appariranno accanto all'indirizzo IP.

source: If :ref:`vpn-section` application is installed, there are also two extra zones available:
it: Se c'è installata l'applicazione :ref:`vpn-section` ci saranno due zone extra disponibili:

source: *ivpn*: all traffic from IPSec VPNs
it: *ivpn*: tutto il traffico proveniente da VPN IPsec

source: *ovpn*: all traffic from OpenVPN VPNs
it: *ovpn*: tutto il traffico proveniente da VPN OpenVPN

source: The configuration of firewall rules is split into two different pages:
it: La configurazione delle regole di firewall è divisa in 2 differenti pagine:

source: **Rules**: manage rules applied only to the network traffic traversing the firewall.
it: **Regole**: gestisce le regole che si applicano a tutto il traffico di rete che attraversa il firewall.

source: **Local rules**: manage rules applied only to the network traffic generated from the firewall, or directed to the firewall itself.
it: **Regole Locali**: gestisce le regole che si applicano al traffico generato dal firewall o destinato al firewall stesso.

source: When creating new rules, only the most common fields are shown. To show other less common parameters click the :guilabel:`Advanced` label.
it: Quando si creano nuove regole, vengono visualizzati solo i campi più comuni. Per mostrare altri parametri meno comuni è necessario fare clic sull'etichetta :guilabel:`Avanzate`

source: If no red interface has been configured, the firewall will not generate rules for blue and orange zones.
it: Se non ci sono interfacce red configurate, il firewall non genera regole per le zone blue e orange.

source: As a general rule, you should use :index:`REJECT` when you want to inform the source host that the port which it is trying to access is closed. Usually, the rules on the LAN side can use REJECT.
it: Come regola generale, si consiglia di usare :index:`REJECT` quando si desidera informare l'host sorgente del traffico che la porta a cui si sta provando ad accedere è chiusa. Solitamente le regole che rispondono alle richieste della LAN possono usare REJECT.

source: For connections from the Internet, it is recommended to use :index:`DROP`, in order to minimize the information disclosed to any attacker.
it: Per le connessioni provenienti da Internet si consiglia di usare :index:`DROP`, al fine di minimizzare la rivelazione di informazioni ad eventuali attaccanti.

source: When a rule matches the ongoing traffic, it's possible to register the event on a log file by checking the option from the web interface. :index:`Firewall log` is saved in :file:`/var/log/firewall.log` file. The log can be inspected from the command line or using the :guilabel:`Logs` page.
it: Quando una regola viene applicata, è possibile registrare l'evento nel log abilitando la relativa spunta. Il :index:`log del firewall` è salvato nel file :file:`/var/log/firewall.log`.

source: Deep Packet Inspection (`DPI <https://en.wikipedia.org/wiki/Deep_packet_inspection>`_) is an advanced packet filtering technique.
it: La Deep Packet Inspection (`DPI <https://en.wikipedia.org/wiki/Deep_packet_inspection>`_) è una tecnica avanzata di filtraggio dei pacchetti.

source: When the :index:`DPI` module is active, new items for the :guilabel:`Service` field are available in the :guilabel:`Edit rule` form. Those items are labeled *DPI protocol*, among the usual *network service* and *service object* items.
it: Attivando il modulo :index:`DPI`, vengono rese disponibili delle voci aggiuntive per il campo :guilabel:`Servizi` disponibile nelle schermate di creazione/modifica delle regole firewall. Queste voci sono etichettate come *protocollo DPI* tra le usuali voci *servizio* e *servizio di rete*.

source: The DPI module uses the `nDPI library <https://www.ntop.org/products/deep-packet-inspection/ndpi/>`_ which can identify around 250 types of network traffic split in network protocols (eg. OpenVPN, DNS) and web applications (eg. Netflix, Spotify).
it: Il modulo DPI utilizza la libreria `nDPI <https://www.ntop.org/products/deep-packet-inspection/ndpi/>` _ in grado di identificare oltre 250 tipi di traffico di rete suddiviso in protocolli di rete (ad esempio OpenVPN, DNS) e applicazioni Web (ad esempio, Netflix, Spotify).

source: Firewall rules using DPI services are generated inside the mangle table, for this reason such rules have some limitations:
it: Le regole del firewall che utilizzano i servizi DPI vengono generate all'interno della tabella mangle, per questo motivo tali regole hanno alcune limitazioni:

source: `reject` action is not supported, use `drop` to block traffic
it: L'azione `reject` non è supportata, va utilizzata l'azione `drop` per bloccare il traffico

source: `any` and `firewall` can't be used as source or destination
it: non è possibile utilizzare gli oggetti `tutti (any)` e `firewall` come sorgente o destinazione

source: `route to provider X` action is not supported: the identification of the protocol often begins after the connection has been already established, so the routing decision can't be changed
it: l'azione `devia su X` non è supportata: l'identificazione del protocollo inizia spesso dopo che la connessione è già stata stabilita, quindi la policy di routing non può essere modificata

source: Even if DPI can identify traffic to/from specific web sites such as Facebook, it is better suited to block or shape protocols like VPN, FTP, etc. Web site access should be regulated using :ref:`proxy-section`.
it: Anche se DPI può identificare il traffico da/per specifici siti web come Facebook, è più adatto per bloccare o priorizzare protocolli come VPN, FTP, ecc. L'accesso ai siti Web deve essere disciplinato utilizzando il :ref:`proxy-section`.

source: Note that some DPI protocols (such as Amazon) can match large `CDNs <https://it.wikipedia.org/wiki/Content_Delivery_Network>`_, so please do not block such protocols using DPI rules unless you want to prevent access to thousands of sites.
it: È opportuno sottolineare che alcuni protocolli DPI (come Amazon) possono corrispondere a grandi `CDN <https://it.wikipedia.org/wiki/Content_Delivery_Network>`_, quindi è opportuno non bloccare tali protocolli usando le regole DPI a meno che non si desideri impedire l'accesso a migliaia di siti.

source: DPI markers are automatically applied also to the traffic which originates from the firewall itself, like HTTP traffic from the web proxy.
it: La marcatura DPI viene applicata automaticamente anche al traffico proveniente dal firewall stesso, come il traffico HTTP dal proxy web

source: The complete list of DPI protocols, along with counters for matched traffic, is available inside the :guilabel:`DPI` page under the :menuselection:`Status` category on the left menu.
it: L'elenco completo dei protocolli DPI, insieme ai contatori per il traffico corrispondente, è disponibile nella pagina :guilabel:`DPI` sotto la categoria :menuselection:`Stato` del menu di sinistra.

source: Rules on existing connections
it: Regole sulle connessioni esistenti

source: When a new rule is created, as default, it is applied only to new connections. But in some scenarios, the administrator may need to apply the rule also on established connections.
it: Per default, quando una nuova regola viene creata, si applica solo alle nuove connessioni. Ma in alcuni scenari, l'amministratore può avere la necessità di applicare la regola anche sulle connessioni esistenti.

source: If the option :guilabel:`Apply to existing connections` is enabled, the rule will be applied to all connections including already established ones.
it: Se l'opzione :guilabel:`Applica alle connessioni esistenti` è abilitata, la regola sarà applicata a tutte le connessioni incluse quelle già stabilite.

source: Examples
it: Esempi

source: Below there are some examples of rules.
it: Si riportano di seguito alcuni esempi di regole.

source: Block all DNS traffic from the LAN to the Internet:
it: Bloccare tutto il traffico DNS proveniente dalla LAN e diretto verso Internet:

source: Action: REJECT
it: Azione: REJECT

source: Source: green
it: Origine: green

source: Destination: red
it: Destinazione: red

source: Service: DNS (UDP port 53)
it: Servizio: DNS (UDP porta 53)

source: Allow guest's network to access all the services listening on Server1:
it: Permettere alla rete ospiti di accedere a tutti i servizi in ascolto sul Server1:

source: Action: ACCEPT
it: Azione: ACCEPT

source: Source: blue
it: Origine: blue

source: Destination: Server1
it: Destinazione: Server1

source: Service: -
it: Servizio: -

source: The term :dfn:`WAN` (Wide Area Network) refers to a public network outside the server, usually connected to the Internet. A :dfn:`provider` is the company that actually manages the :index:`WAN` link.
it: Con il termine :dfn:`WAN` (Wide Area Network) si indica una rete pubblica esterna al server, solitamente collegata a Internet. I fornitori di collegamenti :index:`WAN` sono detti :dfn:`provider`.
