Repository: NethServer/docs
Catalog: administrator-manual/*/locale/*/LC_MESSAGES/firewall.po
Languages: it

source: **IP ranges**: a list of IP addresses expressed as a range. Example: ``myrange``, composed by IPs from ``192.168.1.100`` to ``192.168.1.120``
it: **Range IP**: una lista di indirizzi IP espressa come un intervallo. Esempio: ``myrange``, composto da IP dal ``192.168.1.100`` al ``192.168.1.120``

source: **CIDR Networks**: you can express a CIDR network in order to simplify firewall rules.
it: **Reti CIDR**: utilizzare una rete CIDR per semplificare e rendere più leggibili le regole.

source: Example 1 : last 14 IP addresses of the network are assigned to servers (``192.168.0.240/28``). Example 2 : you have multiple green interfaces but you want to create firewall rules only for one green (``192.168.2.0/24``).
it: Esempio 1: gli ultimi 14 indirizzi IP della rete sono assegnati ai server (``192.168.0.240/28``). Esempio 2 : Più interfacce green configurate ma vogliamo creare una regola di firewall valida solo per una di queste green (``192.168.2.0/24``).

source: **Zone**: representing networks of hosts, they must be expressed in CIDR notation. Their intended usage is for defining a part of a network with different firewall rules from those of the nominal interface. They are used for very specific needs.
it: **Zone**: rappresentano reti di host, vanno espresse in notazione CIDR, utili se si vuole definire un segmento di rete con caratteristiche differenti dalla zona di cui fa parte. Solitamente utilizzate per esigenze molto specifiche.

source: By default, all hosts belonging to a zone are not allowed to do any type of traffic. It's necessary to create all the rules on the firewall in order to obtain the desired behavior.
it: Di default gli host che fanno parte di una Zona non possono fare alcun tipo di traffico, sarà necessario quindi creare tutte le regole necessarie a caratterizzarne il comportamento.

source: **Time conditions**: can be associated to firewall rules to limit their effectiveness to a given period of time.
it: **Condizione temporali**: possono essere associati alle regole del firewall per limitarne l'effetto ad un determinato periodo di tempo.

source: Rules which have time conditions are enforced only for new connections. Example: if you are blocking HTTP connections from 09:00 to 18:00, connections established before 09:00 will be allowed until closed. Any new connection after 09:00 will be dropped.
it: Le regole che hanno condizioni temporali sono applicate solo per le nuove connessioni. Esempio: se si stanno bloccando le connessioni HTTP dalle 09:00 alle 18:00, tutte le connessioni stabilite prima delle ore 09:00 saranno permesse fino a quando non termineranno. Qualsiasi nuova connessione effettuata dopo le 09:00 sarà bloccata.

source: **Services**: a service listening on a host with at least one port and protocol. Example: ``ssh``, ``https``
it: **Servizi**: rappresentano un servizio in ascolto su un host. Esempio: ssh, https

source: **MAC addresses**: a host identified by a MAC address. The MAC address must be bound to an existing zone.
it: **MAC address**: un host identificato da un indirizzo MAC. Il MAC address deve essere collegato ad una zona inesistente.

source: When creating rules, you can use the records defined in :ref:`dns-section` and :ref:`dhcp-section` like host objects. In addition, each network interface with an associated role is automatically listed among the available zones.
it: Durante la creazione delle regole, è possibile usare i record definiti in :ref:`dns-section` e :ref:`dhcp-section` come oggetti host. Inoltre ogni interfaccia di rete con un ruolo associato è automaticamente elencata fra le zone disponibili.

source: Connections
it: Connessioni

source: This page keeps track of all active connections. Connections can be filter by :guilabel:`Protocol` and :guilabel:`State`. The list of connections is not refreshed in real time. To list new connections click the :guilabel:`Refresh` button.
it: Questa pagina tiene traccia di tutte le connessioni attive. Le connessioni possono essere filtrate per :guilabel:`Protocollo` e :guilabel:`Stato`. L'elenco delle connessioni non viene aggiornato in tempo reale. Per visualizzare le nuove connessioni fare clic sul pulsante :guilabel:`Aggiorna`.

source: The administrator can delete a single connection or flush the whole connection tracking table using :guilabel:`Delete all connections` button.
it: L'amministratore può cancellare una singola connessione o svuotare l'intera tabella di tracciamento della connessione usando il pulsante :guilabel:`Elimina tutte le connessioni`.
