Repository: NethServer/docs
Catalog: administrator-manual/*/locale/*/LC_MESSAGES/firewall.po
Languages: it

source: All WAN network interfaces are labeled with the red role and are listed on the top of the page, just below bandwidth usage charts. Rules can be created under the :guilabel:`Rules` section on the same page.
it: Tutte le interfacce WAN sono marcate con il ruolo red ed elencate in cima alla pagina, subito sotto i grafici di utilizzo banda. Le regole possono essere create nella sezione :guilabel:`Regole` all'interno della stessa pagina.

source: If the server has two or more configured red interfaces, it is required to correctly fill, :guilabel:`Download bandwidth` and :guilabel:`Upload bandwidth` fields from the :guilabel:`Network` page. Download and upload bandwidth can be automatically calculated using the :guilabel:`Speedtest` button.
it: Se sul server sono configurate due o più schede red, è necessario procedere alla configurazione dei campi :guilabel:`Peso link`, :guilabel:`Banda entrante` e :guilabel:`Banda uscente` della pagina :guilabel:`WAN` dell'applicazione Firewall.

source: Each provider represents a WAN connection and is associated with a network adapter. Each provider defines a :dfn:`weight`: the higher the weight, the higher the priority of the network card associated with the provider.
it: Ogni provider configurato rappresenta una connessione WAN ed è associato ad una scheda di rete. Ciascun provider definisce un :dfn:`peso`: maggiore è il :index:`peso` maggiore è la priorità della scheda di rete associata al provider stesso.

source: The system can use WAN connections in two modes:
it: Il sistema può utilizzare le connessioni WAN in 2 modi:

source: :dfn:`Balance`: all providers are used simultaneously according to their weight
it: :dfn:`Balance`: tutti i provider sono utilizzati contemporaneamente in base al loro peso

source: :dfn:`Active backup`: providers are used one at a fly from the one with the highest weight. If the provider you are using loses its connection, all traffic will be diverted to the next provider.
it: :dfn:`Active backup`: i provider sono utilizzati uno alla vola a partire da quello con il peso più alto. Se il provider in uso perde la connessione, tutto il traffico verrà dirottato sul successivo provider.

source: To determine the status of a provider, the system sends an ICMP packet (ping) at regular intervals. If the number of dropped packets exceeds a certain threshold, the provider is disabled.
it: Per determinare lo stato di un provider, il sistema invia un pacchetto ICMP (ping) ad intervalli regolari. Se il numero di pacchetti persi supera una determinata soglia, il provider viene disabilitato.

source: The administrator can configure the sensitivity of the monitoring through the following parameters:
it: L'amministratore può configurare la sensibilità del monitoraggio attraverso i seguenti parametri:

source: Percentage of lost packets
it: percentuale di pacchetti persi

source: Number of consecutive lost packets
it: numero consecutivo di pacchetti persi

source: Interval in seconds between sent packets
it: intervallo di invio fra un pacchetto e l'altro

source: To change WAN mode and link monitoring options click on :guilabel:`Configure` button.
it: Per modificare la modalità WAN e le opzioni di monitoraggio dei provider, fare clic sul pulsante :guilabel:`Configura`.

source: The network traffic can be routed to specific WANs by creating rules inside the :guilabel:`Rules` section on this page. After creating or editing rules, make sure to apply the changes. See :ref:`apply_revert-section` for details.
it: Il traffico di rete può essere instradato su una WAN specifica creando regole all'interno della sezione :guilabel:`Regole` in questa pagina. Dopo aver creato o modificato le regole, assicurarsi di applicare le modifiche. Fare riferimento alla sezione :ref:`apply_revert-section` per maggiori dettagli.

source: Example
it: Esempio

source: Given two configured providers:
it: Dati due provider così configurati:

source: Provider1: network interface eth1, weight 100
it: Provider1: interfaccia di rete eth1, peso 100

source: Provider2: network interface eth0, weight 50
it: Provider2: interfaccia di rete eth0, peso 50

source: If balanced mode is selected, the server will route a double number of connections on Provider1 over Provider2.
it: Se è attiva la modalità bilanciata, il server indirizzerà il doppio delle connessioni sul Provider1 rispetto al Provider2.

source: If active backup mode is selected, the server will route all connections on Provider1; only if Provider1 becomes unavailable the connections will be redirected to Provider2.
it: Se è attiva la modalità backup, il server indirizzerà tutte le connessioni sul Provider1; solo se il Provider1 diventa inutilizzabile tutte le connessioni saranno indirizzate sul Provider2.

source: The firewall blocks requests from public networks to private ones. For example, if a web server is running inside the LAN, only computers on the local network can access the service in the green zone. Any request made by a user outside the local network is blocked.
it: Il firewall impedisce che richieste iniziate dall'esterno possano accedere alle reti private. Se ad esempio all'interno della rete è presente un server web, solo i computer presenti nella rete green potranno accedere al servizio. Qualsiasi richiesta fatta da un utente esterno alle reti locali viene bloccata.

source: To allow any external user access to the web server you must create a :dfn:`port forward`. A :index:`port forward` is a rule that allows limited access to resources from outside of the LAN.
it: Per permettere a qualsiasi utente esterno l'accesso al server web si utilizza il :dfn:`port forward`. Il :index:`port forward` è una regola che consente un accesso limitato alle risorse delle LAN dall'esterno.

source: When you configure the server, you must choose the listening ports. The traffic from red interfaces will be redirected to selected ports. In the case of a web server, listening ports are usually port 80 (HTTP) and 443 (HTTPS).
it: Quando si configura il server, è necessario scegliere le porte in ricezione o in ascolto su cui verrà redirezionato il traffico in ingresso nella scheda red. Nel caso di un server web, le porte in ascolto sono solitamente la porta 80 (HTTP) e 443 (HTTPS).

source: When you create a port forward, you must specify at least the following parameters:
it: Quando si crea un port forward è necessario specificare almeno i seguenti parametri:

source: The source port
it: la porta di origine

source: The destination port, which can be different from the origin port
it: la porta di destinazione, che può essere diversa dalla porta di origine

source: The network protocol like TCP, UDP, TCP & UDP, AH, ESP or GRE
it: il protocollo di rete come TCP, UDP, TCP & UDP, AH, ESP o GRE

source: The address of the internal host to which the traffic should be redirected
it: l'indirizzo dell'host a cui deve essere instradato il traffico

source: It's possible to specify a port range using a colon as the separator in the source port field (eg: 1000:2000), in this case, the destination port field must be left empty
it: è possibile specificare un range di porte utilizzando i due punti come separatore nella porta di origine (es: 1000:2000), in tale caso particolare il campo porta di destinazione dovrà rimanere vuoto

source: Port forwards are grouped by destination host and support raw IP addresses along with firewall objects.
it: I port forwarding sono raggruppati per host di destinazione e supportano l'utilizzo di oggetti firewall e indirizzi IP "diretti".

source: By default, all port forwards are available only for hosts inside the WAN, see :ref:`hairpin-section` to change such behavior.
it: Per impostazione predefinita, tutti i port forward sono disponibili solo per le richieste che arrivano dalla WAN, fare riferimento alla sezione :ref:`hairpin-section` per modificare tale comportamento.

source: Given the following scenario:
it: Dato il seguente scenario:

source: Internal server with IP 192.168.1.10, named Server1
it: Server interno con IP 192.168.1.10, detto Server1

source: Web server listening on port 80 on Server1
it: Server web in ascolto sulla porta 80 su Server1

source: SSH server listening on port 22 on Server1
it: Server SSH in ascolto sulla porta 22 su Server1

source: Other services in the port range between 5000 and 6000 on Server1
it: Altri servizi nell'intervallo di porte tra 5000 e 6000 sul Server1

source: If you want to make the web server available directly from public networks, you must create a rule like this:
it: In caso si voglia rendere accessibile dall'esterno il server web direttamente sulla porta 80, si dovrà creare un port forward fatto così:

source: origin port: 80
it: porta origine: 80

source: destination port: 80
it: porta destinazione: 80

source: host address: 192.168.1.10
it: indirizzo host: 192.168.1.10

source: All incoming traffic on the firewall's red interfaces on port 80, will be redirected to port 80 on Server1.
it: Tutto il traffico che arriva sulle reti red del firewall sulla porta 80, verrà redirezionato alla porta 80 di Server1.

source: In case you want to make accessible from outside the SSH server on port 2222, you will have to create a port forward like this:
it: In caso si voglia rendere accessibile dall'esterno il server SSH sulla porta 2222, si dovrà creare un port forward fatto così:

source: origin port: 2222
it: porta origine: 2222

source: destination port: 22
it: porta destinazione: 22

source: All incoming traffic on the firewall's red interfaces on port 2222, will be redirected to port 22 on Server1.
it: Tutto il traffico che arriva sulle reti red del firewall sulla porta 2222, verrà redirezionato alla porta 22 di Server1.

source: In case you want to make accessible from outside the server on the whole port range between 5000 and 6000, you will have to create a port forward like this:
it: Nel caso in cui si desideri rendere il server accessibile dall'esterno usare un intervallo di porte tra 5000 e 6000, sarà necessario creare un port forward come questo:

source: origin port: 5000:6000
it: porta origine: 5000:6000

source: destination port:
it: porta destinazione:

source: All incoming traffic on the firewall's red interfaces on the port range between 5000 and 6000 will be redirected to the same ports on Server1.
it: Tutto il traffico che arriva sulle reti red del firewall per l'intervallo di porte compreso tra 5000 e 6000 verrà redirezionato alle stesse porte sul Server1.

source: Limiting access
it: Limitare accesso

source: By default, the field access to port forward is granted to anyone. You can restrict access to port forward only from some IP addresses or networks by adding entries to :guilabel:`Restrict access to` field. This configuration is useful when services should be available only from trusted IPs or networks.
it: Per impostazione predefinita, l'accesso ai port forwarding è concesso a chiunque. È possibile limitare l'accesso al port forward solo ad alcuni indirizzi IP o reti aggiungendo voci al campo: guilabel: `Restringere l'accesso a`. Questa configurazione è utile quando i servizi devono essere disponibili solo per IP o reti affidabili.

source: Example of valid entries:
it: Esempio di valori validi:

source: ``10.2.10.4``: enable port forward for traffic coming from 10.2.10.4 IP
it: ``10.2.10.4``: abilita il port forward solo per il traffico proveniente dall'IP 10.2.10.4

source: ``10.2.10.0/24``: enable port forward only for traffic coming from 10.2.10.0/24 network
it: ``10.2.10.0/24``: abilita il port forward solo per il traffico proveniente dalla rete 10.2.10.0/24

source: One-to-one :index:`source NAT` (:index:`SNAT`) is a way to make systems behind a firewall and configured with private IP addresses appear to have public IP addresses. If you have a bunch of public IP addresses and if you want to associate one of these to a specific network host, :index:`NAT 1:1` is the way. SNAT is available only if there is at least one IP alias configured on red network interfaces.
it: Uno a uno: index: `source NAT` (: index:` SNAT`) è un modo per far uscire determinati host dietro il firewall con un indirizzo IP Pubblico specifico diverso dal quello usato di default dal firewall. Per poter usare questa opzione è necessario disporre di un pool di indirizzi IP Pubblici ed aver configurato degli Alias sull'interfaccia RED sul firewall che gestiscano gli IP aggiuntivi. L'associazione tra l'host privato e l'ip pubblico si effettura tramite :index:`NAT 1:1`

source: This feature only applies to network traffic from a host inside the local network to the public Internet. It does not affect in any way the traffic from the Internet toward the alias IP. If you need to route some specific traffic to the internal host use the port forward as usual.
it: La regola si applica solo al traffico che va da un host della rete locale verso Internet.Non interessa in alcun modo il traffico generato da internet verso l'Alias IP.Per instradare traffico specifico verso l'host interno usare le normali regole di port forward.

source: If you need to route all traffic to the internal host (not recommended!) use a port forward with protocol TCP & UDP and source port 1:65535.
it: Se dovesse essere necessario instradare tutto il traffico verso l'host interno (configurazione non raccomandata) andrà definita una regola di port forward per i protocolli TCP & UDP che abbia come porte sorgenti il range 1:65535.

source: In our network we have a host called ``example_host`` with IP ``192.168.5.122``. We have also associated a public IP address ``89.95.145.226`` as an alias of ``eth0`` interface (``RED``).
it: Nella nostra rete abbiamo un host di nome ``host_esempio`` che ha IP ``192.168.5.122``. Abbiamo inoltre associato un IP pubblico di cui disponiamo ``89.95.145.226`` come alias dell'interfaccia ``eth0`` (RED).

source: We want to map our internal host (``example_host`` - ``192.168.5.122``) with public IP ``89.95.145.226``.
it: Vogliamo quindi mappare il nostro host interno (``host_esempio`` - ``192.168.5.122``) con l'IP pubblico ``89.95.145.226``.

source: In the :guilabel:`NAT 1:1` panel, we choose for the IP ``89.95.145.226`` (read-only field) the specific host (``example_host``) from the combo-box. We have configured correctly the one-to-one NAT for our host.
it: Dal pannello :guilabel:`NAT 1:1` andremo a scegliere per l'IP ``89.95.145.226`` (che compare come campo in sola lettura) il corrispondente host (``host_esempio``) che scegliamo dal combobox. Così facendo abbiamo configurato il NAT uno-a-uno per il nostro host.

source: Traffic shaping
it: Gestione banda

source: :index:`Traffic shaping` allows applying priority rules on network traffic through the firewall. In this way, it is possible to optimize the transmission, control the latency and tune the available bandwidth.
it: La :index:`gestione banda` (:index:`Traffic shaping`) permette di applicare regole di priorità sul traffico che attraversa il firewall. In tal modo è possibile ottimizzare la trasmissione, controllare la latenza e sfruttare al meglio la banda disponibile.

source: To enable traffic shaping it is necessary to know the exact amount of available download and upload bandwidth. Access the :guilabel:`Network` page and carefully set bandwidth values.
it: Per abilitare il traffic shaping è necessario conoscere l'esatta quantità di banda disponibile in download e upload. Accedere alla pagina guilabel :guilabel:`Network` e impostare attentamente i valori di larghezza di banda.

source: If download and upload bandwidth are not set for a red interface, traffic shaping rules will not be enabled for that interface.
it: Se la larghezza di banda di download e upload non è impostata per un'interfaccia red, le regole di shaping non saranno abilitate per quell'interfaccia.

source: Be sure to specify an accurate estimate of the bandwidth on network interfaces. To pick an appropriate setting, please do not trust the nominal value, but use the :guilabel:`Speedtest` button or online tools to test the real provider speed.
it: Assicurarsi di specificare una stima accurata della banda sulle interfacce. Spesso il valore nominale non è corretto, utilizzare il pulsante :guilabel:`Speedtest` o gli strumenti disponibili online per stimare correttamente la velocità della connessione.

source: In case of congestion by the provider, there is nothing to do in order to improve performance.
it: In caso di congestione da parte del provider, non c'è nulla da fare per migliorare le prestazioni.

source: Traffic shaping classes are used to commit bandwidth for specific network traffic. Configuration of traffic shaping is composed of 2 steps:
it: Le classi di traffic shaping vengono utilizzate per riservare la larghezza di banda per il traffico di rete specifico. La configurazione del traffic shaping è composta da 2 passaggi:

source: creation of traffic shaping classes
it: creazione di classi per gestione della banda

source: assignment of network traffic to a specific class
it: assegnazione del traffico di rete a una classe specifica

source: Classes
it: Classi

source: Traffic shaping is achieved by controlling how bandwidth is allocated to classes.
it: Il traffic shaping viene ottenuto controllando il modo in cui la larghezza di banda viene allocata alle classi.

source: Each class can have a reserved rate. A reserved rate is the bandwidth a class will get only when it needs it. The spare bandwidth is the sum of not committed bandwidth, plus the committed bandwidth of a class but not currently used by the class itself.
it: Ogni classe può avere una percentuale riservata. Una percentuale riservata è la larghezza di banda che una classe avrà a disposizione in caso di necessità. La larghezza di banda disponibile è data dalla somma della larghezza di banda non impegnata e della larghezza di banda impegnata di una classe, ma non attualmente utilizzata dalla classe stessa.

source: Each class can have also a maximum rate. If set, the class can exceed its committed rate, up to the maximum rate. A class will exceed its committed rate only if there is spare bandwidth available.
it: Ogni classe può avere anche una banda massima. Se impostata, la classe può superare la banda stabilita, fino alla banda massima. Una classe supererà la sua banda riservata solo se è disponibile abbastanza banda.

source: Traffic shaping classes can be defined under :guilabel:`Traffic shaping` page. When creating a new class, fill the following fields.
it: Le classi di traffic shaping possono essere definite nella pagina :guilabel:`Gestione Banda`. Quando si crea una nuova classe, compilare i seguenti campi:

source: :guilabel:`Class name`: a representative name
it: :guilabel:`Class name`: un nome rappresentativo

source: :guilabel:`Description`: optional description for the class
it: :guilabel:`Description`: descrizione facoltativa per la classe

source: Limits under :guilabel:`Download bandwidth limits` section:
it: Limiti nella sezione :guilabel: `Limiti di banda per il download`:

source: :guilabel:`Min`: minimum reserved download bandwidth, if empty no download reservation will be created
it: :guilabel:`Minimo`: banda minima riservata per il download, se vuoto non verrà riservata banda.

source: :guilabel:`Max`: maximum allowed download bandwidth, if empty no upper limit will be set
it: :guilabel:`Massimo`: banda massima consentita per il download, se vuoto non verrà creato alcun limite

source: Limits under :guilabel:`Upload bandwidth limits` section:
it: Limiti nella sezione :guilabel: `Limiti di banda per l'upload`:

source: :guilabel:`Min`: minimum reserved upload bandwidth, if empty no upload reservation will be created
it: :guilabel:`Minimo`: banda minima riservata per l'upload, se vuoto non verrà riservata banda.

source: :guilabel:`Max`: maximum allowed download bandwidth, if empty no upper limit will be created
it: :guilabel:`Massimo`: banda massima consentita per l'upload, se vuoto non verrà creato alcun limite

source: For each class the bandwidth can be specified using the percentage of available network bandwidth or with absolutes values expressed in kbps. As default, a traffic shaping class is applied to all red network interfaces. Such behavior can be changed by selecting an existing red interfaces under the :guilabel:`Bind to` menu inside the :guilabel:`Advanced` section.
it: Per ogni classe la larghezza di banda può essere specificata utilizzando la percentuale di larghezza di banda di rete disponibile o con valori assoluti espressi in kbps. Per impostazione predefinita, una classe di traffic shaping viene applicata a tutte le interfacce di rete red. Tale comportamento può essere modificato selezionando un'interfaccia rossa esistente nel menu :guilabel: `Associa a` all'interno della sezione :guilabel: ʻAvanzate`.

source: The system provides two pre-configured classes:
it: Il sistema fornisce due classi preconfigurate:

source: :guilabel:`high`: generic high priority traffic, can be assigned to something like SSH
it: :guilabel:`high`: traffico ad alta priorità generico, può essere assegnato ad SSH

source: :guilabel:`low`: low priority traffic, can be assigned to something like peer to peer file exchange
it: :guilabel:`low`: traffico a bassa priorità, può essere assegnato a un servizio come scambio di file peer to peer

source: The system always tries to prevent traffic starvation under high network load.
it: Il sistema cerca sempre di prevenire il blocco del traffico in caso di carico di rete elevato.

source: Classes will get spare bandwidth proportionally to their committed rate. So if class A has 1Mbit committed rate and class B has 2Mbit committed rate, class B will get twice the spare bandwidth of class A. In all cases, all spare bandwidth will be given to them.
it: Le classi ricevono la banda non allocata in proporzione alla loro banda minima. Per esempio, se una la classe A ha 1Mbit di banda minima e la classe B ha 2Mbit, allora la classe B riceverà il doppio della banda non allocata rispetto alla classe A. In ogni caso, tutta la banda non allocata verrà utilizzata dalle classi.

source: Network traffic can be shaped by creating rules under the :guilabel:`Rules` section in this page. After creating or editing rules, make sure to :ref:`apply <apply_revert-section>` the changes.
it: Le regole possono essere create dalla sezione :guilabel:`Regole` nella stessa pagina. Dopo aver creato o modificato delle regole, assicurarsi di :ref:`apply <apply_revert-section>` le modifiche per metterle in produzione.

source: For more info, see `FireQOS tutorial <https://github.com/firehol/firehol/wiki/FireQOS-Tutorial>`_.
it: Per maggiori informazioni, vedere `FireQOS tutorial: https://github.com/firehol/firehol/wiki/FireQOS-Tutorial>`_.

source: Firewall objects
it: Oggetti firewall

source: :index:`Firewall objects` are representations of network components and are useful to simplify the creation of rules.
it: Gli :index:`oggetti firewall` sono delle rappresentazioni dei componenti della rete e sono utili per semplificare la creazione di regole.

source: There are 6 types of objects, 5 of them represent sources and destinations:
it: Esistono 6 tipi di oggetti, 5 di questi sono relativi a sorgenti e destinazioni e sono:

source: **Host**: representing local and remote computers. Example: ``web_server``, ``goofy_pc``
it: ``Host``: rappresentano computer locali e remoti. Esempio: ``web_server``, ``goofy_pc``

source: **Groups of hosts**: representing homogeneous groups of computers. Hosts in a host group should always be reachable using the same interface. Example: ``servers``, ``router``
it: **Gruppi di host**: rappresentano gruppi omogenei di computer. Gli host all'interno di un gruppo devono essere raggiungibili attraverso la stessa interfaccia. Esempio: ``servers``,``router``
