Repository: NethServer/docs
Catalog: administrator-manual/*/locale/*/LC_MESSAGES/index.po
Languages: it

source: Installation
it: Installazione

source: Configuration
it: Configurazione

source: Applications
it: Applicazioni

source: Other modules
it: Altri moduli

source: Best practices
it: Best practice

source: NethForge modules
it: Moduli NethForge

source: Appendix
it: Appendice

source: Old Server Manager
it: Vecchio Server Manager

source: Administrator Manual
it: Manuale amministratore

source: `Web site <http://www.nethserver.org>`_
it: `Sito web <http://www.nethserver.org>`_

source: `Developer manual <http://docs.nethserver.org/projects/nethserver-devel>`_
it: `Manuale sviluppatore <http://docs.nethserver.org/projects/nethserver-devel>`_

source: See also
it: Vedi anche

source: Support: `helpdesk.nethesis.it <http://helpdesk.nethesis.it>`_
it: Supporto: `helpdesk.nethesis.it <http://helpdesk.nethesis.it>`_

source: Official site: `www.nethesis.it <http://www.nethesis.it>`_
it: Sito ufficiale: `www.nethesis.it <http://www.nethesis.it>`_

source: Italian `Manual <https://nethserver.docs.nethesis.it/it/v7/>`_
it: `Manuale <https://nethserver.docs.nethesis.it/it/v7/>`_ Italiano

source: Obsolete `NethServer 6 Manual <https://nethserver.docs.nethesis.it/en/v6/>`_
it: `Manuale NethServer 6 <https://nethserver.docs.nethesis.it/en/v6/>`_ Obsoleto
