Repository: NethServer/docs
Catalog: administrator-manual/*/locale/*/LC_MESSAGES/installation.po
Languages: es

source: Installation
es: Tipos de instalación

source: Minimum requirements
es: Requerimientos mínimos

source: Minimum requirements are:
es: Los requisitos mínimos son:

source: 1 GB of RAM
es: 1 GB de RAM

source: 10 GB of disk space
es: 10 GB de espacio en disco

source: We recommend to use at least 2 disks to setup a RAID 1. The RAID software will ensure data integrity in case of a disk failure.
es: Recomendamos utilizar al menos 2 discos para configurar un RAID 1. El software RAID garantizará la integridad de los datos en caso de fallo del disco.

source: Hardware compatibility
es: Compatibilidad de hardware

source: |product| is compatible with any hardware certified by Red Hat® Enterprise Linux® (RHEL®), listed on `hardware.redhat.com <http://hardware.redhat.com/>`__
es: |product| es compatible con cualquier hardware certificado por Red Hat® Enterprise Linux® (RHEL®), que aparezca en `hardware.redhat.com <http://hardware.redhat.com/>`__

source: Installation types
es: Tipos de instalación

source: |product| supports two installation modes. In short:
es: |product| admite dos modos de instalación. En resumen:

source: **Installing from ISO**
es: **Instalación desde ISO**

source: Download the ISO image
es: Descargar la imagen ISO

source: Prepare a DVD or USB stick
es: Preparar un DVD o una memoria USB

source: Follow the wizard
es: Seguir el asistente

source: **Installing from YUM**
es: **Instalación desde YUM**

source: Install CentOS Minimal
es: Instalar CentOS Minimal

source: Configure the network
es: Configurar la red

source: Install from network
es: Instalar desde la red

source: Installing from ISO
es: Instalación desde ISO

source: The ISO installation will erase all existing data on hard drives!
es: ¡La instalación ISO borrará todos los datos existentes en los discos duros!

source: Media creation
es: Creación de medios

source: **Download the ISO file** from official site |download_site|. The downloaded ISO file can be used to **create a bootable media** such as DVD or USB stick.
es: **Descargar el archivo ISO** desde el sitio oficial |download_site|. El archivo ISO descargado se puede utilizar para **crear un medio de arranque** tal como DVD o memoria USB.

source: USB stick
es: Memoria USB

source: On a Linux machine, open the shell and execute: ::
es: En una máquina Linux, abra el shell y ejecute: ::

source: Where `NethServer.iso` is the file name of the downloaded ISO and `/dev/sdc` is the destination device corresponding to the USB key and not a partition (such as /dev/sdc1).
es: Donde `NethServer.iso` es el nombre de archivo de la ISO descargada y `/dev/sdc` es el dispositivo de destino correspondiente a la llave USB y no a una partición (como /dev/sdc1).

source: On a Windows machine, make sure to format the USB drive then unmount it. Use one of the following tools to write the USB stick:
es: En una máquina Windows, asegúrese de formatear la unidad USB y luego desmontarla. Utilice una de las siguientes herramientas para escribir la memoria USB:

source: The creation of a bootable DVD is different from writing files into USB stick, and it requires the use of a dedicated function (e.g. *write* or *burn ISO image*). Instructions on how to create a bootable DVD from the ISO are easily available on the Internet or in the documentation of your operating system.
es: La creación de un DVD de arranque es diferente de escribir archivos en memoria USB, y requiere el uso de una función dedicada (por ejemplo, *escribir* o *quemar imagen ISO*). Las instrucciones sobre cómo crear un DVD de arranque de la ISO están fácilmente disponibles en Internet o en la documentación de su sistema operativo.

source: Install modes
es: Modos de instalación

source: **Start the machine using the freshly backed media**. If the machine will not start from the DVD or USB stick, please refer to the documentation of the motherboard BIOS. A typical problem is how boot device priority is configured. First boot device should be the DVD reader or USB stick.
es: **Encienda la máquina utilizando el soporte recién respaldado**. Si la máquina no se inicia desde el DVD o la memoria USB, consulte la documentación del BIOS de la placa base. Un problema típico es cómo se configura la prioridad del dispositivo de arranque. El primer dispositivo de arranque debe ser el lector de DVD o memoria USB.

source: On start a menu will display different types of installation:
es: Al iniciar un menú se mostrarán diferentes tipos de instalación:

source: |product| :ref:`interactive installation <installation-interactive>`
es: |product| :ref:`instalación interactiva <installation-interactive>`

source: Requires only keyboard and time zone settings. By default, tries to configure the network interfaces with DHCP and the first two available disks with RAID-1.
es: Requiere sólo ajustes de teclado y zona horaria. De forma predeterminada, intenta configurar las interfaces de red con DHCP y los dos primeros discos disponibles con RAID-1.

source: Other |product| installation methods
es: Otros métodos de instalación |product|

source: :ref:`Unattended installation <installation-unattended>` -- A set of default parameters is applied to the system with no human intervention.
es: :ref:`Instalación desatendida <installation-unattended>` -- Se aplica un conjunto de parámetros por defecto al sistema sin intervención humana.

source: :ref:`Manual installation <installation-manual>` -- This is the opposite of *unattended*. No defaults are applied: network, storage, time zone, keyboard... all settings must be provided explicitly.
es: :ref:`Instalación manual <installation-manual>` -- Esto es lo contrario de *desatendida*. No se aplican valores predeterminados: red, almacenamiento, zona horaria, teclado ... todos los ajustes deben proporcionarse explícitamente.

source: Standard CentOS installations
es: Las instalaciones estándar de CentOS

source: Use the standard CentOS installation procedure. You can then configure |product| by following the :ref:`installation-centos` section.
es: Utilice el procedimiento de instalación estándar de CentOS. A continuación, puede configurar |product| siguiendo la sección :ref:`installation-centos`.

source: Tools
es: Herramientas

source: Start the system in *rescue* (recovery) mode, execute a memory test or start the hardware detection tool.
es: Inicie el sistema en el modo *rescate* (recuperación), ejecute una prueba de memoria o inicie la herramienta de detección de hardware.

source: Boot from local drive
es: Arranque desde una unidad local

source: Attempts to boot a system that is already installed on the hard disk.
es: Intente iniciar un sistema que ya esté instalado en el disco duro.

source: At the end of the installation process you will be asked to reboot the machine. Be sure to remove the installation media before restarting.
es: Al final del proceso de instalación, se le pedirá que reinicie la máquina. Asegúrese de retirar el soporte de instalación antes de reiniciar.

source: Optional boot parameters
es: Parámetros de arranque opcionales

source: At the boot menu, you can add extra parameters by pressing :kbd:`TAB` and editing the kernel command line. This can be useful in *unattended* mode.
es: En el menú de arranque, puede agregar parámetros adicionales pulsando :kbd:`TAB` y editando la línea de comandos del kernel. Esto puede ser útil en modo *desatendido*.

source: To disable raid, just add this option to the command line: ::
es: Para deshabilitar la raid, simplemente añada esta opción a la línea de comandos: ::

source: If you need to select installation hard drives, use: ::
es: Si necesita seleccionar los discos duros de instalación, utilice: ::

source: To enable *file system encryption*, use: ::
es: Para activar *el cifrado del sistema de archivos*, utilice: ::

source: When enabling this option, all data written to the disk will be encrypted using symmetric encryption. In case of theft, an attacker will not be able to read the data without the encryption key.
es: Al activar esta opción, todos los datos escritos en el disco se cifrarán mediante cifrado simétrico. En caso de robo, un atacante no podrá leer los datos sin la clave de cifrado.

source: You will need to enter the encryption password at every system boot!
es: ¡Tendrá que introducir la contraseña de cifrado en cada arranque del sistema!

source: Other available options (*unattended* mode only):
es: Otras opciones disponibles (modo *desatendido* solamente):

source: ``keyboard``, keyboard layout, default is ``keyboard=us``
es: ``keyboard`, la disposición del teclado, por defecto es ``keyboard=us``

source: ``timezone``, default is ``timezone=UTC``
es: ``timezone``, por defecto es ``timezone=UTC``

source: Fallback IP configuration
es: Configuración IP de fallo

source: If no IP is assigned by DHCP or by other means, during the first system boot the following IP configuration is applied to the **first** network interface
es: Si no se asigna ninguna dirección IP por DHCP o por otros medios, durante la primera inicialización del sistema se aplica la siguiente configuración IP a la **primera** interfaz de red

source: netmask 255.255.255.0
es: Máscara de red 255.255.255.0

source: System administrator password
es: Contraseña del administrador del sistema

source: You are strongly advised to choose a secure password for the ``root`` user. A good password:
es: Se recomienda encarecidamente elegir una contraseña segura para el usuario ``root``. Una buena contraseña:

source: is at least 8 characters long
es: Tiene al menos 8 caracteres

source: contains uppercase and lowercase letters
es: contiene letras mayúsculas y minúsculas

source: contains symbols and numbers
es: contiene símbolos y números

source: The default password in *unattended* mode is ``Nethesis,1234``.
es: La contraseña predeterminada en el modo *desatendido* es ``Nethesis,1234``.

source: System language
es: Idioma del sistema

source: Interactive and Manual modes
es: Modos interactivo y manual

source: The **interactive** mode allows you to make a few simple choices on the system configuration.
es: El modo **interactivo** le permite realizar algunas elecciones sencillas en la configuración del sistema.

source: Required choices are:
es: Las opciones requeridas son:

source: Language
es: Idioma

source: Keyboard layout
es: Diseño del teclado

source: Root password
es: Contraseña de root

source: All other options are set to a reasonable default accordingly to current hardware (see the :ref:`installation-unattended` section for details), but you are free to edit any install configuration available.
es: Todas las demás opciones se ajustan a un valor razonable de acuerdo con el hardware actual (consulte la sección :ref:`installation-unattended` para obtener detalles), pero puede editar cualquier configuración de instalación disponible.

source: On the other hand, the **manual** mode starts the installer with no default settings at all. Also the network and storage sections must be configured.
es: Por otro lado, el modo **manual** inicia el instalador sin ninguna configuración predeterminada. También se deben configurar las secciones de red y almacenamiento.

source: Under the :guilabel:`Network > General` section, only the interfaces marked as :guilabel:`Automatically connect to this network when it is available` are enabled at boot in the installed system. For more info, refer to `RHEL 7 installation guide`_.
es: En la sección :guilabel:`Red > General`, sólo las interfaces marcadas como :guilabel:`Conectarse automáticamente a esta red cuando está disponible` están habilitadas al arrancar en el sistema instalado. Para más información, consulte `Guía de instalación de RHEL 7`.

source: Unattended mode
es: Modo desatendido

source: The *unattended* mode requires no human intervention. After installation, the system is rebooted and the following configuration is applied:
es: El modo *desatendido* no requiere intervención humana. Después de la instalación, se reinicia el sistema y se aplica la siguiente configuración:

source: Keyboard layout: ``us``
es: Disposición del teclado: ``us``

source: Time zone: ``UTC``
es: Zona horaria: UTC

source: Default ``root`` password: ``Nethesis,1234``
es: Contraseña predeterminada de``root``: ``Nethesis,1234``

source: DHCP enabled on all network interfaces; if no DHCP lease is received the :ref:`fallback IP configuration <fallback-ip-configuration>` is applied
es: DHCP habilitado en todas las interfaces de red; Si no se recibe una concesión DHCP, se aplica la opción :ref:`Configuración IP alternativa <fallback-ip-configuration>

source: if there are two or more disks, a RAID 1 will be created on first two disks and LVM volumes are created on it
es: Si hay dos o más discos, se creará un RAID 1 en los dos primeros discos y se crearán volúmenes LVM en él

source: *swap* and *root* partitions are allocated automatically; 1GB is assigned to *boot*
es: Las particiones *swap* y *root* se asignan automáticamente; 1GB está asignado a *boot*

source: Install on CentOS
es: Instalar en CentOS

source: It is possible to install |product| on a fresh CentOS minimal installation using a couple of commands to download the additional software packages. This installation method is designed for virtual private servers (VPS) where CentOS comes already installed by the VPS provider.
es: Es posible instalar |product| En una nueva instalación mínima de CentOS utilizando un par de comandos para descargar los paquetes de software adicionales. Este método de instalación está diseñado para servidores privados virtuales (VPS) donde CentOS viene ya instalado por el proveedor de VPS.

source: Enable |product| software repositories with this command: ::
es: Habilitar repositorios de software |product| con este comando: ::

source: To install the base system, run: ::
es: Para instalar el sistema base, ejecute: ::

source: Alternatively, to install base system *and* additional modules, pass the name of the module as a parameter to the install script. Example: ::
es: Alternativamente, para instalar el sistema base *and* módulos adicionales, pase el nombre del módulo como parámetro al script de instalación. Ejemplo: ::

source: Enterprise promotion
es: Promoción de Enterprise

source: To promote to the Enterprise version run the following command: ::
es: Para promocionar a la versión Enterprise, ejecute el siguiente comando: ::

source: Proceed with :ref:`registration <registration-section>` then run the following command: ::
es: Proceda con el :ref:`registro <registration-section>` y luego ejecute el siguiente comando: ::

source: Next steps
es: Próximos pasos

source: At the end of the installation procedure, :ref:`access the server-manager <access-section>` to :ref:`install additional software <package_manager-section>`.
es: Al final del procedimiento de instalación, :ref:`acceda por el administrador del servidor <access-section>` a: ref:`Instalar software adicional <package_manager-section>`.
