Repository: NethServer/docs
Catalog: administrator-manual/*/locale/*/LC_MESSAGES/launcher.po
Languages: it

source: Nethesis Launcher is a Cockpit app launcher available on HTTPS and HTTP ports. The launcher is enabled if:
it: Nethesis Launcher è un gestore di app Cockpit disponibile su porte HTTPS e HTTP. Il launcher è abilitato se:

source: Cockpit UI is installed (package ``nethserver-cockpit``)
it: la UI Cockpit è installata (package ``nethserver-cockpit``)

source: there is no home page already configured in httpd (no index page in :file:`/var/www/html`)
it: non esiste una home page già configurata in httpd (nessuna index page in :file:`/var/www/html`)

source: If Cockpit UI has been manually installed, execute the following command to enable Nethesis Launcher: ::
it: Se l'interfaccia utente Cockpit è stata installata manualmente, eseguire il comando seguente per abilitare il Nethesis Launcher: ::

source: Launcher customization
it: Personalizzazione launcher

source: You can use your company brand in the app launcher by editing this configuration file: :file:`/usr/share/httpd/noindex/nethesis/res/launcher_data.ini`. The default content of :file:`launcher_data.ini` is the following:
it: È possibile usare il proprio logo aziendale nel launcher dell'app modificando il file di configurazione: :file:`/usr/share/httpd/noindex/nethesis/res/launcher_data.ini`. Il contenuto predefinito di :file:`launcher_data.ini` è il seguente:

source: The file contains four properties that can be customized:
it: Il file contiene quattro proprietà che possono essere personalizzate:

source: ``LauncherTitle``: text appearing at the top left corner of the page
it: ``LauncherTitle``: testo che appare nell'angolo in alto a sinistra della pagina

source: ``LogoImage``: logo image appearing at the bottom left corner of the page
it: ``LogoImage``: immagine del logo che appare nell'angolo in basso a sinistra della pagina

source: ``LogoHref``: logo hyperlink
it: ``LogoHref``: hyperlink correlato al logo

source: ``DocsHref``: documentation hyperlink
it: ``DocsHref``: hyperlink documentazione

source: Example
it: Esempio

source: If you want to use your company brand in the Nethesis Launcher just follow these steps:
it: Se si desidera utilizzare il logo della tua azienda nel Nethesis Launcher, procedere nel seguente modo:

source: upload your logo image (e.g. ``my-company-logo.png``) into :file:`/usr/share/httpd/noindex/nethesis/res` directory of your server: ::
it: caricare l'immagine del logo (ad es. ``my-company-logo.png``) nella directory :file:`/usr/share/httpd/noindex/nethesis/res` del proprio server: ::

source: open :file:`/usr/share/httpd/noindex/nethesis/res/launcher_data.ini` using ``vim`` or any other text editor and edit ``LauncherTitle``, ``LogoImage``, ``LogoHref`` and ``DocsHref`` properties: ::
it: aprire il :file:`/usr/share/httpd/noindex/nethesis/res/launcher_data.ini` usando ``vim`` o qualsiasi altro editor di testo e modificare le proprietà ``LauncherTitle``, ``LogoImage``, ``LogoHref`` e `` DocsHref``: ::

source: The resulting file content should be similar to this: ::
it: Il contenuto del file risultante dovrebbe essere simile a questo: ::
