Repository: NethServer/docs
Catalog: administrator-manual/*/locale/*/LC_MESSAGES/migration.po
Languages: it

source: Migration from NethService/SME Server
it: Migrazione da NethService/SME Server

source: Migration is the process to convert a SME Server/NethService machine (:dfn:`source`) into a |product| (:dfn:`destination`). It can be achieved from a :ref:`backup <backup_migration-section>` or :ref:`using rsync <migrate_with_rsync-section>`.
it: La migrazione è il processo che consente di convertire una macchina per SME Server/NethService (:dfn:`sorgente`) in un |product| (:dfn:`destinazione`). Il processo può essere tramite :ref:`backup-migration-section` od tramite :ref:`migration-with-rsync`.

source: No custom template is migrated during the migration process. Check the new template files before copying any custom fragment from the old backup.
it: Nessun template custom sarà migrato durante il processo di migrazione. Controllare i nuovi template prima di copiare frammenti personalizzati dal vecchio backup.

source: Before running the migration procedure, read carefully all the sections of this chapter.
it: Prima di eseguire la procedura di migrazione, leggere attentamente tutte le sezioni di questo capitolo.

source: Accounts provider
it: Account provider

source: You should configure an :ref:`accounts provider <account-providers>` before starting the migration procedure.
it: E' necessario configurare un :ref:`provider account <account-providers>` prima di avviare la procedura di migrazione.

source: If the source system was joined to an Active Directory domain (Samba server role was ADS), configure a *remote Active Directory* accounts provider.
it: Se il sistema originale era collegato ad un dominio Active Directory (il ruolo Samba era ADS), configurare un *Active Directory remoto* come account provider.

source: If the source system was a NT Primary Domain Controller (Samba server role was PDC) install a *local Active Directory* accounts provider.
it: Se il sistema originale era un Controller di dominio NT (Samba con ruole PDC), installare un *Active Directory locale* come provider account.

source: If access to Shared Folders on the destination system requires user authentication, install a *local Active Directory* accounts provider.
it: Se l'accesso alle Cartelle Condivise nella destinazione richiede l'autenticazione utente, utilizzare un *Active Directory locale* come provider account.

source: In any other case, install a *local LDAP* accounts provider.
it: In ogni altro caso, installare un *LDAP locale* come provider account.

source: If you choose a *local Active Directory* accounts provider, remember to fully configure and start the DC before executing the ``migration-import`` event. See :ref:`account-providers`.
it: Se si sceglie un account provider di tipo *Active Directory* locale, ricordarsi di configurare completamente ed avviare il DC prima di eseguire l'evento ``migration-import``. Vedi :ref:`account-provider`.

source: Furthermore, the following accounts are ignored by the migration procedure because they are already provided by Active Directory:
it: Inoltre i seguenti account vengono ignorati dalla procedura di migrazione perché sono già forniti da Active Directory:

source: Before running |product| in production, some considerations about the network and existing mail client configurations are required: what ports are in use, if SMTPAUTH and TLS are enabled. Refer to :ref:`email_clients` and :ref:`email_policies` sections for more information.
it: Prima di mettere in produzione |product|, è necessario fare qualche valutazione relativa alla rete ed alla configurazione dei client mail esistenti: quali porte siano utilizzate, se SMTPAUTH e TLS siano abilitati. Fare riferimento alle sezioni :ref:`email_clients` e :ref:`email_policies` per ulteriori informazioni.

source: In a mail server migration, the source mail server could be on production even after the backup has been done, and email messages continue to be delivered until it is taken down permanently.
it: Nella migrazione di un server di posta, il server di origine può rimanere in produzione anche dopo che il backup è stato eseguito e nuovi messaggi di posta continuano ad essere consegnati finché non viene spento definitivamente.

source: An helper script based on ``rsync`` is provided by package ``nethserver-mail-server``. It runs on the destination host and synchronizes destination mailboxes with the source host: ::
it: Uno script ``rsync`` di aiuto è fornito dal pacchetto ``nethserver-mail-server``. Va eseguito sulla destinazione e serve a sincronizzare le caselle di posta di destinazione con il server di origine: ::

source: The source host at ``IPADDR`` must be accessible by the ``root`` user, through ``ssh`` with public key authentication.
it: Il server di origine con indirizzo ``IPADDR`` deve essere accessibile dall’utente ``root``, mediante ``ssh`` con autenticazione a chiave pubblica.

source: The SSL cipher suite configuration is not migrated automatically because the source system uses a weak cipher suite by default. To migrate it manually, execute the following commands: ::
it: La configurazione di cifratura SSL non verrà migrata automaticamente perché il sistema sorgete adotta di default un sistema di cifrature debole. Per effettuare manualmente la migrazione di tale configurazione andranno eseguiti i seguenti comandi: ::

source: Ibays
it: Ibay

source: The *ibay* concept has been superseded by :ref:`shared_folders-section`. Supported protocols for accessing Shared folders are:
it: Le *ibay* sono state sostituite dalle :ref:`shared_folders-section`. I protocolli supportati per accedere alle Cartelle condivise sono:

source: SFTP, provided by the ``sshd`` daemon
it: SFTP, messo a disposizione dal demone ``sshd``

source: SMB file sharing protocol, typical of Windows networking, implemented by Samba
it: il protocollo di condivisione file SMB, tipico delle infrastrutture Windows, implementato attraverso Samba

source: Read carefully the :ref:`upgrade-shared-folders` section in the :ref:`upgrade-section` chapter, because the connection credentials may change when migrating to |product| |version|.
it: Leggere attentamente la sezione :ref:`upgrade-shared-folders` del capitolo :ref:`upgrade-section`, le credenziali per la connessione potrebbero variare a seguito dell'upgrade a |product| |version|.

source: Starting from |product| |version|, Shared folders are not configurable for HTTP access. After ``migration-import`` event, old ibays could be migrated according to the following rules of thumb:
it: A partire da |product| |version|, le Cartelle condivise non possono più essere esposte via HTTP. Successivamente all'evento ``migration-import`` le vecchie ibay potranno essere migrate rispettando le seguenti regole generali:

source: If the ibay was a **virtual host**, install the "Web server" module from the :guilabel:`Software center` page. Copy the ibay contents to the virtual host root directory. Refer to :ref:`virtual_hosts-section`.
it: Se l'ibay aveva un **virtual host** associato, si dovrà installare il modulo "Web server" dalla pagina :guilabel:`Software center`. Sarà poi necessario copiare il contenuto della ibay nella directory root del virtual host. Fare riferimento a :ref:`virtual_hosts-section`.

source: If the ibay access was restricted with a **secret password** (for instance, to share contents with a group of people across the internet), the :ref:`virtual_hosts-section` page still offers the same feature. Also the :ref:`Nextcloud <nextcloud-section>` module could be a good replacement.
it: Se l'accesso alla ibay era limitato da una **password** (ad esempio per condividere i contenuti con un gruppo di persone attraverso internet), sarà possibile replicare questa configurazione dalla pagina :ref:`virtual_hosts-section` . E' anche possibile pensare di sostituire la ibay utilizzata in questa configurazione con il modulo :ref:`Nextcloud <nextcloud-section>`.

source: If the ibay contents were accessible with an URL like ``http://<IP>/ibayname`` the easiest procedure to keep it working is moving it to Apache document root: ::
it: Se il contenuto della ibay era accessibile attraverso un URL come ``http://<IP>/ibayname`` il modo più semplice per mantenere la funzionalità sarà quello di spostare il percorso nella radice di Apache: ::

source: After migration, ibays will retain a backward compatibile profile. To take advantage of new features, including Samba Audit, the ibay configuration must be switched to the new profile. From command line execute: ::
it: Dopo la migrazione, le ibay manterranno un profilo retro-compatibile. Per sfruttare le nuove funzionalità, incluso Samba Audit, la configurazione delle ibay deve essere passata al nuovo profilo. Da riga di comando eseguire: ::

source: Where ``ibay_name`` is the name of the ibay to configure.
it: In cui ``ibay_name`` è il nome della ibay da configurare.

source: Migration from backup
it: Migrazione da backup

source: In the source host, create a full backup archive and move it to the destination host.
it: Sulla macchina origine, effettuare un backup completo e spostarlo sul server destinazione.

source: In the destination host, install all packages that cover the same features of the source.
it: Sul server destinazione, installare tutti i moduli che implementano i servizi presenti sulla macchina origine.

source: Explode the full backup archive into some directory; for instance, create the directory :file:`/var/lib/migration`.
it: Estrarre il backup in una directory; per esempio, creare la directory :file:`/var/lib/migration`.

source: In destination host, signal the event ``migration-import``::
it: Scatenare l'evento ``migration-import`` nell'host di destinazione::

source: This step will require some time.
it: Questa operazione potrebbe richiedere molti minuti.

source: Check for any error message in :file:`/var/log/messages`::
it: Consultare il log di sistema file:`/var/log/messages` ed assicurarsi che non si siano verificati errori: ::

source: Migration with rsync
it: Migrazione con rsync

source: The process is much faster than migrating from a backup.
it: Questa procedura è più rapida rispetto a quella effettuata a partire da un backup.

source: Before starting make sure to have:
it: Prima di iniziare assicurarsi di avere:

source: a running NethService/SME installation, we will call it original server or source server
it: una installazione NethService/SME attiva, che chiameremo server origine o server sorgente

source: a running |product| 7 installation with at least the same disk space of the source server, we will call it destination server
it: una installazione di |product| 7 attiva con a disposizione lo stesso spazio su disco del server sorgente, che chiameremo server destinazione

source: a working network connection between the two severs
it: una connessione di rete attiva tra i due server

source: Please also make sure the source server allows root login via SSH key and password.
it: Assicurarsi che il server sorgente consenta il login all'utente root con password ed attraverso una chiave SSH.

source: Sync files
it: Sincronizzazione dei file

source: The synchronization script copies all data using rsync over SSH. Files are saved inside :file:`/var/lib/migration` directory. If the destination server doesn't have any SSH keys, the script will also create a pair of RSA keys and copy the public key to the source server. All directories excluded from the backup data will not be synced.
it: Lo script di sincronizzazione copia tutti i dati utilizzando rsync su SSH. I file vengono salvati nel percorso :file:`/var/lib/migration`. Se il server di destinazione non dispone di chiavi SSH, lo script creerà anche una coppia di chiavi RSA e ne copierà la chiave pubblica nel server di origine. Tutte le directory escluse dai dati di backup non verranno sincronizzate.

source: On the target machine, execute the following command: ::
it: Nella macchina di destinazione, eseguire il seguente comando: ::

source: Where
it: In cui

source: ``source_server_name`` is the host name or IP of the original server
it: ``source_server_name`` è il nome host o IP del server origine

source: ``ssh_port`` is the SSH port of the original server (default is 22)
it: ``ssh_port`` è la porta SSH del server origine (la porta di default è la 22)

source: Example: ::
it: Esempio: ::

source: When asked, insert the root password of the source server, make a coffee and wait patiently.
it: Quando richiesto, inserire la password di root del server origine quindi prepararsi un caffè e aspettare con pazienza.

source: The script will not perform any action on the source machine and can be invoked multiple times.
it: Lo script non eseguirà alcuna azione sulla macchina di origine e può essere rilanciato più volte.

source: Sync and migrate
it: Sincronizzazione e migrazione

source: If called with ``-m`` option, ``rsync-migrate`` will execute a final synchronization and upgrade the target machine.
it: Se impartito con l'opzione ``-m``, ``rsync-migrate`` eseguirà una sincronizzazione finale e l'aggiornamento della macchina destinazione.

source: The script will:
it: Lo script si incaricherà di:

source: stop every service on the source machine (except for SSH)
it: fermare ogni servizio sulla macchina origine (ad eccetto di SSH)

source: execute the ``pre-backup`` event on the source machine
it: eseguire l'evento di ``pre-backup`` sulla macchina origine

source: sync all remaining data
it: sincronizzare tutti i dati rimanenti

source: execute the ``migration-import`` event on the destination machine
it: eseguire l'evento ``migration-import`` sulla macchina destinazione

source: At the end, check for any error message in :file:`/var/log/messages`::
it: Al termine della procedura verificare la presenza di eventuali errori in :file:`/var/log/messages`::
