Repository: NethServer/docs
Catalog: administrator-manual/*/locale/*/LC_MESSAGES/phonebook-mysql.po
Languages: es, it

source: Phonebook
es: Directorio telefónico
it: Rubrica Centralizzata

source: The |product| phonebook allows to collect contacts from multiple sources. After collecting the data, the contacts will be accessible in read-only mode from many clients.
es: La agenda telefónica de lproduct| permite recopilar contactos de múltiples fuentes. Después de recopilar los datos, los contactos estarán accesibles en modo de sólo lectura de muchos clientes.
it: La rubrica centralizzata di |product| permette di aggregare i contatti provenienti da più fonti e renderli consultabili in sola lettura dai vari client.

source: You should add or edit any contacts inside the source, not inside the phonebook itself.
es: Debe agregar o editar cualquier contacto dentro de la fuente, no dentro de la propia agenda.
it: L'aggiunta o la modifica dei contatti dovrà essere effettuata alla fonte degli stessi, non direttamente sulla rubrica centralizzata.

source: Synchronization of contacts from various external sources is performed by default every night, the command to force it: ::
es: La sincronización de los contactos de varias fuentes externas se realiza por defecto cada noche, el comando para forzarlo: ::
it: La sincronizzazione dei contatti dalle varie fonti esterne viene eseguita di default tutte le notti, il comando per forzarla ed eventualmente pianificarla più frequentemente è: ::

source: If during synchronizations the data source are unreachable, the phonebook will be empty.
es: Si durante las sincronizaciones la fuente de datos es inaccesible, la agenda estará vacía.
it: Se durante la sincronizzazione i database sorgente non sono raggiungibili, la rubrica centralizzata risulterà vuota.

source: The phonebook is accessible using LDAP, only if enabled, using this base DN: ::
es: La agenda está accesible mediante LDAP, sólo si está habilitada, utilizando este DN base: ::
it: La rubrica centralizzata è accessibile in LDAP, attivandone l'esportazione, impostando come Dominio Base: ::

source: You can import contacts from other source using custom scripts inside: ::
es: Puede importar contactos de otra fuente utilizando scripts personalizados dentro de:
it: E' possibile importare nella rubrica centralizzata i contatti provenienti da altre sorgenti interne e/o esterne al |product|, per questo scopo vengono eseguiti tutti gli script presenti nella directory: ::

source: Custom scripts can be written in any language, but each script must be executable. Example: ::
es: Los scripts personalizados se pueden escribir en cualquier idioma, pero cada script debe ser ejecutable. Ejemplo: ::
it: Gli script personalizzati possono essere scritti in un qualsiasi linguaggio, assicurarsi che ogni script sia eseguibile. Per farlo: ::

source: The ``/usr/share/phonebooks/scripts`` is already part of configuration backup. Inside the ``/usr/share/phonebooks/samples/`` directory, you can find many custom script examples.
es: El ``/usr/share/phonebooks/scripts`` ya forma parte de la copia de seguridad de la configuración. Dentro del directorio ``/usr/share/phonebooks/samples/``, puede encontrar muchos ejemplos de scripts personalizados.
it: La directory ``/usr/share/phonebooks/scripts`` fa parte del backup della configurazione. Nella directory ``/usr/share/phonebooks/samples/`` si trovano degli esempi di script per collegare diversi tipi di sorgenti.

source: If you need to access external databases (Mysql,PostgreSQL), you can create a new ODBC record.
es: Si necesita acceder a bases de datos externas (Mysql, PostgreSQL), puede crear un nuevo registro ODBC.
it: Per sorgenti di dati esterne (Mysql, PostgreSQL) al |product| è possibile creare un record ODBC che permetta il collegamento.

source: ODBC configuration
es: Configuración de ODBC
it: Configurazione ODBC

source: Define the ODBC record describing the database connection
es: Definir el registro ODBC que describe la conexión a la base de datos
it: Definire il record ODBC che descrive la connessione al database

source: Example MySql: ::
es: Ejemplo MySql: ::
it: Esempio MySql: ::

source: Example PostgreSQL ::
es: Ejemplo PostgreSQL: ::
it: Esempio PostgreSQL: ::

source: Example MSSQL ::
es: Ejemplo MSSQL ::
it: Esempio MSSQL: ::

source: Execute:
es: Ejecutar:
it: Eseguire:

source: Test
es: Prueba
it: Testare il funzionamento

source: To test if the configuration is working: ::
es: Para probar si la configuración está funcionando: ::
it: Testare il funzionamento (sintassi: isql -v nomeDSN utente password): ::

source: Then, try to execute a query ::
es: A continuación, intente ejecutar una consulta ::
it: Provare una query su una tabella del database selezionato precedentemente: ::

source: Database details
es: Detalles de la base de datos
it: Dettagli database

source: Display phonebook fields: ::
es: Mostrar los campos de la agenda: ::
it: Per visualizzare i campi della rubrica centralizzata: ::

source: Old web interface
it: Vecchia interfaccia web

source: The configuration page of this module is available only in the old Server Manager.
it: La pagina di configurazione di questo modulo è disponibile solo nel vecchio Server Manager.

source: The web interface allows to enable the import from:
es: La interfaz web permite habilitar la importación desde:
it: L'interfaccia permette di attivare l'importazione dei contatti provenienti da:

source: publicly shared SOGo address book (|product| 6.x only!)
it: rubriche di SOGo condivise pubblicamente (solo per |product| 6.x!)

source: shared contacts from |product_cti|
es: Contactos compartidos de |product_cti|
it: dei contatti condivisi del |product_cti|

source: speed dial from |product_voice|
es: Marcación rápida de |product_voice|
it: dei Numeri Brevi di |product_voice|
