Repository: NethServer/docs
Catalog: administrator-manual/*/locale/*/LC_MESSAGES/pop3_proxy.po
Languages: it

source: POP3 proxy
it: Proxy POP3

source: The configuration page of this module is available only in the old Server Manager and will not be ported to the new one.
it: La pagina di configurazione di questo modulo è disponibile sono nel vecchio Server Manager e non verrà portata nel nuovo.

source: Since |product| 7.5.1804 new :ref:`email-section`, :ref:`pop3_connector-section` and :ref:`pop3_proxy-section` installations are based on the Rspamd filter engine. Previous |product| installations are automatically upgraded to Rspamd as described in :ref:`email2-section`
it: Con il rilascio di |product| 7.5.1804 le nuove installazioni di :ref:`email-section`, :ref:`pop3_connector-section` e :ref:`pop3_proxy-section` sono basate sul motore di filtraggio Rspamd. Le precedenti installazioni di |product| verranno automaticamente aggiornate a Rspamd come descritto nella sezione :ref:`email2-section`

source: A user on the LAN can configure an email client in order to connect to an external POP3 server and download mail messages. Please note that fetched mail could contain viruses that may infect computer on the network.
it: Un utente della LAN potrebbe configurare il proprio client di posta al fine di collegarsi ad un server POP3 esterno, per scaricare i propri messaggi. La posta scaricata potrebbe però contenere virus che potrebbero infettare il computer eludendo ogni controllo da parte del server.

source: The POP3 proxy intercepts connection to external servers on port 110, then it scans all incoming email, in order to block viruses and tag spam. The process is absolutely transparent to mail clients. The user will believe that they are connected directly to the provider's POP3 server, but the proxy will intercept all traffic and handle the connection to the server.
it: Il proxy POP3 intercetta le connessioni ai server esterni sulla porta 110, scansionando tutte le mail in entrata, in modo da bloccare i virus ed etichettare lo spam. Per i client di posta il processo è assolutamente trasparente: l’utente crederà di collegarsi direttamente al server POP3 del proprio provider, mentre il proxy intercetterà tutto il traffico effettuando la connessione al server esterno.

source: It's possible to selectively activate the following controls:
it: E’ possibile attivare selettivamente i seguenti controlli:

source: antivirus: messages containing virus are rejected and a notification email is sent to the user
it: antivirus: i messaggi contenenti virus vengono rifiutati ed una mail di notifica è inviata al destinatario

source: spam: messages will be marked with the appropriate antispam scores
it: spam: i messaggi verranno marcati con gli opportuni punteggi antispam

source: The proxy can also intercept POP3s connections on port 995. The proxy will establish a secure connection to the external server, but data exchange with LAN client will be in the clear text.
it: Il proxy può anche intercettare connessioni POP3s sulla porta 995. Il proxy stabilirà una connessione sicura al server esterno, ma lo scambio di dati con i client LAN avverrà in chiaro.

source: Mail clients must be configured to connect to port 995 and will have to turn off encryption.
it: I client dovranno essere configurati per collegarsi alla porta 995 con la cifratura disattivata.
