Repository: NethServer/docs
Catalog: administrator-manual/*/locale/*/LC_MESSAGES/proxy_pass.po
Languages: es

source: Reverse proxy
es: Proxy inverso

source: The :index:`reverse proxy` feature is useful when you want to access internal sites from the outside network.
es: La característica :index:`proxy inverso` es útil cuando se desea acceder a sitios internos desde la red externa.

source: Typical scenario:
es: Escenario típico

source: |product| is the firewall of your LAN
es: |product| es el cortafuegos de su LAN

source: You have a domain http://mydomain.com
es: Usted tiene un dominio http://mydomain.com

source: You would like http://mydomain.com/mysite to forward to the internal server (internal IP: 192.168.2.100)
es: Usted desea que http://mydomain.com/mysite reenvíe al servidor interno (IP interno: 192.168.2.100)

source: In this scenario create a new record under :guilabel:`Reverse proxy` page. Set the :guilabel:`Name` of the item to ``mysite`` and the :guilabel:`Target URL` to ``http://192.168.2.100``.
es: En este escenario, cree un nuevo registro en la página :guilabel:`Proxy inverso`. Configure el :guilabel:`Nombre` del elemento a ``mysite`` y el :guilabel:`URL de destino` a ``http://192.168.2.100``.

source: If only encrypted connections are allowed, enable the :guilabel:`Require SSL encrypted connection`.
es: Si sólo se permiten las conexiones cifradas, habilite :guilabel:`Requiere conexión cifrada SSL`.

source: Only clients from certain networks can be allowed to connect, by specifying a comma-separated list of CIDR networks under the :guilabel:`Access from CIDR networks` field.
es: Sólo se puede permitir que los clientes de determinadas redes se conecten, especificando una lista separada por comas de las redes CIDR bajo el campo :guilabel:`Acceso desde las redes CIDR`.

source: Manual configuration
es: Configuración manual

source: If :guilabel:`Reverse proxy` page is not enough, you can always configure Apache manually, by creating a new file inside :file:`/etc/httpd/conf.d/` directory.
es: Si la página :guilabel:`Proxy inverso` no es suficiente, siempre se puede configurar Apache manualmente, mediante la creación de un nuevo archivo dentro del directorio :file:`/etc/httpd/conf.d/`.

source: **Example**
es: **Ejemplo**

source: Create :file:`/etc/httpd/conf.d/myproxypass.conf` file with this content: ::
es: Crear archivo :file:`/etc/httpd/conf.d/myproxypass.conf` con este contenido: ::

source: Please refer to official Apache documentation for more information: http://httpd.apache.org/docs/2.2/mod/mod_proxy.html
es: Consulte la documentación oficial de Apache para obtener más información: http://httpd.apache.org/docs/2.2/mod/mod_proxy.html
