Repository: NethServer/docs
Catalog: administrator-manual/*/locale/*/LC_MESSAGES/registration.po
Languages: es, it

source: Registration
es: Registro
it: Registrazione

source: |product| offers the possibility to control the critical operating parameters using the :dfn:`Operation Center`, which is accessible at |register_link|. First, each |product| must be registered to access software repositories, support services and enable monitoring tools:
it: |product| offre la possibilità di controllare i parametri operativi critici utilizzando l' :dfn:`Operation Center`, accessibile al link |register_link|. E' necessario che ogni |product| sia registrato per accedere ai repository software, servizi di supporto ed abilitare gli strumenti di monitoraggio:

source: Open :guilabel:`Registration` page from the old Server Manager (``https://<server_name>:980``) or from the new one (``https://<server_name>:9090``)
it: Aprirle la pagina :guilabel:`Registrazione` del vecchio Server Manager (``https://<server_name>:980``) o dal nuovo (``https://<server_name>:9090``)

source: Login to |register_link|
it: Autenticarsi a |register_link|

source: Click on :guilabel:`Create new server` from the Server Manager, or access the :guilabel:`Server` page inside |register_link|, click the :guilabel:`+` symbol under the :guilabel:`New server` section
it: Fare clic su :guilabel:`Crea nuovo server` dal Server Manager o accedere alla pagina :guilabel:`Server` all'interno di |register_link| e fare clic sul simbolo :guilabel:`+` nella sezione :guilabel:`Nuovo server`

source: Choose a name for the server and select an existing customer
it: Scegliere un nome per il server e selezionare un cliente esistente

source: Copy and paste the code inside the :guilabel:`authentication token` field
it: Copiare e incollare il codice all'interno del campo :guilabel:`token di autenticazione`

source: Click on :guilabel:`Register now` button
it: Cliccare sul bottone `Registra ora`

source: At the end you will be able to :ref:`install additional software <package_manager-section>`.
es: Al final podrás :ref:`instalar software adicional <package_manager-section>`.
it: Al termine sarà possibile :ref:`installare il software aggiuntivo <package_manager-section>`.

source: Run :ref:`software update <software-updates-section>` immediately after registration to get new features and security fixes!
es: Ejecutar :ref:`actualización de software <software-updates-section>` inmediatamente después del registro para obtener nuevas características y arreglos de seguridad!
it: Eseguire :ref:`l'aggiornamento del sistema <software-updates-section>` immediatamente dopo aver terminato la procedura di registrazione per installare le nuove funzionalità e i fix di sicurezza!

source: The installation of additional software from the web interface is only allowed exclusively to the reseller credentials holders. The use of :command:`yum` from the command line allows you to get around this limitation. Therefore, do not hand over the password :dfn:`root` end user.
es: La instalación de software adicional desde la interfaz web sólo se permite exclusivamente a los titulares de credenciales de revendedor. El uso de :command:`yum` desde la línea de comandos le permite superar esta limitación. Por lo tanto, no entregue la contraseña de usuario final :dfn:`root`.
it: L'installazione di software aggiuntivo dall'interfaccia web è permessa esclusivamente solo ai possessori delle credenziali rivenditore. L'utilizzo di :command:`yum` da linea di comando permette di aggirare questa limitazione. Pertanto si sconsiglia di consegnare la password di :dfn:`root` all'utente finale.

source: ￼ The :dfn:`system id` uniquely identify the server and it is reported inside the details page of each server. There are also two special buttons :guilabel:`Free key` and :guilabel:`Delete server`.
it: ￼ Il :dfn:`system id` identifica in modo univoco il server e viene riportato all'interno della pagina dei dettagli di ciascun server. Ci sono anche due pulsanti speciali :guilabel:`Libera chiave` ed :guilabel:`Elimina server`.

source: The :guilabel:`Free key` button allows another server to reuse the key during the registration process. It's used in case you need to re-install the server for maintenance.
es: A través del botón :guilabel:`Liberar llave` es posible registrar el servidor recién restaurado con la misma llave que tenía antes de la restauración, sin tener que cambiar a otra.
it: Il pulsante :guilabel:`Libera Chiave` serve per permettere ad un altro server di registrarsi con una chiave già utilizzata, il suo utilizzo tipico è in caso di reinstallazione. Può capitare che sia necessario reinstallare il server per sostituire dell'hardware o per installare una versione più recente.

source: The :guilabel:`Delete server` button will remove the server from the Operation Center. It's useful to remove old server or unused ones.
es: El botón :guilabel:`Eliminar servidor` eliminará el servidor del Centro de operaciones. Es útil para eliminar un servidor antiguo o no utilizado.
it: Il pulsante :guilabel:`Elimina Server` serve per eliminare dal Centro Servizi Nethesis i server non più utilizzati o erroneamente creati.

source: Recover an authentication token
it: Recupero token di autenticazione

source: Access the :guilabel:`Server` page, select the server, then click on the :guilabel:`Show token` button on the right, just below the system id.￼ ￼
it: Accedere alla pagina :guilabel:`Server` elezionare il server, quindi fare clic sul bottone :guilabel:`Mostra token` sulla destra, appena sotto il system id.￼ ￼

source: |product| offers the possibility to control the critical operating parameters using the :dfn:`Operation Center`, which is accessible by login at |register_link|. First, for each |product| installed, you must :index:`register` the machine to allow proper server identification during the communication with the web console.
es: |product| ofrece la posibilidad de controlar los parámetros críticos de funcionamiento utilizando el :dfn:`Centro de operaciones`, que es accesible mediante inicio de sesión en |register_link|. En primer lugar, por cada |product| instalado, debe :index:`registrar` la máquina para permitir la correcta identificación del servidor durante la comunicación con la consola web.

source: Access the Server Manager (``https://server:980``), then click on :guilabel:`Software center` and follow the wizard:
es: Acceda al Administrador del servidor (``https://server:980``), luego haga clic en :guilabel:`Centro de software` y siga el asistente:

source: Please enter the reseller credentials used in the Operation Center |register_link|
es: Introduzca las credenciales de distribuidor utilizadas en el Centro de operaciones |register_link|

source: Select an existing server or choose the creation of new one
es: Seleccione un servidor existente o elija la creación de uno nuevo

source: When creating make sure you enter a name that will help identify the server. You should also enter a description
es: Al crearlo asegúrese de introducir un nombre que le ayude a identificar el servidor. También debe introducir una descripción

source: Associate an existing customer to the new server, or fill in the fields for the creation of new customer
es: Asocie un cliente existente al nuevo servidor, o rellene los campos para la creación de nuevos clientes

source: Confirm your entries to finish the registration process
es: Confirme sus entradas para finalizar el proceso de registro

source: The :dfn:`server key` allows to uniquely identify the server inside the Operation Center |register_link|. Inside the details page of each server, there are two special buttons :guilabel:`Free key` and :guilabel:`Delete server`.
es: El comando :dfn:`server key` permite identificar de forma única el servidor dentro del Centro de Operaciones |register_link|. Dentro de la página de detalles de cada servidor, hay dos botones especiales :guilabel:`Free key` y :guilabel:`Eliminar servidor`.

source: :index:`Delete server`
es: :index:`Eliminar servidor`
