Repository: NethServer/docs
Catalog: administrator-manual/*/locale/*/LC_MESSAGES/report.po
Languages: es, it

source: Report
es: Reporte

source: This module manages the configuration of `Dante <https://github.com/nethesis/dante/>`_.
es: Este modulo administra la configuracion de `Dante <https://github.com/nethesis/dante/>`_.
it: Questo modulo gestisce la configurazione di `Dante <https://github.com/nethesis/dante/>`_.

source: Dante collects data from logs, databases and services, aggregates and displays them on a report structured as a customizable dashboard. The report can be sent via e-mail, with configurable scheduling and recipients.
es: Dante recolecta datos de logs, bases de datos y sevicios, los acumula y despliega en un reporte estructurado en un tablero personalizable. El reporte puede ser enviado por correo electronico, con configuracion para enviarlos periodicidad y distintos receptores.
it: Dante raccoglie dati da registri, database e servizi, li aggrega e li visualizza in un report strutturato come una dashboard personalizzabile. Il report può essere inviato via e-mail, con pianificazione e destinatari configurabili.

source: Dashboard
es: Tablero

source: The *Dashboard* page is composed by a set of widgets, each showing a piece of information on the system. The user can customize the layout of the dashboard by adding, removing, resizing and drag & dropping widgets.
es: La pagina de *Dashboard* esta compuesta de un set heramientas, cada una mostrando una parte de informacion del sistema. El usuario puede personalizar la dispocision del tablero agregando, y removiendo, decimiencionado y arrastrando y tirando herramientas.
it: La pagina *Dashboard* è composta da una serie di widget, ognuno dei quali mostra un'informazione sul sistema. L'utente può personalizzare il layout della dashboard aggiungendo, rimuovendo, ridimensionando e trascinando i widget.

source: The types of widgets currently supported are:
es: El tipo de herramientas soportados actualmente son:
it: I tipi di widget attualmente supportati sono:

source: **Chart**: pie, bar, line or area charts
es: **Chart**: torta, barras, linea o graficas de area.
it: **Grafico**: grafici a torta, a barre, a linee o ad area

source: **Counter**: a card that displays an aggregated numerical value and a trend on a time interval
es: **Counter**: una tarjeta que muestra un valor sumarizado y una tendencia en un intervalo de tiempo.
it: **Contatore**: una card che mostra un valore numerico aggregato e una tendenza in un intervallo di tempo

source: **Table**: a table with optional row and column headers
es: **Table**: una tabla con opciones de filas y columnas
it: **Tabella**: una tabella con intestazioni di riga e colonna opzionali

source: **Ranking**: a list of the top N items, ordered by their value
es: **Ranking**: una lista de los N items mejor posicionados, ordenados por su valor.
it: **Rancking**: un elenco dei primi N elementi, ordinati in base al loro valore

source: **Label**: a text showing a piece of information
es: **Label**: un texto mostrando una pieza de informacion
it: **Etichetta**: un testo che mostra un'informazione

source: **Title**: a simple text typed by the user to organize the layout of the dashboard
es: **Title**: un texto simple escrito por el usuario para organizar la distribucion del tablero.
it: **Titolo**: un semplice testo digitato dall'utente per organizzare il layout della dashboard

source: Settings
es: Configuracion
it: Impostazioni

source: The *Settings* page manages the configuration of the module.
es: La pagina de *Settings* administra toda la configuracion del modulo.
it: La pagina *Impostazioni* gestisce la configurazione del modulo.

source: Host configuration
es: Configuracion de equipo
it: Configurazione host

source: **Public host**: this is the hostname where the report is hosted. It must be a name that can be resolved from the internet
es: **Public host**: este el nombre del equipo donde el reporte esta alojado. Debe ser un nombre que se pueda resolver de internet.
it: **Host pubblico**: questo è il nome dell'host che ospita il report. Deve essere un nome che può essere risolto da Internet

source: **Final url**: this field displays the public URL where the report is hosted
es: **Final url**: este campo muesta la URL publica donde el reporte esta publicado
it: **URL finale**: questo campo visualizza l'URL pubblico in cui è ospitato il report

source: Report configuration
es: Configuracion de Reportes
it: Configurazione report

source: **Theme**: the themes available for the dashboard are *light* and *dark*
es: **Theme**: los temas que estan disponibles para el tablero son *light* y *dark*
it: **Tema**: i temi disponibili per la dashboard sono *chiaro* e *scuro*

source: **Palette**: there are 9 color palettes to choose from
es: **Palette**: hay una paleta de 9 colores para elegir
it: **Tavolozza**: ci sono 9 tavolozze di colori tra cui scegliere

source: **Interval**: time interval on which the data are aggregated. It can be *Week*, *Month* or *Six-months*
es: **Interval**: tiempo del intervalo en el cual los datos son consolidados. Puede ser *Week*, *Month* o *Six-months*
it: **Intervallo**: intervallo di tempo su cui vengono aggregati i dati. Può essere *Settimana*, *Mese* o *Sei mesi*

source: **Language**: language used to display the report
es: **Language**: Idioma con el que se va mostrar el reporte
it: **Lingua**: lingua utilizzata per visualizzare il report

source: **Anonymization**: boolean flag that controls the anonymization of sensible data in the report
es: **Anonymization**: bandera booleana que controla la anonimizacion de la informacion sensible en el reporte
it: **Anonimizzazione**: opzione che controlla l'anonimizzazione dei dati sensibili nel report

source: **Max Entries**: maximum number of items to display on ranking widgets
es: **Max Entries**: numero maximo de items a deplegar en la clasificacion de herramientas.
it: **Numero massimo di voci**: numero massimo di elementi da visualizzare nei widget di tipo ranking

source: **Addresses**: configuration of report e-mail recipients and scheduling of e-mail dispatch
es: **Addresses**: configuracion de los e-mails que recibiran el reporte, y el calendario de envio de los mismos.
it: **Indirizzi**: configurazione dei destinatari e-mail e programmazione della spedizione via e-mail del report

source: Test mail
es: Probar mail

source: **Address**: e-mail recipient of the test e-mail containing the report
es: **Address**: direccion de e-mail del correo de pruebas conteniendo el reporte.
it: **Indirizzo**: e-mail del destinatario dell'e-mail di prova contenente il report

source: **Include configured addresses**: boolean flag to control whether the test e-mail should be sent to the addresses configured in *Report configuration* in addition to *Address*
es: **Include configured addresses**: bandera booleana que controla si el e-mail de prueba se debe enviar al resto de las direcciones de correo configuradas en *Report configuration*Â ademas de a *Address*
it: **Includi indirizzi configurati**: opzione per controllare se l'e-mail di prova deve essere inviata anche agli altri indirizzi configurati in *Configurazione rapporto* oltre che all'*Indirizzo* specificato
