Repository: NethServer/docs
Catalog: administrator-manual/*/locale/*/LC_MESSAGES/statistics.po
Languages: es, it

source: Statistics (collectd)
es: Estadísticas (collectd)
it: Statistiche (collectd)

source: :index:`Collectd` is a daemon which collects system performance :index:`statistics` periodically and stores them in RRD files. Statistics will be displayed inside a web interface called
es: :index:`Collectd` es un demonio que recopila el rendimiento del sistema :index:`estadísticas` periódicamente y los almacena en archivos RRD. Las estadísticas se mostrarán dentro de una interfaz web llamada

source: Collectd Graph Panel (CGP), package *nethserver-cgp*
es: Panel de gráficos Collectd (CGP), paquete *nethserver-cgp*

source: The web interface can be accessed from the :guilabel:`Graphs`.
es: La interfaz web se puede acceder desde :guilabel:`Gráficos`.

source: After installation, the system will gather following statistics:
es: Después de la instalación, el sistema reunirá las siguientes estadísticas:
it: Al termine dell’installazione, il sistema collezionerà le seguenti informazioni:

source: CPU usage
es: uso de CPU
it: utilizzo CPU

source: system load
es: carga del sistema
it: carico di sistema

source: number of processes
es: número de procesos
it: numero di processi

source: RAM memory usage
es: Uso de la memoria RAM
it: utilizzo memoria RAM

source: virtual memory (swap) usage
es: uso de memoria virtual (swap)
it: utilizzo memoria virtuale (swap)

source: system uptime
es: tiempo de actividad del sistema
it: tempo di accensione

source: disk space usage
es: uso del espacio en disco
it: utilizzo spazio su disco

source: disk read and write operations
es: operaciones de lectura y escritura de disco
it: operazioni di lettura e scrittura su disco

source: network interfaces
es: interfaces de red
it: interfacce di rete

source: :index:`network latency`
es: :index:`latencia de la red`
it: :index:`latenza di rete`

source: For each check, the web interface will display a graph containing last collected value and also minimum, maximum and average values.
es: Para cada comprobación, la interfaz web mostrará un gráfico que contiene el último valor recopilado y también valores mínimos, máximos y medios.
it: Per ciascun controllo, l’interfaccia mostra un grafico che contiene sia l’ultimo valore raccolto, sia i valori minimi, massimi e medi.

source: Network latency
es: Latencia de conexion
it: Latenza di rete

source: The :index:`ping` plugin measure the network latency. At regular intervals, it sends a ping to the configured upstream DNS. If the multi WAN module is configured, any enabled provider is also checked.
es: El complemento :index:`ping` mide la latencia de la red. A intervalos regulares, envía un ping al DNS configurado arriba. Si el módulo WAN múltiple está configurado, también se comprueba cualquier proveedor habilitado.
it: Il plugin :index:`ping` misura la latenza di rete. Ad intervalli regolari, collectd invia un ping al DNS configurato. Se la multi WAN è attiva, anche tutti i provider abilitati verranno controllati.

source: Additional hosts could be monitored (i.e. a web server) using a comma separated list of hosts inside the ``PingHosts`` property.
es: Los hosts adicionales podrían ser monitoreados (es decir, un servidor web) usando una lista de hosts separados por comas dentro de la propiedad ``PingHosts``.
it: Host aggiuntivi possono essere monitorati (es. server web) usando una lista separata da virgole all’interno della proprietà ``PingHosts``.

source: Example: ::
es: Ejemplo: ::
it: Esempio: ::

source: :index:`Collectd` is a daemon which collects system performance :index:`statistics` periodically and stores them in RRD files. Statistics will be displayed inside a web interface called Collectd Graph Panel (CGP).
it: :index:`Collectd` è un software che raccoglie periodicamente :index:`statistiche` sulle performance del sistema e le salva in speciali file RRD. Le statistiche sono quindi consultabili attraverso l’interfaccia web Collectd Graph Panel (CGP).

source: CGP is accessible on a random URL generated on first install, something like ``https://myserver.nethserver.org:980/02bf3f8364beea0d5f23044bf14d31d93f63e98d``. The URL is available from the Server Manager inside the :menuselection:`Applications` page. Click the :guilabel:`Open` button of :guilabel:`Collectd Charts` application.
it: CGP è accessibile tramite un URL casuale generato alla prima installazione, qualcosa simile a ``https://myserver.nethserver.org:980/02bf3f8364beea0d5f23044bf14d31d93f63e98d``. L'URL è disponibile dal Server Manager, all'interno della pagina :menuselection:`Applicazioni`. Fare clic sul pulsante :guilabel:`Apri` dell'applicazione :guilabel:`Collectd Charts`.

source: From the old Server Manager, the web interface can be accessed using the :guilabel:`Graphs` section.
it: Dal vecchio Server Manager, è possibile accedere all'interfaccia web utilizzando la sezione :guilabel:`Grafici`.
