Repository: NethServer/docs
Catalog: administrator-manual/*/locale/*/LC_MESSAGES/subscription.po
Languages: it

source: A |product| installation can be registered to a public or private Dartagnan [#Dartagnan]_ instance, getting access to monitoring portal and stable update repositories.
it: Una installazione di |product| può essere registrata su un'istanza pubblica o privata Dartagnan [#Dartagnan]_, ottenendo l'accesso al portale di monitoraggio ed ai repository di aggiornamento stabili.

source: The |product| Subscription by Nethesis [#Nethesis]_ enables access to a public ready-to-use Dartagnan instance, along with immediate professional support services for your |product| deployments. Detailed info available at https://my.nethserver.com
it: La |product| Subscription di Nethesis [#Nethesis]_ consente l'accesso a un'istanza Dartagnan pubblica pronta all'uso, insieme a servizi di supporto professionale immediati per le proprie implementazioni di |product|. Per piu informazioni https://my.nethserver.com

source: Activating a subscription will enable the stable YUM repositories, but will disable any other repositories you may have added. You can re-enable any other repository by setting the ``ExtraRepositories`` property from the command line. The property accepts a comma-separated list of repository names and it is case sensitive. Example: ::
it: L'attivazione di una subscription abiliterà i repository YUM stabili, ma disabiliterà tutti gli eventuali altri repository aggiuntivi. È possibile riattivare qualsiasi altro repository impostando la proprietà ``ExtraRepositories`` tramite riga di comando. La proprietà accetta un elenco separato da virgole di nomi di repository e fa distinzione tra maiuscolo e minuscolo. Esempio: ::

source: The subscription provider may not accept support requests for the contents of custom repositories.
it: Il fornitore dell'abbonamento potrebbe non accettare richieste di supporto per i contenuti dei repository personalizzati.

source: Registering the system
it: Registrando il sistema

source: Access :guilabel:`Subscription` page from the old or new Server Manager
it: Accedere alla pagina :guilabel:`Subscription` dal vecchio o dal nuovo Server Manager

source: Click on :guilabel:`Subscribe`
it: Cliccare su :guilabel:`Sottoscrivi`

source: Login or register to https://my.nethserver.com to obtain a registration code
it: Accedere o registrarsi su https://my.nethserver.com per ottenere un codice di registrazione

source: Copy and paste the code inside the :guilabel:`Registration token` field
it: Copiare e incollare il codice all'interno del campo :guilabel:`Registrazione token`

source: Click on :guilabel:`Register now` button
it: Cliccare su bottone :guilabel:`Registra ora`

source: At the end, the subscription plan name and validity are reported inside the page. Monitoring and access to stable repositories are automatically enabled.
it: Al termine della procedura, il nome e la validità del piano di abbonamento sottoscritto saranno riportati all'interno della pagina. Il monitoraggio e l'accesso ai repository stabili saranno automaticamente abilitati.

source: Dartagnan documentation: https://nethesis.github.io/dartagnan/
it: Documentazione Dartagnan: https://nethesis.github.io/dartagnan/

source: Nethesis official site: http://www.nethesis.it
it: Sito ufficiale Nethesis: http://www.nethesis.it

source: Removing a subscription
it: Rimozione di una subscription

source: When the subscription expires, or at the end of a trial period, use the following command to revert any modification to repositories and access the community ones: ::
it: Alla scadenza dell'abbonamento o alla fine di un periodo di prova, utilizzare il seguente comando per annullare qualsiasi modifica ai repository e accedere a quelli della community: ::

source: If you have installed the `new server manager` AKA `cockpit`, you can unsubscribe the machine in the `Subscription` page, clicking on **Unsubscribe** button.
it: Se è stato installato il `nuovo server manager`, noto anche come `cockpit`, è possibile rimuovere la licenza della macchina dalla pagina `Subscription`. cliccando sul pulsante **Unsubscribe**.

source: Refer to :ref:`software-updates-section` for more information about the community updates origin.
it: Fare riferimento a :ref:`software-updates-section` per ulteriori informazioni sull'origine degli aggiornamenti della community.
