Repository: NethServer/docs
Catalog: administrator-manual/*/locale/*/LC_MESSAGES/team_chat.po
Languages: it

source: The :index:`team chat` module installs Mattermost Team Edition platform inside |product|.
it: Il modulo :index:`team chat` installa la piattaforma Mattermost Team Edition all'interno di |product|.

source: Mattermost is an Open Source, private cloud :index:`Slack`-alternative. Check out the excellent official documentation: https://docs.mattermost.com/.
it: Mattermost è un cloud privato Open Source :index:`Slack`-alternative. L'eccellente documentazione ufficiale del progetto è disponibile qui: https://docs.mattermost.com/.

source: Configuration
it: Configurazione

source: Mattermost installation needs a dedicated virtual host, an FQDN like ``chat.nethserver.org``.
it: L'installazione di Mattermost richiede un virtual host dedicato, un FQDN come ``chat.nethserver.org``.

source: Before proceeding with the configuration, make sure to create the corresponding DNS record. If |product| act as the DNS server of your LAN, please refer to :ref:`dns-section`.
it: Prima di procedere con la configurazione, assicurarsi di aver creato il record DNS corrispondente. Se |product| svolge il ruolo di server DNS della LAN, fare riferimento alla sezione :ref:`dns-section`.

source: If your server is using a Let's Encrypt certificate as default, make also sure to have a corresponding public DNS record. See :ref:`server_certificate-section` for more info.
it: Se il server utilizza il certificato Let's Encrypt come predefinito, assicurarsi anche di avere un record DNS pubblico corrispondente. Vedi :ref:`server_certificate-section` per maggiori informazioni.

source: Please note that the mobile app **cannot connect to servers with self-signed certificates**!
it: Si tenga presente che l'applicazione per smartphone **non può connettersi a server che utilizzano certificati auto-firmati**!

source: How to configure:
it: Come configurare:

source: Click on :guilabel:`Settings` button of :menuselection:`Applications > Mattermost`
it: Fare click sul pulsante :guilabel:`Impostazioni` di :menuselection:`Applicazioni > Mattermost`

source: Check :guilabel:`Enable Mattermost Team Edition`, then enter a valid FQDN inside :guilabel:`Virtual host name` field (eg. ``chat.nethserver.org``)
it: Spuntare l'opzione :guilabel:`Abilita Mattermost Team Edition`, quindi inserire un FQDN valido nel campo :guilabel:`Nome virtual host` (ad esempio ``chat.nethserver.org``)

source: Open the entered host name inside the browser, eg: ``https://chat.nethserver.org``. At first access, a wizard will create the administrator user
it: Accedere al nome DNS indicato attraverso il browser, ad esempio ``https://chat.nethserver.org``. Al primo accesso una procedura guidata creerà l'utente amministratore

source: The following features are enabled by default:
it: Le seguenti funzionalità sono abilitate di default:

source: mail notifications
it: notifiche mail

source: push notifications for mobile apps
it: notifiche push per le app mobile

source: redirect from HTTP to HTTPS
it: redirect da HTTP ad HTTPS

source: Authentication
it: Autenticazione

source: Mattermost authentication is *not* integrated with any Account Provider. The Mattermost administrator should take care of users and teams creation.
it: L'autenticazione per Mattermost *non* è integrata con alcun Account Provider. L'amministratore di Mattermost dovrà occuparsi della creazione di utenti e team.

source: The administrator should always use Mattermost wizard to create the admin user, then send team invitation link to each user.
it: L'amministratore deve sempre utilizzare la procedura guidata di Mattermost per creare l'utente amministratore, quindi inviare il link di invito del team a ciascun utente.

source: Importing users
it: Importazione di utenti

source: If the system administrator still needs bulk user creation, he/she can rely on ``mattermost-bulk-user-create`` command.
it: Se l'amministratore di sistema ha ancora bisogno della creazione di massa degli utenti, può usare il comando ``mattermost-bulk-user-create``.

source: The command will:
it: Il comando provvederà a:

source: create a default team named as the Company from :guilabel:`Organization details` page
it: creare il team di default utilizzando il nome dell'azienda definito nella pagina :guilabel:`Organizzazione` page

source: read all users from local or remote Account Providers and create them inside Mattermost
it: leggere tutti gli utenti dall'Account Provider locale o remoto e ri-crearli all'interno di Mattermost

source: Please note that:
it: Si noti che:

source: users disabled in the Server Manager or already existing in Mattermost will be skipped
it: gli utenti disabilitati nel Server Manager o già esistenti in Mattermost saranno omessi

source: a random password will be generated for each user
it: per ogni utente verrà generata una password casuale

source: the first imported user will be set as administrator if no admin has been already created
it: il primo utente importato verrà impostato come amministratore se nessun amministratore è già stato creato

source: Invocation example: ::
it: Esempio di Invocazione: ::

source: Users are not automatically synced inside Mattermost. Each time a user is created or removed, remember to execute ``mattermost-bulk-user-create`` command or manually create the user using Mattermost administration web interface.
it: Gli utenti non vengono automaticamente sincronizzati all'interno di Mattermost. Ogni volta che un utente viene creato o rimosso, è necessario ricordarsi di eseguire il comando ``mattermost-bulk-user-create`` o di creare manualmente l'utente usando l'interfaccia web di amministrazione di Mattermost.

source: Forcing a common default password
it: Forzare una password predefinita comune

source: It's possible to set a default password for each new Mattermost user, just append the default password to command invocation.
it: È possibile impostare una password predefinita per ogni nuovo utente Mattermost, basta aggiungere la password predefinita in fase di esecuzione del comando.

source: Example: ::
it: Esempio: ::
