Repository: NethServer/docs
Catalog: administrator-manual/*/locale/*/LC_MESSAGES/ui.po
Languages: it

source: The :index:`chat` service uses the standard protocol :index:`Jabber`/:index:`XMPP`. See also :ref:`chat-section`.
it: Il servizio :index:`chat` utilizza il protocollo standard :index:`Jabber`/:index:`XMPP`. Vedi anche :ref:`chat-section`.

source: Administration web Interface
it: Interfaccia web di amministrazione

source: The Jaber server comes with a web administrative interface for members of the jabberadmins group.
it: Il server Jabber è dotato di un'interfaccia web amministrativa il cui accesso è consentito ai membri del gruppo jabberadmins.

source: XMPP allows for servers communicating seamlessly with each other, forming a global 'federated' IM network.
it: XMPP consente ai server di intercomunicare tra loro, formando una rete IM globale "federata".

source: File transfer maximum speed
it: Massima velocità trasferimento file

source: Limit in Byte/second the maximum file transfer.
it: Limita la massima velocità per il trasferimento file al valore in Byte/secondo

source: File transfer normal speed
it: Velocità standard di trasferimento file

source: Limit in Byte/second the normal file transfer.
it: Limita la velocità standard per il trasferimento file al valore in Byte/secondo

source: See also :ref:`shared_folders-section`
it: Vedere anche :ref:`shared_folders-section`

source: Workgroup/NetBIOS domain name
it: Workgroup/Nome dominio NetBIOS

source: The value can be changed only with LDAP accounts provider and defines the Windows workgroup name visible from Network neighborhood panel in Windows systems. With Active Directory accounts provider the value is determined by the joined domain
it: Il valore può essere modificato solo con se il provider account è LDAP e definisce il nome del gruppo di lavoro di Windows visibile dal pannello Risorse di rete nei sistemi Windows. Con l'account provider Active Directory il valore è determinato dal dominio a cui il server è attestato

source: When a new file or directory is created in a shared folder
it: Quando un nuovo file o directory viene creato in una cartella condivisa

source: Decide who owns a newly created file or directory: either the resource creator or the current owner of the directory containing the new resource (also known as parent directory)
it: Stabilisce chi possiede un file o una directory appena creati: il creatore della risorsa o il proprietario della directory che contiene la nuova risorsa (nota anche come directory principale)

source: Grant full control on home directories to Domain Admins group (home$ share)
it: Concedere il controllo completo sulle home directory al gruppo Domain Admins (home$ share)

source: Allow members of ``Domain Admins`` group to connect the hidden ``home$`` share and grant them administrative access to any home folder inside of it
it: Permetti ai membri del gruppo ``Domain Admins`` di collegare la condivisione nascosta ``home$`` e concede loro l'accesso amministrativo a qualsiasi cartella home

source: Grant full control on shared folders to Domain Admins group
it: Concede il pieno controllo sulle cartelle condivise al gruppo Domain Admins

source: Allow members of ``Domain Admins`` group to connect any shared folder and grant them administrative access on its content
it: Consente ai membri del gruppo ``Domain Admins`` di connettere qualsiasi cartella condivisa e concedere loro l'accesso amministrativo sul suo contenuto

source: This page configures certain paths and virtual host names under Apache to be served by forwarding the original web request to another URL. See also :ref:`proxy_pass-section`.
it: Questa pagina configura determinati paths e nomi di Virtual Host in Apache per essere offerti inoltrando la richiesta Web originale a un altro URL. Vedi anche :ref:`proxy_pass-section`.

source: Create / Edit
it: Creare /Modificare

source: Name
it: Nome

source: The URL **path name** or the **virtual host name** (an host FQDN). A path name will match URLs like ``http://somehost/<path name>/...``, whilst a virtual host name will match an URL like ``http://<virtual host name>/...``. Matching URLs are forwarded to the :guilabel:`Target URL`.
it: L'URL **path name** o il **virtual host name** (FQDN di un host). Un nome di percorso corrisponderà a URL come ``http://somehost /<path name>/ ...``, mentre un nome di un virtual host corrisponderà a un URL come ``http: //<virtual host name>/ ...``. Gli URL corrispondenti vengono inoltrati a :guilabel:`Target URL`.

source: Access from CIDR networks
it: Accesso dalle reti CIDR

source: Restrict the access from the given list of CIDR networks. Elements must be separated with a "," (comma).
it: Limita l'accesso dall'elenco fornito di reti CIDR. Gli elementi devono essere separati con una "," (virgola).

source: SSL/TLS certificate
it: Certificato SSL / TLS

source: Select a certificate that is compatible with the virtual host name.
it: Seleziona un certificato compatibile con il nome dell virtual host

source: Require SSL encrypted connection
it: Richiede una connessione crittografata SSL

source: If enabled, the URL path or virtual host name can be accessed only with an SSL/TLS connection.
it: Se abilitato, è possibile accedere al percorso dell'URL o al nome dell' virtual host solo con una connessione SSL/TLS.

source: Target URL
it: URL di destinazione

source: The URL where the original request is forwarded. An URL has the form ``<scheme>://<hostname>:<port>/<path>``.
it: L'URL in cui è inoltrata la richiesta originale. L'URL è formato come ``<scheme>://<hostname>:<port>/<path>``.

source: Accept invalid SSL certificate from target
it: Accetta il certificato SSL non valido dalla destinazione

source: If the :guilabel:`Target URL` has the ``https`` scheme, accept its certificate even if it is not valid.
it: Se il :guilabel:`Target URL` ha lo schema ``https``, accetta il suo certificato anche se non è valido.

source: Forward HTTP "Host" header to target
it: Forward HTTP "Host" intestazione a destinazione

source: When enabled, this option will pass the HTTP "Host" header line from the incoming request to the proxied host, instead of the "hostname" specified in the :guilabel:`Target URL` field.
it: Se abilitata, questa opzione passerà l'header "Host" HTTP dalla richiesta in entrata all'host proxy, invece del "hostname" specificato nel campo :guilabel:`Target URL` field.

source: Delete
it: Eliminare

source: Removes the selected entry.
it: Rimuove la voce selezionata.

source: SOGo Groupware
it: Groupware SOGo

source: See also :ref:`SOGo-section`.
it: Vedere anche :ref:`SOGo-section`.

source: Enable CalDAV and CardDAV
it: Abilitazione CalDAV e CardDAV

source: CalDAV allow users to access and share calendar data on a server. CardDAV allows users to access and share contact data on a server.
it: CalDAV consente agli utenti di accedere e condividere i dati del calendario presenti su un server. CardDAV consente agli utenti di accedere e condividere i contatti presenti su un server.

source: Enable Microsoft ActiveSync
it: Abilitazione Microsoft ActiveSync

source: ActiveSync is a mobile data (email, calendar, task, contact) synchronization app developed by Microsoft.
it: ActiveSync è un'app per la sincronizzazione di dati mobili (e-mail, calendario, attività, contatti) sviluppata da Microsoft.

source: Allow Users to add other IMAP accounts
it: Consente agli utenti di aggiungere altri account IMAP

source: Allow users to add other IMAP accounts that will be visible from the SOGo Webmail interface.
it: Consente agli utenti di aggiungere altri account IMAP che saranno visibili dall'interfaccia di SOGo Webmail.

source: Administrators
it: Amministratori

source: List of users with administrative privileges over all the user datas.
it: Elenco degli utenti con privilegi amministrativi su tutti i dati utente.

source: Notifications
it: Notifiche

source: Several different types of notifications(email-based) are available. Activate them according your needs.
it: Sono disponibili diversi tipi di notifiche (basate su email). E' possibile attivarle in base alle proprie esigenze.

source: Make SOGO reachable only from this domain(FQDN)
it: Rende raggiungibile SOGO solo da questo dominio (FQDN)

source: SOGo is per default accessible from all server's virtualhosts, If you specify a domain name here, SOGo will be usable only from this domaine name.
it: SOGo è accessibile per impostazione predefinita da tutti i virtualhost del server, se si specifica qui un nome di dominio, SOGo sarà utilizzabile solo da questo nome di dominio.

source: Number of workers
it: Numero dei processi

source: This is the amount of instances of SOGo that will be spawned to handle multiple requests simultaneously. You should have at least one worker per activesync device connected.
it: Questo parametro specifica il numero di istanze di SOGo che verranno generate per gestire più richieste contemporaneamente. E' consigliato almeno un worker per dispositivo activesync connesso.

source: Maximum time in second
it: Tempo massimo in secondi

source: Parameter used to set the maximum amount of time, in seconds, SOGo will wait before doing an internal check for data changes (add, delete, and update).
it: Parametro utilizzato per impostare la quantità massima di tempo, in secondi, che SOGo attenderà prima di eseguire un controllo interno per le modifiche dei dati (aggiunta, eliminazione e aggiornamento).

source: Enforced security level
it: Livello di sicurezza applicato

source: Configures the system services as described in the :ref:`tlspolicy-section` section
it: Configura i servizi di sistema come descritto nella sezione :ref:`tlspolicy-section`
