Repository: NethServer/docs
Catalog: administrator-manual/*/locale/*/LC_MESSAGES/upgrade.po
Languages: it

source: Please refer to the `Upgrade tool page <https://nethserver.docs.nethesis.it/en/v6/upgrade_tool.html>`_ of |product| 6 Administrator Manual.
it: Fare riferimento alla pagina `Upgrade tool <https://nethserver.docs.nethesis.it/en/v6/upgrade_tool.html>`_ del Manuale Amministratore di |product| 6.
