Repository: NethServer/docs
Catalog: administrator-manual/*/locale/*/LC_MESSAGES/upgrade.po
Languages: it

source: Upgrade from |product| 6
it: Aggiornamento da |product| 6

source: The upgrade from |product| 6 to |product| 7 is obtained by means of three methods:
it: L'aggiornamento da |product| 6 a |product| 7 può essere eseguito utilizzando uno dei tre seguenti metodi:

source: :ref:`backup <upgrade_from_backup-section>` (see also :ref:`disaster-recovery-section`)
it: :ref:`backup <upgrade_from_backup-section>` (vedere anche :ref:`disaster-recovery-section`)

source: Before running the upgrade procedure, read carefully all the sections of this chapter. Please also read :ref:`discontinued-section`.
it: Prima di procedere con l'aggiornamento, leggere attentamente tutte le sezioni di questo documento. Si prega di fare riferimento anche alla sezione :ref:`discontinued-section`.

source: During the whole upgrade process, all network services will be inaccessible.
it: Per l'intera durata del processo di upgrade tutti i servizi di rete saranno inaccessibili.

source: Accounts provider
it: Account provider

source: There are different upgrade scenarios, depending on how the source machine was configured.
it: Esistono differenti scenari di aggiornamento, a seconda di come è configurata la macchina di origine.

source: If the source system was a NT Primary Domain Controller (Samba server role was :guilabel:`Primary Domain Controller` -- PDC) or a standalone file server (role was :guilabel:`Workstation` -- WS), refer to :ref:`pdc-upgrade-section`.
it: In caso di sistema di origine Primary Domain Controller NT (ruolo del server Samba :guilabel:`Primary Domain Controller` -- PDC) o di file server standalone (ruolo :guilabel:`Workstation` -- WS), fare riferimento alla sezione :ref:`pdc-upgrade-section`.

source: If the source system was joined to an Active Directory domain (Samba server role was :guilabel:`Active Directory member` -- ADS), refer to :ref:`ads-upgrade-section`.
it: In caso di sistema origine attestato ad un dominio Active Directory (ruolo server Samba :guilabel:`Active Directory member` -- ADS), fare riferimento alla sezione :ref:`ads-upgrade-section`.

source: In any other case, the LDAP server is upgraded automatically to *local LDAP accounts provider*, preserving existing users, passwords and groups.
it: In tutti gli altri casi il server LDAP viene automaticamente aggiornato a "Account provider LDAP locale", preservando utenti, password e gruppi preesistenti.

source: Primary Domain Controller and Workstation upgrade
it: Aggiornamento Primary Domain Controller e Workstation

source: After the restore procedure, go to :guilabel:`Accounts provider` page and select the :guilabel:`Upgrade to Active Directory` procedure. The button will be available only if network configuration has already been fixed accordingly to the new hardware.
it: Successivamente alla procedura di ripristino, spostarsi nella pagina :guilabel:`Accounts provider` e selezionare la procedura :guilabel:`Upgrade to Active Directory`. Il bottone sarà disponibile unicamente se la configurazione di rete sarà stata adattata al nuovo hardware.

source: The following accounts are ignored by the upgrade procedure because they are already provided by Samba Active Directory:
it: I seguenti account vengono ignorati dalla procedura di aggiornamento perché sono già forniti da Samba Active Directory:

source: An additional, free, IP address from the *green* network is required by the Linux container to run the local Active Directory accounts provider.
it: E' necessario fornire un indirizzo IP, aggiuntivo e libero, della rete *green* al container Linux per attivare l'account provider Active Directory locale.

source: For instance:
it: Ad esempio:

source: server IP (green): ``192.168.98.252``
it: IP server (green): ``192.168.98.252``

source: free additional IP in green network: ``192.168.98.7``
it: IP aggiuntivo e libero della rete green: `192.168.98.7``

source: Ensure there is a working Internet connection:
it: Assicurarsi che sia attiva una connessione internet:

source: For more information about the local Active Directory accounts provider, see :ref:`ad-local-accounts-provider-section`.
it: Per maggiori informazioni relative all'account provider Active Directory locale, fare riferimento alla sezione :ref:`ad-local-accounts-provider-section`.

source: Shared folder connections may require further adjustment.
it: Le connessioni alle cartelle condivise potrebbero richiedere delle modifiche.

source: Read carefully the :ref:`upgrade-shared-folders` section, because the connection credentials may change when upgrading to |product| |version|.
it: Leggere attentamente la sezione :ref:`upgrade-shared-folders`, le credenziali per la connessione potrebbero variare a seguito dell'upgrade a |product| |version|.

source: The upgrade procedure preserves user, group and computer accounts.
it: La procedura di upgrade preserva utenti, gruppi e account dei computer.

source: Users not enabled for Samba in |product| 6 will be migrated as locked users. To enable these locked users, the administrator will have to set a new password.
it: Gli utenti non abilitati per Samba in |product| 6 saranno migrati come utenti bloccati. Per abilitare questi utenti bloccati, l'amministratore dovrà semplicemente impostargli una nuova password.

source: Active Directory member upgrade
it: Aggiornamento membro Active Directory

source: After **restoring the configuration**, join the server to the existing Active Directory domain from the web interface. For more information see :ref:`join-existing-ad-section`.
it: Successivamente al **ripristino della configurazione**, attestare il server ad un dominio Active Directory esistente tramite l'interfaccia web. Per ulteriori informazioni consultare la sezione :ref:`join-existing-ad-section`.

source: At the end, proceed with **data restore**.
it: Al termine, procedere con il **ripristino dei dati**.

source: Mail aliases from AD server are not imported automatically!
it: Gli alias e-mail non vengono importati automaticamente da AD!

source: Shared folders
it: Cartelle condivise

source: Shared folders have been split into two packages:
it: Le cartelle condivise sono state separate in due pacchetti:

source: "Shared folders" page configures only Samba SMB shares; it provides data access using CIFS/SMB protocol and can be used to share files among Windows and Linux workstations
it: La pagina "Cartelle condivise" permette di configurare solamente delle condivisioni SMB; fornisce l'accesso ai dati utilizzando il protocollo CIFS/SMB e può essere utilizzata per condividere file tra workstation Windows e Linux

source: The "Virtual hosts" panel provides HTTP and FTP access, it has been designed to host web sites and web applications
it: Il pannello "Virtual host" fornisce l'accesso via HTTP ed FTP ed è stato concepito per ospitare siti ed applicazioni web

source: SMB access
it: Accesso SMB

source: In |product| |version| the SMB security model is based on Active Directory. As consequence when upgrading (or migrating) a file server in Primary Domain Controller (PDC) or Standalone Workstation (WS) role the following rule apply:
it: Il modello di protezione SMB adottato da |product| |version| si basa su Active Directory. Di conseguenza, quando si esegue l'aggiornamento (o la migrazione) di un file server nel ruolo del controller di dominio primario (PDC) o di standalone workstation (WS), si applica la seguente regola:

source: When connecting to a shared folder, the NetBIOS domain name must be either prefixed to the user name (i.e. ``MYDOMAIN\username``), or inserted in the specific form field.
it: Quando ci si connette a una cartella condivisa, il nome di dominio NetBIOS deve essere anteposto al nome utente (ad esempio ``MYDOMAIN\username``) o inserito nel campo specifico del modulo di autenticazione.

source: The upgrade procedure enables the deprecated [#badlock]_ NTLM authentication method to preserve backward compatibility with legacy network clients, like printers and scanners.
it: La procedura di upgrade abilita l'obsoleto metodo di autenticazione NTLM [#badlock]_ al fine di preservare la compatibilità con i client della rete più vecchi, come stampanti e scanner.

source: Fix the legacy SMB clients configuration, then disable NTLM authentication.
it: Si consiglia caldamente di correggere la configurazione dei client SMB più vecchi quindi di disattivare l'autenticazione NTLM.

source: Edit ``/var/lib/machines/nsdc/etc/samba/smb.conf``
it: Modificare ``/var/lib/machines/nsdc/etc/samba/smb.conf``

source: Remove the ``ntlm auth = yes`` line
it: Rimuovere la riga ``ntlm auth = yes``

source: Restart the samba DC with ``systemctl -M nsdc restart samba``
it: Riavviare il DC samba con il comando ``systemctl -M nsdc restart samba``

source: Badlock vulnerability http://badlock.org/
it: Vulnerabilità Badlock http://badlock.org/

source: HTTP access
it: Accesso HTTP

source: Every shared folder with web access configured in |product| 6 can be migrated to a virtual host directly from the web interface by selecting the action :guilabel:`Migrate to virtual host`. After the migration, data inside the new virtual host will be accessible using only FTP and HTTP protocols.
it: Ogni cartella condivisa con accesso web configurata in |product| 6 può essere migrata a virtual host direttamente dall'interfaccia web selezionando l'azione :guilabel:`Migra a virtual host`. Dopo la migrazione, i dati contenuti nel nuovo virtual host saranno accessibili solamente tramite i protocolli FTP ed HTTP.

source: See also :ref:`virtual_hosts-section` for more information about :guilabel:`Virtual hosts` page.
it: Fare riferimento alla sezione :ref:`virtual_hosts-section` per ulteriori informazioni relative alla pagina :guilabel:`Virtual hosts`

source: Mail server
it: Server mail

source: All mailboxes options like SPAM retention and quota, along with ACLs, user shared mailboxes and subscriptions are preserved.
it: Tutte le opzioni delle cassette postali come la SPAM retention e la quota, così come le ACL, le cassette postali condivise dall'utente e le sottoscrizioni vengono conservate.

source: Mailboxes associated to groups with :guilabel:`Deliver the message into a shared folder` option enabled, will be converted to public shared mailboxes. The public shared folder will be automatically subscribed by all group members, but all messages will be marked as unread.
it: Le mailbox associate a gruppi con l'opzione :guilabel:`Consegna il messaggio in una cartella condivisa` abilitata, verranno convertite in cassette postali pubbliche condivise. La cartella pubblica condivisa verrà automaticamente sottoscritta da tutti i membri del gruppo, ma tutti i messaggi verranno contrassegnati come non letti.

source: In |product| |version| the services configuration can adhere to :ref:`tlspolicy-section`. Before upgrading, the network clients must be checked against the available policy identifiers.
it: La configurazione dei servizi di |product| |version| può aderire a diverse :ref:`tlspolicy-section`. Prima dell'aggiornamento, è necessario verificare la compatibilità dei client di rete con le caratteristiche delle policy disponibili.

source: An old network client can fail to connect if its TLS ciphers are considered invalid
it: Un client di rete datato potrebbe fallire la connessione se i cifrari TLS da esso supportati sono considerati non validi

source: The policy identifier selected by the upgrade procedure depends on the |product| version and is documented in :ref:`release-notes-section`.
it: La versione della policy selezionata dalla procedura di aggiornamento dipende dal versione di |product| come documentato in :ref:`release-notes-section`.

source: Let's Encrypt certificates are restored during the process, but will not be automatically renewed.
it: I certificati Let's Encrypt vengono ripristinati durante il processo, ma non verranno automaticamente rinnovati.

source: After the upgrade process has been completed, access the web interface and reconfigure Let's Encrypt from the :guilabel:`Server certificate` page.
it: Dopo aver completato il processo di aggiornamento, accedere all'interfaccia web e riconfigurare Let's Encrypt dalla pagina :guilabel:`Certificato del server`.

source: Owncloud and Nextcloud
it: Owncloud e Nextcloud

source: In |product| |version|, Owncloud has officially been replaced by Nextcloud.
it: In |product| |version|, Owncloud è stato ufficialmente sostituito da Nextcloud.

source: However Owncloud 7 is still available to avoid service disruption after the upgrade.
it: Tuttavia Owncloud 7 è ancora disponibile per evitare interruzioni del servizio dopo l'aggiornamento.

source: In case of :ref:`upgrade from local LDAP to Samba AD <pdc-upgrade-section>`, user data inside Owncloud will not be accessible either from the web interface or desktop/mobile clients. In such case, install and migrate to Nextcloud after the upgrade to Samba Active Directory has been completed.
it: In caso di :ref:`upgrade da LDAP locale ad Samba AD <pdc-upgrade-section>`, i dati utente all'interno di Owncloud non saranno accessibili né dall'interfaccia web né dai client desktop/mobile. In tal caso, installare e migrare a Nextcloud dopo che è stato completato l'aggiornamento a Samba Active Directory.

source: From Nextcloud 13, the migration from Owncloud to Nextcloud is not supported anymore.
it: Da Nextcloud 13, la migrazione da Owncloud a Nextcloud non è più supportata.

source: Users should replace Owncloud clients with Nextcloud ones [#DownloadNC]_, then make sure to set the new application URL: ``https://<your_server_address>/nextcloud``.
it: Gli utenti dovranno sostituire i client per Owncloud con quelli per Nextcloud [#DownloadNC]_, assicurandosi di impostare il nuovo URL dell'applicazione: ``https://<your_server_address>/nextcloud``.

source: Nextcloud clients download https://nextcloud.com/install/#install-clients
it: download client Nextcloud https://nextcloud.com/install/#install-clients

source: Perl libraries
it: Librerie Perl

source: In |product| |version|, perl library ``NethServer::Directory`` has been replaced by ``NethServer::Password``. Please update your custom scripts accordingly.
it: In |product| |version|, la libreria perl ``NethServer::Directory`` è stata sostituita da ``NethServer::Password``. Gli script personalizzati andranno adattati di conseguenza.

source: Example of old code: ::
it: Esempio del vecchio codice: ::

source: New code: ::
it: Nuovo codice: ::

source: Documentation available via perldoc command: ::
it: La documentazione è disponibile attraverso il comando perldoc: ::

source: Upgrade from backup
it: Upgrade da backup

source: Make sure to have an updated backup of the original installation.
it: Assicurarsi di avere un backup recente del sistema di origine.

source: Install |product| |version| **using the most recent ISO** and complete the initial steps using the first configuration wizard. The new machine must have the same hostname of the old one, to access the backup set correctly. Install and configure the backup module.
it: Installare |product| |version| **utilizzando la ISO più recente disponibile** e completare gli step iniziali utilizzando il wizard di prima configurazione. La nuova macchina deve avere lo stesso hostname della vecchia per poter accedere correttamente al set di backup. Installare e configurare il modulo del backup.

source: Restore the configuration backup using the web interface. The network configuration is restored, too! If any error occurs, check the :file:`/var/log/messages` log file for further information: ::
it: Ripristinare il backup della configurazione utilizzando l'interfaccia web. Anche la configurazione della rete verrà ripristinata! Se dovesse verificarsi qualche problema, controllare il file di log :file:`/var/log/messages` per informazioni più approfondite: ::

source: If needed, go to :guilabel:`Network` page and fix the network configuration accordingly to the new hardware. If the machine was joined to an existing Active Directory domain, read :ref:`ads-upgrade-section`.
it: Se necessario, spostarsi nel menu :guilabel:`Network` e correggere la configurazione di rete conformemente al nuovo hardware. Se la macchina era attestata ad un dominio Active Directory esistente, leggere :ref:`ads-upgrade-section`.

source: Complete the restore procedure with the following command: ::
it: Completare la procedura di ripristino con i seguenti comandi: ::

source: where *name* is the name of the configured data backup.
it: in cui *name* è il nome del backup configurato.

source: By default, the name of the *backup-data* configured on |product| 6 is ``backup-data``
it: Di default il nome del *backup-data* configurato su |product| 6 è ``backup-data``

source: Check the restore logs: ::
it: Verificare i log del ripristino: ::

source: Each file under :file:`/etc/e-smith/templates-custom/` must be manually checked for compatibility with version |version|.
it: La compatibilità con la versione |version| di ciascun file contenuto nel percorso :file:`/etc/e-smith/templates-custom/` dovrà essere verificata manualmente.

source: Do not reboot the machine before executing the restore-data procedure.
it: La macchina non va riavviata prima di aver eseguito la procedura di restore-data.

source: Upgrade with rsync
it: Upgrade tramite rsync

source: The process is much faster than a traditional backup and restore, also it minimizes the downtime for the users.
it: Il processo tramite rsync è più rapido rispetto ad un tradizionale backup e ripristino e consenti di minimizzare il fermo servizi per gli utenti.

source: Before starting make sure to have:
it: Prima di iniziare assicurarsi di avere:

source: a running |product| 6 installation, we will call it original server or source server
it: una installazione di |product| 6 in produzione, che chiameremo server origine o server sorgente

source: a running |product| 7 installation with at least the same disk space of the source server, and **latest updates installed**; we will call it destination server
it: una installazione di |product| 7 con almeno lo stesso spazio su disco del server di origine e **gli ultimi aggiornamenti installati**, che chiameremo server di destinazione

source: a working network connection between the two severs
it: una connessione di rete attiva tra i due server

source: Please also make sure the source server allows root login via SSH key and password.
it: Assicurarsi che il server sorgente consenta il login all'utente root tramite password ed attraverso una chiave SSH.

source: Sync files
it: Sincronizzazione dei file

source: The synchronization script copies all data using rsync over SSH. If the destination server doesn't have any SSH keys, the script will also a pair of RSA keys and copy the public key to the source server. All directories excluded from the backup data will not be synced.
it: Lo script di sincronizzazione copia tutti i dati utilizzando rsync su SSH. Se il server di destinazione non dispone di chiavi SSH, lo script genererà una coppia di chiavi RSA per il server destinazione e copierà la chiave pubblica nel server di origine. Tutte le directory escluse dai dati di backup non verranno sincronizzate.

source: On the target machine, execute the following command: ::
it: Nella macchina di destinazione, eseguire il seguente comando: ::

source: Where
it: In cui

source: ``source_server_name`` is the host name or IP of the original server
it: ``source_server_name`` è il nome host o l'IP del server origine

source: ``ssh_port`` is the SSH port of the original server (default is 22)
it: ``ssh_port`` è la porta SSH del server origine (la porta di default è la 22)

source: Example: ::
it: Esempio: ::

source: When asked, insert the root password of the source server, make a coffee and wait patiently.
it: Quando richiesto, inserire la password di root del server origine quindi prepararsi un caffè e aspettare con pazienza.

source: The script will not perform any action on the source machine and can be invoked multiple times.
it: Lo script non eseguirà alcuna azione sulla macchina di origine e può essere rilanciato più volte.

source: Sync and upgrade
it: Sincronizzazione e migrazione

source: If called with ``-u`` option, ``rsync-upgrade`` will execute a final synchronization and upgrade the target machine.
it: Se impartito con l'opzione ``-u``, ``rsync-upgrade`` eseguirà una sincronizzazione finale e l'upgrade della macchina destinazione.

source: The script will:
it: Lo script si incaricherà di:

source: close access to every network service on the source machine (except for SSH and httpd-admin)
it: chiudere l'accesso ad ogni servizio di rete della macchina sorgente (ad eccezione di SSH ed httpd-admin)

source: execute ``pre-backup-config`` and ``pre-backup-data`` event on the source machine
it: eseguire gli eventi ``pre-backup-config`` e ``pre-backup-data`` nella macchina sorgente

source: sync all remaining data
it: sincronizzare tutti i dati rimanenti

source: execute ``restore-config`` on the destination machine
it: eseguire il comando ``restore-config`` sulla macchina destinazione

source: If ``rsync-upgrade`` terminates without loosing the network connection,
it: Se l'``rsync-upgrade`` termina senza perdita della connessione di rete,

source: Disconnect the original ns6 from network, to avoid IP conflict with the destination server
it: Disconnettere il ns6 origine dalla rete, per evitare conflitti IP con il server di destinazione

source: Access the server manager UI and fix the network configuration from the :guilabel:`Network` page
it: Accedere all'interfaccia Server Manager e correggere la configurazione di rete dalla pagina :guilabel:`Rete`

source: Otherwise, if during ``rsync-upgrade`` **the network connection is lost**, it is likely that the source and destination servers have an **IP conflict**:
it: Altrimenti, se durante l'``rsync-upgrade`` **la connessione di rete viene persa**, è probabile che i server di origine e di destinazione abbiano un **conflitto IP**:

source: Disconnect the original ns6 from network,
it: Disconnettere il ns6 origine dalla rete,

source: From a ns7 root console run the command: ::
it: Da una console di root del ns7 lanciare il comando: ::

source: Then grab the screen device: ::
it: Quindi accedere nuovamente alla screen: ::

source: At the end of ``rsync-upgrade`` run the following steps:
it: Al termine dell'``rsync-upgrade`` seguire i seguenti passi:

source: Go back to the CLI and call the ``post-restore-data`` event on the destination machine: ::
it: Tornare alla CLI e scatenare l'evento ``post-restore-data`` sulla macchina di destinazione: ::

source: Check the restore logs for any ``ERROR`` or ``FAIL`` message: ::
it: Controllare nei log di ripristino eventuali occorrenze di messaggi di ``ERROR`` o di ``FAIL``: ::

source: Do not reboot the machine before executing the post-restore-data event.
it: La macchina non va riavviata prima di aver scatenato la evento post-restore-data.

source: Upgrade with Upgrade tool
it: Upgrade tramite Upgrade tool

source: The Upgrade tool module make it possible an **in-place upgrade** of |product| from version 6 to version 7 with an automated procedure.
it: Il modulo Upgrade tool consente di eseguire un **aggiornamento in-place** di |product| dalla versione 6 alla versione 7 tramite una procedura automatica.

source: Please refer to the `Upgrade tool page <http://docs.nethserver.org/en/v6/upgrade_tool.html>`_ of |product| 6 Administrator Manual.
it: Fare riferimento alla pagina `Upgrade tool <http://docs.nethserver.org/en/v6/upgrade_tool.html>`_ del Manuale Amministratore di |product| 6.
