Repository: NethServer/docs
Catalog: administrator-manual/*/locale/*/LC_MESSAGES/ups.po
Languages: it

source: |product| supports the management of :index:`UPS` (Uninterruptible Power Supply) connected to the system.
it: |product| supporta la gestione di :index:`UPS` (Uninterruptible Power Supply) collegati al sistema.

source: The server can be configured in two ways:
it: Il server può essere configurato in due modalità:

source: *master*: UPS is directly connected to the server, the server accepts connections from slaves
it: *master*: l'UPS è direttamente collegato al server, il server accetta connessioni dagli slave

source: *slave*: UPS is connected to another server accessible over the network
it: *slave*: l'UPS è collegato ad un altro server raggiungibile via rete

source: You should consult the list of supported models before buying. Via *Administration > Software center* install the UPS package. In *Configuration* appears the new entry *UPS* where can be find the supported model by typing in *Search driver for model* field.
it: Si consiglia di consultare la lista dei modelli supportati prima dell'acquisto. Installare il pacchetto UPS da *Amministrazione > Software center*. In *Configurazione* appare la nuova voce di menù *UPS* dove si può trovare il dispositivo supportato inserendo il modello all'interno del campo di ricerca *Cerca driver per modello*.

source: In :index:`master` mode, the UPS can be connected to the server:
it: Nella modalità :index:`master`, l'UPS può essere collegato al server:

source: on a serial port
it: su una porta seriale

source: on a USB port
it: su una porta USB

source: with a USB to serial adapter
it: con un adattatore da USB a seriale

source: In :index:`slave` mode, you will need to provide the IP address of the master server.
it: Nella modalità :index:`slave` sarà necessario fornire l'indirizzo IP del server master.

source: The default configuration provides a controlled shutdown in the event of the absence of power.
it: La configurazione di default prevede uno spegnimento controllato in caso di assenza di alimentazione.

source: Custom device
it: Device personalizzato

source: If the UPS is connected to a port that is not listed in the web interface, you can configure a custom device with the following commands: ::
it: Se l'UPS è collegato ad una porta non elencata nell'interfaccia web, è possibile configurare un device personalizzato con i seguenti comandi: ::

source: UPS statistics
it: Statistiche UPS

source: Realtime status is available from the **UPS** application dashboard.
it: Lo stato in tempo reale è disponibile nella dashboard dell'applicazione **UPS**.

source: Also, if the statistics module (collectd) is installed and running, the module will automatically collect statistic data about UPS status.
it: Inoltre, se il modulo statistiche (collectd) è installato e funzionante, il modulo raccoglierà automaticamente statistiche sullo stato dell'UPS.
