Repository: NethServer/docs
Catalog: administrator-manual/*/locale/*/LC_MESSAGES/virtual_machines.po
Languages: it

source: Virtual machines
it: Macchine virtuali

source: |product| is capable of running virtual machines using KVM and libvirt, but it doesn't provide a Web interface for it.
it: |product| è in grado di eseguire macchine virtuali attraverso un modulo basato su KVM e libvirt, ma non una interfaccia web per la loro gestione.

source: Virtualization software can be installed and started using the command line, just execute: ::
it: Il software per la virtualizzazione può essere installato e avviato utilizzando la linea di comando, eseguendo: ::

source: If |product| is used as DHCP server, the Dnsmasq instance launched by libvirtd will conflict with the default one. To avoid such conflict, remove ``default`` libvirt NAT network: ::
it: Se |product| svolge il ruolo di server DHCP, l'istanza di Dnsmasq avviata da libvirtd provocherà un conflitto con principale. Per evitare il problema è necessario rimuovere la rete NAT ``default`` di libvirt: ::

source: Finally, the system is ready to be managed using `Virtual Machine Manager (virt-manager) <https://virt-manager.org/>`_, a Linux desktop user interface for managing virtual machines through libvirt.
it: Successivamente il sistema sarà pronto per essere gestito attraverso `Virtual Machine Manager (virt-manager) <https://virt-manager.org/>`_, un'interfaccia utente per desktop Linux per la gestione di macchine virtuali tramite libvirt.

source: Access virt-manager in your Linux desktop, then create a new connection to your |product| using SSH protocol.
it: Lanciato virt.-manager sul proprio desktop Linux, sarà sufficiente creare una nuova connessione verso |product| utilizzando il protocollo SSH.

source: External resources
it: Risorse esterne

source: For more info see:
it: Per maggiori informazioni fare riferimento a:

source: `Virtual Machine Manager official site <https://virt-manager.org/>`_
it: `Sito ufficiale Virtual Machine Manager <https://virt-manager.org/>`_

source: `KVM/Libvirt FAQ <https://access.redhat.com/articles/1344173>`_
it: `FAQ KVM/Libvirt <https://access.redhat.com/articles/1344173>`_
