Repository: NethServer/docs
Catalog: administrator-manual/*/locale/*/LC_MESSAGES/vpn.po
Languages: it

source: A :index:`VPN` (Virtual Private Network) allows you to establish a secure and encrypted connection between two or more systems using a public network, like the Internet.
it: Una :index:`VPN` (Virtual Private Network) consente di instaurare un collegamento sicuro e cifrato fra due o più sistemi utilizzando una rete pubblica come Internet.

source: The system supports two types of VPNs:
it: Il sistema supporta due tipi di VPN:

source: :index:`roadwarrior`: connect a remote client to the internal network
it: :index:`roadwarrior`: collegamento di un terminale remoto alla rete interna

source: :index:`net2net` or :index:`tunnel`: connect two remote networks
it: :index:`net2net` o :index:`tunnel`: collegamento di due reti remote

source: Roadwarrior OpenVPN, IPSec tunnel and OpenVPN tunnels are now part of the VPN application in the new Server Manager.
it: OpenVPN Roadwarrior, tunnel IPSec e tunnel OpenVPN ora fanno parte dell'applicazione VPN nel nuovo Server Manager.

source: OpenVPN lets you easily create VPN connections, It brings with numerous advantages including:
it: OpenVPN consente di creare facilmente collegamenti VPN, porta con sé numerosi vantaggi tra cui:

source: Availability of clients for various operating systems: Windows, Linux, Apple, Android, iOS
it: Disponibilità di client per vari sistemi operativi: Windows, Linux, Apple, Android, iOS

source: Multiple NAT traversal, you do not need a dedicated static IP on the firewall
it: Attraversamento NAT multipli, ovvero non è necessario un IP statico dedicato al firewall

source: High stability
it: Elevata robustezza

source: Simple configuration
it: Semplicità di configurazione

source: The OpenVPN server in roadwarrior mode allows connection of multiple clients.
it: Il server OpenVPN in modalità roadwarrior consente il collegamento di client multipli.

source: Supported authentication methods are:
it: I metodi di autenticazione supportati sono:

source: System user and password
it: utente di sistema e password

source: Certificate
it: certificato

source: The server can operate in two modes: :index:`routed` or :index:`bridged`. You should choose bridged mode only if the tunnel must carry non-IP traffic.
it: Il server può operare in due modalità: :index:`routed` o :index:`bridged`. Si consiglia di scegliere la modalità bridged solo se il tunnel deve trasportare traffico non-IP.

source: To allow a client to establish a VPN:
it: Per consentire ad un client di stabilire una VPN:

source: Create a new account: it is recommended to use a dedicated VPN account with certificate, avoiding the need to create a system user.
it: Creare un nuovo account: è consigliato creare un account VPN dedicato che utilizzi un certificato. In questo modo non è necessario creare un utente di sistema per garantire l'accesso VPN.

source: Download the file containing the configuration and certificates. As an alternative, the file can be sent to the user by mail (available only on the new Server Manager).
it: Scaricare il file contiene la configurazione e i certificati. In alternativa, il file può essere inviato all'utente via mail (disponibile solo nel nuovo Server Manager).

source: Import the file into the client and start the VPN.
it: Importare il file all'interno del client ed avviare la VPN.

source: Every time a client connects to the OpenVPN server, the access is logged inside an accounting database. Access statistics are available from the new Server Manager. For each user, statistics include:
it: Ogni volta che un client si connette al server OpenVPN, l'accesso viene registrato in un database di accounting. Le statistiche di accesso sono disponibili nel nuovo Server Manager. Per ogni utente, le statistiche includono:

source: client name
it: nome client

source: virtual IP address
it: indirizzo IP virtuale

source: real IP address
it: indirizzo IP reale

source: time of connection
it: orario della connessione

source: time of disconnection
it: orario della disconnessione

source: transferred bytes
it: byte trasmessi

source: When creating an OpenVPN net2net connection, a server will have the master role. All other servers are considered as slaves (clients).
it: Quando si crea una connessione OpenVPN net2net, un server ricopre il ruolo di master. Tutti gli altri server sono considerati slave (client).

source: A client can be connected to another |product| or any other firewall which uses OpenVPN.
it: Un client può essere collegato ad un altro |product| od ad un qualsiasi altro firewall che utilizzi OpenVPN.

source: All tunnels use OpenVPN routed mode, but there are two kind of topologies: *subnet* and *p2p* (Point to Point)
it: Tutti i tunnel utilizzano OpenVPN in modalità routed, ma esistono due tipi di topologie: *subnet* e *p2p* (Point to Point)

source: **Topology: subnet**
it: **Topologia: subnet**

source: This is the recommended topology. In :index:`subnet topology`, the server will accept connections and will act as DHCP server for every connected clients.
it: Questa è la topologia consigliata. Nella :index:`topologia subnet`, il server accetterà le connessioni e agirà come server DHCP per ogni client connesso.

source: In this scenario
it: In questo scenario

source: the server will authenticate clients using TLS certificates
it: il server gestisce l'autenticazione dei client utilizzando certificati TLS

source: the server can push local routes to remote clients
it: il server può eseguire il push delle rotte locali verso i client remoti

source: the client will be able to authenticate with TLS certificates or user name and password
it: il client si possono autenticare con certificati TLS o tramite nome utente e password

source: **Topology: P2P**
it: **Topologia: P2P**

source: In :index:`p2p topology`, the administrator must configure one server for each client.
it: Nella :index:`topologia p2p`, l'amministratore deve configurare un server per ciascun client.

source: In this scenario:
it: In questo scenario:

source: the only supported authentication method is the PSK (Pre-Shared Key). Please make sure to exchange the PSK using a secure channel (like SSH or HTTPS)
it: l'unico metodo di autenticazione supportato è la PSK (Pre-Shared Key). Si consiglia di utilizzare un canale sicuro (come SSH o HTTPS) per scambiare la PSK

source: the administrator must select an IP for both end points
it: l'amministratore deve selezionare un IP per entrambi gli end point

source: routes to remote networks must be configured on each end point
it: le rotte per le reti remote devono essere configurate su ogni end point

source: To configure a tunnel, proceed as follow:
it: Per configurare un tunnel procedere come segue:

source: Access the tunnel server and open the :guilabel:`OpenVPN tunnels` page, move to :guilabel:`Tunnel servers` tab and click on :guilabel:`Create new` button
it: Accedere al server del tunnel e aprire la pagina :guilabel:`OpenVPN tunnels`, spostarsi nella scheda :guilabel:`Tunnel servers` e cliccare sul bottone :guilabel:`Create new`

source: Insert all required fields, but please note:
it: Valorizzare i campi richiesti ponendo attenzione al fatto che:

source: :guilabel:`Public IPs and/or public FQDN`, it's a list of public IP addresses or host names which will be used by clients to connect to the server over the public Internet
it: guilabel:`Public IPs and/or public FQDN` è una lista di IP pubblici o di nomi host che verranno usati dai client per collegarsi al server attraverso Internet

source: :guilabel:`Local networks`, it's a list of local networks which will be accessible from the remote server. If topology is set to p2p, the same list will be reported inside the client :guilabel:`Remote networks` field
it: :guilabel:`Local networks` è una lista di reti locali che saranno accessibili dai server remoti. Se la topologia è di tipo p2p, la stessa lista sarà utilizzata per valorizzare il campo :guilabel:`Remote networks` del client

source: :guilabel:`Remote networks`, it's a list of networks behind the remote server which will be accessible from hosts in the local network
it: :guilabel:`Remote networks` è una lista di reti remote che si trovano dietro al server remoto e che saranno accessibili dagli host della rete locale

source: After the configuration is saved, click on the :guilabel:`Download` action and select :guilabel:`Client configuration`
it: Dopo aver salvato la configurazione, cliccare sull'azione :guilabel:`Download` e selezionare :guilabel:`Configurazione client`

source: Access the tunnel client, open the :guilabel:`OpenVPN tunnels` page, move to :guilabel:`Tunnel clients` tab, click on :guilabel:`Upload` button
it: Accedere al client del tunnel, aprire la pagina :guilabel:`OpenVPN tunnels`, spostarsi sulla scheda :guilabel:`Tunnel clients` e cliccare sul bottone :guilabel:`Upload`

source: Advanced features
it: Funzionalità avanzate

source: The web interface allows the configuration of advanced features like:
it: L’interfaccia web consente di configurare funzionalità avanzate quali:

source: on the client, multiple addresses can be specified inside the :guilabel:`Remote hosts` field for redundancy; the OpenVPN client will try to connect to each host in the given order
it: lato client, nel campo :guilabel:`Remote hosts` possono essere specificati indirizzi multipli per ridondanza; il client OpenVPN tenterà di connettersi a ciascun host rispettando l'ordine di inserimento

source: :index:`WAN priority`: if the client has multiple WAN (red interfaces), the option allows to select the order in which the WAN will be used to connect to the remote server
it: :index:`WAN priority`: se il client ha più WAN (interfacce red), l'opzione consente di selezionare l'ordine in cui le WAN saranno utilizzate per connettersi al server remoto.

source: protocol: please bear in mind that OpenVPN is designed to operate optimally over UDP, but TCP capability is provided for situations where UDP cannot be used
it: Protocollo: è importante rammentare che OpenVPN è progettata per funzionare in modo ottimale in UDP, ma è possibile utilizzare TCP nelle situazioni in cui non è possibile fare ricorso ad UDP

source: cipher: the cryptographic algorithm used to encrypt all the traffic. If not explicitly selected, the server and client will try to negotiate the best cipher available on both sides
it: cifratura: l'algoritmo crittografico utilizzato per crittografare tutto il traffico. Se non viene selezionato in modo esplicito, il server e il client cercheranno di negoziare la migliore cifratura disponibile su entrambi i lati

source: LZO compression: enabled by default, can be disabled when using legacy servers or clients
it: compressione LZO: abilitata di default, può essere disabilitata quando si utilizzano server or client legacy

source: Legacy mode
it: Modalità legacy

source: Tunnels can still be created also using Roadwarriors accounts.
it: I tunnel possono ancora essere creati utilzzando gli account roadwarrior.

source: Steps to be performed on the master server:
it: I passi da eseguire sul server master sono:

source: Enable roadwarrior server
it: Abilitare il server roadwarrior

source: Create a VPN-only account for each slave
it: Creare un account solo VPN per ciascun slave che dovrà collegarsi

source: During the account creation remember to specify the remote network configured behind the slave
it: Durante la creazione dell'account ricordarsi di specificare la rete remota configurata dietro allo slave

source: Steps to be performed on the slave:
it: I passi da eseguire sullo slave sono:

source: Create a client from the :guilabel:`Client` page, specifying the connection data to the master server.
it: Creare un client dalla pagina :guilabel:`Client` specificando i dati di collegamento al server master

source: Copy and paste the content of downloaded certificates from the master configuration page.
it: Copiare e incollare il contenuto dei certificati scaricati dalla pagina di configurazione del master

source: :index:`IPsec` (IP Security) protocol is the 'de facto' standard in VPN tunnels, it's typically used to create net to net tunnels and it's supported from all manufacturers. You can use this protocol to create VPN tunnels between a |product| and a device from another manufacturer as well as VPN tunnels between 2 |product|.
it: Il protocollo :index:`IPsec` (IP Security) è lo standard 'de facto' nei tunnel VPN, viene utilizzato tipicamente per creare tunnel di tipo net to net ed è supportato da tutti i produttori. È possibile utilizzare questo protocollo per creare tunnel VPN tra un |product| ed un dispositivo di un altro produttore nonché tunnel VPN tra 2 |product|.

source: IPSec is not designed to connect single hosts but for net2net configuration, this implies two gateways on both ends (at least one red and one green interface).
it: IPSec non è progettato per collegare singoli host ma per la configurazione net2net, questo implica due gateway su entrambe le estremità (almeno un'interfaccia RED e una GREEN).

source: IPsec is extremely reliable and compatible with many devices. In fact, it is an obvious choice when you need to create net2net connections between firewalls of different manufacturers.
it: IPsec è estremamente affidabile e compatibile con molti dispositivi. Infatti, è una scelta ovvia quando è necessario creare collegamenti net2net tra firewall di diversi produttori.

source: Unlike OpenVPN configuration, in an IPsec tunnel, firewalls are considered peers.
it: A differenza della configurazione OpenVPN, in un tunnel IPsec, i firewall sono considerati nodi pari livello.

source: If you are creating a tunnel between two |product|, given the firewalls A and B:
it: Se si sta creando un tunnel tra due |product|, dati A e B i firewall:

source: Configure the server A and specify the remote address and LAN of server B. If the :guilabel:`Remote IP` field is set to the special value ``%any``, the server waits for connections from the other endpoint.
it: Configurare il server A e specificare l'indirizzo remoto e la LAN del server B. Se il campo :guilabel:`Remote IP` è valorizzato con ``% any``, il server rimane in attesa della connessione dell'altro endpoint.

source: Configure the second firewall B by mirroring the configuration from A inside the remote section. The special value ``%any`` is allowed in one side only!
it: Configurare il secondo firewall B replicando la configurazione da A all'interno della sezione remota. Il valore speciale ``%any`` è consentito in un solo lato!

source: If an endpoint is behind a NAT, the values for :guilabel:`Local identifier` and :guilabel:`Remote identifier` fields must be set to custom unique names prepended with ``@``. Common names are the geographic locations of the servers, such as the state or city name.
it: Se un endpoint è dietro un NAT, i valori per :guilabel:`Local identifier` e :guilabel:`Remote identifier` devono essere impostati con nomi univoci personalizzati preceduti da ``@``. I nomi comuni sono le posizioni geografiche dei server, ad esempio il nome di stato o città.
