Repository: NethServer/docs
Catalog: administrator-manual/*/locale/*/LC_MESSAGES/web_proxy.po
Languages: it

source: Web proxy
it: Proxy web

source: The :index:`web proxy` is a server that sits between the LAN PCs and Internet sites. Clients make requests to the proxy which communicates with external sites, then send the response back to the client.
it: Il :index:`proxy web` è un server che si interpone fra i PC della LAN e i siti Internet. I client effettuano le richieste al proxy che comunica con i siti esterni, quindi trasmette le risposte al client.

source: The advantages of a web proxy are:
it: I vantaggi del proxy web sono due:

source: ability to filter content
it: possibilità di filtrare i contenuti

source: reduce bandwidth usage by caching the pages you visit
it: ridurre l'utilizzo della banda facendo cache delle pagine visitate

source: The proxy can be enabled only on green and blue zones. Supported modes are:
it: Il proxy può essere attivato per le zone green e blue. Le modalità supportate sono:

source: Manual: all clients must be configured manually
it: Manuale: tutti i client devono essere manualmente configurati

source: Authenticated users must enter a user name and password in order to navigate
it: Autenticato: gli utenti devono inserire nome utente e password per poter navigare

source: Transparent: all clients are automatically forced to use the proxy for HTTP connections
it: Trasparente: tutti i client sono automaticamente forzati ad usare il proxy per le connessioni HTTP

source: Transparent SSL: all clients are automatically forced to use the proxy for HTTP and HTTPS connections
it: Trasparente SSL: tutti i client sono automaticamente forzati ad usare il proxy per le connessioni HTTP e HTTPS

source: Authenticated mode
it: Modalità autenticata

source: Before enabling the web proxy in authenticated mode, please make sure to configure a local or remote account provider.
it: Prima di abilitare il proxy web in modalità autenticata, assicurarsi di aver configurato un account provider locale o remoto.

source: When Samba Active Directory is installed, or the server is joined to a remote Active Directory, Windows machines can use integrated authentication with Kerberos. All Windows clients **must** access the proxy server using the FQDN.
it: Quando viene installato Samba Active Directory o il server è attestato ad un dominio remoto Active Directory, le postazioni Windows possono utilizzare l'autenticazione integrata Kerberos. Su tutti i client Windows **è necessario** configurare il proxy utilizzando l'FQDN del server.

source: All other clients can use basic authentication mechanism.
it: Tutti gli altri client possono utilizzare il meccanismo di basic authentication.

source: NTLM authentications is deprecated and it's not supported.
it: L'autenticazione NTLM è deprecata e non è più supportata.

source: Client configuration
it: Configurazione client

source: The proxy is always listening on port **3128**. When using manual or authenticated modes, all clients must be explicitly configured to use the proxy. The configuration panel is accessible from the browser settings. By the way, most clients will be automatically configured using WPAD protocol. In this case it is useful to enable :guilabel:`Block HTTP and HTTPS ports` option to avoid proxy bypass.
it: Il proxy è sempre in ascolto sulla porta **3128**. Quando si utilizzano le modalità Manuale o Autenticato, tutti i client devono essere esplicitamente configurati per utilizzare il proxy. La configurazione è accessibile dal pannello impostazioni del browser. La maggior parte dei client verranno comunque configurati automaticamente attraverso il protocollo WPAD. In questo caso è utile attivare l'opzione :guilabel:`Blocca porta HTTP e HTTPS` per evitare il bypass del proxy.

source: If the proxy is installed in transparent mode, all web traffic coming from clients is diverted through the proxy. No configuration is required on individual clients.
it: Se il proxy è installato in modalità trasparente, tutto il traffico web proveniente dai client viene intercettato dal firewall e indirizzato attraverso il proxy. Nessuna configurazione è necessaria sui singoli client.

source: To make the WPAD file accessible from guest network, add the address of blue network inside the :guilabel:`Allow hosts` field for httpd service from the :guilabel:`Network services` page.
it: Per rendere accessibile il file WPAD dalla rete ospiti, aggiungere l'indirizzo della rete blue nel campo :guilabel:`Consenti host` per il servizio httpd nella pagina :guilabel:`Servizi di rete`.

source: SSL Proxy
it: Proxy SSL

source: In transparent SSL mode, the proxy implements the so-called "peek and splice" behavior: it establishes the SSL connection with remote sites and checks the validity of certificates without decrypting the traffic. Then the server can filter requested URLs using the web filter and return back the response to the client.
it: In modalità trasparente SSL, il proxy implementa la cosiddetta tecnica "peek and splice": stabilisce la connessione SSL con i siti remoti e verifica la validità dei certificati senza decifrare il traffico. Quindi il server può filtrare gli URL richiesti utilizzando il filtro web e ritornare la risposta al client.

source: There is no need to install any certificate into the clients, just enabling the SSL proxy is enough.
it: Non è necessario installare alcun certificato sui client, è sufficiente abilitare il proxy SSL.

source: If the web proxy is enabled on the blue network this allows you to reach the green devices via the http or https protocols. If you want to avoid this behavior, simply create a bypass by destination by entering the CIDR of the green network as explained below.
it: Se c'è il web proxy è attivo sulla rete blue questo consente ai devices della blue di raggiungere i devices della green sui protocolli http e https. Per evitare questo comportamento è sufficiente creare un bypass per destinazione inserendo la rete greeen in formato CIDR come spiegato in precedenza.

source: In some cases it may be necessary to ensure that traffic originating from specific IP or destined to some sites it's not routed through the HTTP/HTTPS proxy.
it: In alcuni casi può essere necessario fare in modo che il traffico originato da specifici ip della rete o verso alcune destinazioni non passi per il proxy HTTP/HTTPS, ma sia instradato direttamente; il traffico in questione non sarà più sottoposto a proxy.

source: The proxy allows you to create:
it: Il proxy consente di creare:

source: bypass by domains
it: bypass per domini

source: bypass by source
it: bypass per sorgente

source: bypass by destination
it: bypass per destinazione

source: Bypass by domains
it: Bypass per domini

source: Bypass by domains can be configured from :guilabel:`Domains without proxy` section. All domains listed inside this page can be directly accessed from LAN clients. No antivirus or content filtering is applied to these domains.
it: I bypass per i domini possono essere configurati dalla sezione :guilabel:`Domini senza proxy`. Tutti i domini elencati all'interno di questa pagina possono essere acceduti direttamente dai client LAN. Nessun filtro antivirus o dei contenuti viene applicato a questi domini.

source: Every domain listed will be expanded also for its own sub-domains. For example, adding *nethserver.org* will bypass also *www.nethserver.org*, *mirror.nethserver.org*, etc.
it: Ogni dominio elencato sarà espanso anche per i relativi sotto-domini. Ad esempio, aggiungendo *nethserver.org* verranno bypassati anche *www.nethserver.org*, *mirror.nethserver.org*, e così via.

source: All LAN clients must use the server itself as DNS, either directly or as a forwarder.
it: Tutti i client della LAN **devono** utilizzare il server stesso come DNS, direttamente o come *forwarder*.

source: Bypass by source and destinations
it: Bypass per origine e destinazione

source: A source bypass allows direct access to any HTTP/HTTPS sites from selected hosts, host groups, IP ranges and network CIDR. Source bypasses are configurable from :guilabel:`Hosts without proxy` section.
it: Un bypass per origine consente l'accesso diretto a tutti i siti HTTP/HTTPS da host selezionati, gruppi host, intervalli IP e CIDR di rete. I bypass per origine sono configurabili dalla sezione :guilabel:`Host senza proxy`.

source: A destination bypass allows direct access from any LAN clients to HTTP/HTTPS sites hosted on specific hosts, host groups or network CIDR. Destination bypasses are configurable from :guilabel:`Sites without proxy` section.
it: Un bypass per destinazione consente l'accesso diretto da qualsiasi client della LAN a siti HTTP/HTTPS ospitati su host specifici, gruppi host o CIDR di rete. I bypass per destinazione sono configurabili dalla sezione :guilabel:`Siti senza proxy`.

source: These bypass rules are also configured inside the WPAD file.
it: Queste regole di bypass vengono configurate anche all'interno del file WPAD.

source: Priority and divert rules
it: Regole di priorità e di instradamento

source: Firewall rules for routing traffic to a specific provider, or decrease/increase priority, are applied only to network traffic which traverse the gateway. These rules don't apply if the traffic goes through the proxy because the traffic is generated from the gateway itself.
it: Le regole del firewall per il routing del traffico su un provider specifico o per la modifica della priorità del traffico vengono applicate solo al traffico di rete che attraversa il gateway. Queste regole non si applicano se il traffico passa attraverso il proxy perché il traffico viene generato dal gateway stesso.

source: In a scenario where the web proxy is enabled in transparent mode and the firewall contains a rule to lower the priority for a given host, the rule applies only to non-HTTP services like SSH.
it: In uno scenario in cui il proxy web è abilitato in modalità trasparente e il firewall contiene una regola per abbassare la priorità di un host specifico, la regola si applica solo ai servizi non HTTP, come SSH.

source: The :guilabel:`Rules` tab allows the creation of priority and divert rules also for the traffic intercepted by the proxy.
it: La scheda :guilabel:`Regole` consente la creazione di regole di priorità e di instradamento anche per il traffico intercettato dal proxy.

source: The web interface allow the creation of rules for HTTP/S traffic to:
it: L'interfaccia web consente di creare regole per il traffico HTTP/S per:

source: raise the priority of an host or network
it: aumentare la priorità di un host o una rete

source: lower the priority of an host or network
it: abbassare la priorità di un host o di una rete

source: divert the source to a specific provider with automatic fail over if the provider fails
it: Instradare la sorgente su un provider specifico con failover automatico se il provider dovesse andare fuori servizio

source: force the source to a specific provider without automatic fail over
it: forzare la sorgente su uno specifico provider senza failover automatico

source: Content filter
it: Filtro contenuti

source: The :index:`content filter` analyzes all web traffic and blocks selected websites or sites containing viruses. Forbidden sites are selected from a list of categories, which in turn must be downloaded from external sources and stored on the system.
it: Il :index:`filtro contenuti` analizza il traffico web ed è in grado di bloccare siti pericolosi o contenenti virus. I siti proibiti sono selezionati da una lista di categorie che è possibile anche scaricare da sorgenti esterne e salvare sul sistema.

source: The system allows to create an infinite number of profiles. A profile is composed by three parts:
it: Il sistema consente di creare un numero illimitato di profili. Ciascun profilo è composto da tre parti:

source: **Who**: the client associated with the profile. Can be a user, a group of users, a host, a group of hosts, a zone or an interface role (like green, blue, etc).
it: **Chi**: il client associato al profilo. Può essere un utente, un gruppo di utenti, un host, un gruppo di host, una zona o un ruolo (es. green, blue, ecc).

source: **What**: which sites can be browsed by the profiled client. It's a filter created inside the :guilabel:`Filters` section.
it: **Cosa**: quali siti può vedere il client associato al profilo E' un filtro creato nella pagina :guilabel:`Filtri`.

source: **When**: the filter can always be enabled or valid only during certain period of times. Time frames can be created inside the :guilabel:`Times` section.
it: **Quando**: il profilo può essere sempre attivo o essere valido solo in alcuni periodi. Le condizioni temporali possono essere create nella sezione :guilabel:`Condizioni temporali`.

source: This is the recommended order for content filter configuration:
it: Si consiglia di procedere in questo ordine per la configurazione del filtro contenuti:

source: Select a list of categories from :guilabel:`Blacklists` page and start the download
it: Selezionare una lista di categorie dalla pagina :guilabel:`Blacklist` ed avviare il download

source: Create one or more time conditions (optional)
it: Creare una o più condizioni temporali (opzionale)

source: Create custom categories (optional)
it: Creare eventuali categorie personalizzate (opzionale)

source: Create a new filter or modify the default one
it: Creare un nuovo filtro o modificare quello di default

source: Create a new profile associated to a user or host, then select a filter and a time frame (if enabled)
it: Creare un nuovo profilo associato ad un utente o un host, selezionare quindi un filtro e una condizione temporale (se abilitata)

source: If no profile matches, the system provides a default profile that is applied to all clients.
it: Il sistema prevede un profilo di default che viene applicato a tutti i client qualora non rientrino in nessun altro profilo.

source: Filters
it: Filtri

source: A filter can:
it: Un filtro consente di:

source: block access to categories of sites
it: bloccare l'accesso a categorie di siti

source: block access to sites accessed using IP address (recommended)
it: bloccare l'accesso ai siti raggiunti usando l'indirizzo IP (consigliato)

source: filter URLs with regular expressions
it: filtrare gli URL con espressioni regolari

source: block files with specific extensions
it: bloccare file con specifiche estensioni

source: enable global blacklist and whitelist
it: abilitare blacklist e whitelist globali

source: A filter can operate in two different modes:
it: Ogni filtro può lavorare in due modalità:

source: Allow all: allow access to all sites, except those explicitly blocked
it: Permetti tutto: consente l'accesso a tutti i siti, ad eccezione di quelli esplicitamente bloccati

source: Block all: blocks access to all sites, except those explicitly permitted
it: Blocca tutto: blocca l'accesso a tutti i siti, ad eccezione di quelli esplicitamente consentiti

source: The category list will be displayed only after the download of list selected from :guilabel:`Blacklist` page.
it: La lista delle categorie compare solo al termine del download della lista selezionata nella pagina :guilabel:`Blacklist`.

source: Install ``nethserver-lightsquid`` package to generate :index:`web proxy stats`.
it: Installando il modulo ``nethserver-lightsquid`` il sistema genererà automaticamente i :index:`report di navigazione web`.

source: LightSquid is a lite and fast log analyzer for Squid proxy, it parses logs and generates new HTML report every day, summarizing browsing habits of the proxy's users. Lightsquid web interface can be found at the :menuselection:`Applications` tab inside the :guilabel:`Dashboard`.
it: LightSquid è un analizzatore di log per Squid leggero e veloce che ogni giorno genera un nuovo report HTML, riassumendo le abitudini di navigazione degli utenti del proxy. L'interfaccia di Lightsquid è accessibile dal tab :menuselection:`Applicazioni` della :guilabel:`Dashboard`.

source: Cleanup old reports
it: Eliminare i vecchi report

source: LightSquid reports are saved as directories of text files inside ``/var/lightsquid/``. Since all reports are kept forever, the size of the directory can greatly grow during the years.
it: I report di LightSquid vengono salvati come directory di file di testo all'interno del percorso ``/var/lightsquid/``. Poiché tutti i report vengono conservati per sempre, la dimensione della directory può aumentare notevolmente nel corso degli anni.

source: To cleanup all reports older than 1 year, execute the following: ::
it: Per eliminare i report più vecchi di un 1 anno, eseguire: ::

source: Under tab :guilabel:`Cache` there is a form to configure cache parameters:
it: Nel pannello :guilabel:`Cache` è presente un form per configurare i parametri di cache:

source: The cache can be enabled or disabled (*disabled* by default)
it: La cache può essere abilitata o disabilitata (*disabilitata* di default)

source: **Disk cache size**: maximum value of squid cache on disk (in MB)
it: **Dimensione cache disco**: valore massimo della cache di squid sul disco (in MB)

source: **Min object size**: can be left at 0 to cache everything, but may be raised if small objects are not desired in the cache (in kB)
it: **Dimensione minima oggetto**: può essere lasciato a 0 per mettere in cache tutto, ma può essere alzato se gli oggetti piccoli non sono desiderati in cache (in kB)

source: **Max object size**: objects larger than this setting will not be saved on disk. If speed is more desirable than saving bandwidth, this should be set to a low value (in kB)
it: **Dimensione massima oggetto**: gli oggetti più grandi di questa dimensione non vengono salvati in cache. Se si preferisce la velocità al salvataggio della banda, può essere impostato ad un valore basso (in kB)

source: The button :guilabel:`Empty cache` also works if squid is disabled, it might be useful to free space on disk.
it: Il pulsante :guilabel:`Svuota cache` funziona anche se il proxy è disabilitato, potrebbe essere utile per liberare spazio su disco.

source: Sites without cache
it: Siti senza cache

source: Sometime the proxy can't correctly handle some bad crafted sites. To exclude one or more domain from the cache, use the ``NoCache`` property.
it: A volte il proxy non è in grado di fare cache di alcuni siti mal costruiti. Per escludere uno o più domini dalla cache, usare l'opzione ``NoCache``.

source: Example: ::
it: Esempio: ::

source: Safe ports
it: Porte sicure

source: Safe ports are a list of ports accessible using the proxy. If a port is not inside the safe port list, the proxy will refuse to contact the server. For example, given a HTTP service running on port 1234, the server can't be accessed using the proxy.
it: Le porte sicure sono una lista di porte accessibili attraverso il proxy. Se una porta non è all'interno della lista delle porte sicure, il proxy si rifiuterà di collegarsi al server. Per esempio, dato un servizio HTTP che gira sulla porta 1234, tale servizio non sarebbe accessibile usando il proxy.

source: The ``SafePorts`` property is a comma-separated list of ports. Listed ports will be added to the default list of safe ports.
it: L'opzione ``SafePorts`` è una lista di porte separata da virgole. Le porte elencate saranno aggiunte alla lista preconfigurata di porte sicure.

source: Eg. Access extra ports 446 and 1234: ::
it: Per esempio, per aprire l'accesso alle porte 446 e 1234: ::

source: Logs
it: Log

source: Squid logs are kept for 5 weeks in compressed format, to control disk space usage. Web proxy logs are verbose to help troubleshoot problems. Web browsing activities are logged in aggregate and readable format by Lightsquid.
it: I log di Squid vengono conservati in formato compresso per 5 settimane, per gestire l'utilizzo dello spazio su disco. I log del proxy Web sono molto dettagliati e sono una insostituibile risorsa per approfondire gli eventuali problemi. Le attività di navigazione Web sono registrate in formato aggregato e leggibile attraverso Lightsquid.

source: In environments where logs need to be preserved for more than 5 weeks, you could manually edit the logrotate configuration :file:`/etc/logrotate.d/squid`. Finally, remember to add :file:`/etc/logrotate.d/squid` to the configuration backup using the custom include. ::
it: Negli ambienti in cui sia necessario conservare i log per più di 5 settimane, è possibile modificare manualmente la configurazione di logrotate :file:`/etc/logrotate.d/squid`. E' inoltre necessario rammentare di aggiungere :file:`/etc/ logrotate.d/squid` al backup della configurazione usando l'inclusione personalizzata. ::
