Repository: NethServer/docs
Catalog: administrator-manual/*/locale/*/LC_MESSAGES/web_server.po
Languages: it

source: References
it: Riferimenti

source: Apache documentation for :file:`.htaccess` files https://httpd.apache.org/docs/2.4/howto/htaccess.html
it: Documentazione Apache per i file :file:`.htaccess` https://httpd.apache.org/docs/2.4/howto/htaccess.html
