Repository: NethServer/docs
Catalog: administrator-manual/*/locale/*/LC_MESSAGES/web_server.po
Languages: it

source: This chapter describes the features of the *Web server* application, available in the new Server Manager.
it: Questo capitolo descrive le funzionalità dell'applicazione *Web server*, disponibile nel nuovo Server Manager.

source: After |product| has been installed the :guilabel:`Web server` application is already available. It configures and starts the Apache HTTP web server.
it: L'applicazione :guilabel:`Web server` è immediatamente disponibile al termine dell'installazione di |product|. Serve a configurare e avviare il web server HTTP Apache.

source: The :guilabel:`Web server` application provides the following features:
it: L'applicazione :guilabel:`Web server` mette a disposizione le seguenti funzionalità:

source: Integration with system certificates for HTTPS
it: Integrazione con i certificati del sistema per HTTPS

source: Hosting of multiple web sites
it: Hosting di siti web multipli

source: HTTP :index:`reverse proxy`
it: :index:`reverse proxy` HTTP

source: :index:`PHP` scripting language to run web applications
it: Linguaggio di scripting :index:`PHP` per eseguire applicazioni Web

source: The following sections describe the pages of the :guilabel:`Web server` application. Some of them require additional software components that are automatically downloaded, installed and configured when they are required for the first time.
it: Le seguenti sezioni descrivono le pagine dell'applicazione :guilabel:`Web server`. Alcune di esse richiedono componenti software aggiuntivi che vengono scaricati, installati e configurati automaticamente quando sono richiesti per la prima volta.

source: Web server dashboard
it: Dashboard Web server

source: The :guilabel:`Web server dashboard` page shows the current web server status and statistics. It also lists the additional components installed on the system.
it: La pagina :guilabel:`Dashboard del server Web` mostra lo stato e le statistiche correnti del server Web. Elenca anche i componenti aggiuntivi installati sul sistema.

source: The default Apache configuration serves the contents of :file:`/var/www/html` and is capable of executing PHP scripts by running them on the :guilabel:`Default web stack`.
it: La configurazione predefinita di Apache serve il contenuto di :file:`/var/www/html` ed è in grado di eseguire script PHP sul :guilabel:`Default web stack`.

source: Settings
it: Impostazioni

source: The :guilabel:`Settings` page allows to change the PHP configuration parameters for resources allocation (e.g. script maximum memory and execution time).
it: La pagina :guilabel:`Impostazioni` consente di modificare i parametri di configurazione di PHP per l'allocazione delle risorse (ad es. Memoria massima dello script e tempo di esecuzione).

source: Changes affect the global PHP configuration: as such they are valid for both web applications and command line scripts, unless they are overridden by some means.
it: Le modifiche influiscono sulla configurazione globale di PHP: sono pertanto valide sia per le applicazioni Web che per gli script da riga di comando, a meno che non vengano sovrascritti in qualche modo.

source: PHP settings can also be adjusted for a specific web site from the :guilabel:`Virtual hosts` page (see also :ref:`webserver-phpversions-section`), or overridden with a custom configuration file. To this end,
it: Le impostazioni di PHP possono anche essere modificate per un sito web specifico dalla pagina :guilabel:`Virtual hosts` (vedi anche :ref:`webserver-phpversions-section`), o sovrascritte con un file di configurazione personalizzato. Per questo scopo:

source: for PHP 7.2, look at current PHP-FPM settings in :file:`/etc/opt/rh/rh-php72/php-fpm.d/000-virtualhost.conf`;
it: per PHP 7.2, verificare le impostazioni correnti di PHP-FPM in :file:`/etc/opt/rh/rh-php72/php-fpm.d/000-virtualhost.conf`;

source: create a file under the same directory (e.g. :file:`/etc/opt/rh/rh-php72/php-fpm.d/001-custom.conf`) and refer to the official `PHP-FPM documentation`_ to adjust the pool directives;
it: creare un file nella stessa directory (es :file:`/etc/opt/rh/rh-php72/php-fpm.d/001-custom.conf`) e fare riferimento alla `documentazione ufficiale di PHP-FPM`_ per adeguare le necessarie direttive;

source: add the created file to your :ref:`configuration backup <configuration_backup-section>`.
it: aggiungere il file creato al :ref:`backup della configurazione <configuration_backup-section>`.

source: Virtual hosts
it: Virtual host

source: Multiple web sites can be hosted on |product|. It is possible to configure the web site hosting space in the :guilabel:`Virtual hosts` page.
it: È possibile ospitare più siti web su |product|. È possibile configurare lo spazio di hosting del sito web dalla pagina :guilabel:`Virtual Host`.

source: When a new virtual host is created with one or more *server names* the new Server Manager contextually creates a server alias name in the local DNS service for each of them.
it: Quando viene creato un nuovo virtual host con uno o più *nomi server*, il nuovo Server Manager crea contestualmente, per ciascuno di essi, un nome alias nel servizio DNS locale.

source: A server alias name is accessible from web clients if they use the |product| itself as their DNS server. For public web sites, refer to your DNS provider documentation and ensure the server alias name is correctly set in the public DNS.
it: Un nome alias del server è accessibile dai client web se questi utilizzano il |product| stesso come il loro server DNS. Per i siti Web pubblici, consultare la documentazione del provider DNS e assicurarsi che il nome alias del server sia impostato correttamente nel DNS pubblico.

source: Server alias names are listed and can be changed from the new Server Manager :ref:`dashboard <system-section>`.
it: I nomi alias del server sono elencati nella :ref:`dashboard <system-section>` del nuovo Server Manager e da lì possono essere direttamente modificati.

source: Web site access restrictions
it: Restrizioni accesso sito web

source: It is possible to limit how the web clients access the web site with the following options, available under the :guilabel:`Advanced settings` section.
it: È possibile limitare il modo in cui i client web accedono ad un sito web con le seguenti opzioni, disponibili nella sezione :guilabel:`Impostazioni avanzate`.

source: Enable the option :guilabel:`Allow access from trusted networks only`. Refer to :ref:`trusted_networks-section` for more information.
it: Abilitando l'opzione :guilabel: `Consenti accesso solo da reti fidate`. Fare riferimento alla sezione :ref:`trusted_networks-section` per maggiori informazioni.

source: Enable the switch :guilabel:`Require HTTP authentication` to grant access only if the specified password is provided by the client. Web applications usually provide an authentication method by themselves: this option could be useful to protect the contents of static web sites.
it: Abilitare l'opzione :guilabel:`Richiedi autenticazione HTTP` per concedere l'accesso ai client solo tramite password. Le applicazioni Web di solito forniscono un metodo di autenticazione autonomo: questa opzione potrebbe essere utile per proteggere i contenuti di siti Web statici.

source: If the web site must be always accessed through an encrypted channel it is possible to enable the :guilabel:`Require SSL encrypted connection` option. Any resource request received over the HTTP protocol is redirected over HTTPS.
it: Se fosse necessario accedere al sito web sempre tramite un canale crittografato, è possibile abilitare l'opzione :guilabel:`Richiedi connessione crittografata SSL`. Qualsiasi richiesta di risorse ricevuta tramite il protocollo HTTP verrà reindirizzata su HTTPS.

source: SSL/TLS certificate
it: Certificato SSL/TLS

source: Each virtual host can be assigned a reserved :guilabel:`SSL/TLS certificate` or rely on the default system one. In any case, the virtual host names must be present among the certificate alternative names, otherwise the web clients can refuse to connect.
it: A ciascun virtual host può essere assegnato un :guilabel:`certificato SSL/TLS` dedicato oppure si può utilizzare quello predefinito di sistema. In qualunque caso, i nomi usati per il virtual host devono essere presenti tra i nomi alternativi del certificato, altrimenti i client web potrebbero rifiutare di connettersi.

source: Configuring a web application
it: Configurare un'applicazione web

source: When a new virtual host is created a web root directory is created as well. The full web root path is displayed under :guilabel:`Virtual hosts > List > Web root path`.
it: Quando viene definito un nuovo virtual host, viene creata anche la relativa directory radice web. Il percorso completo della radice web viene visualizzato sotto :guilabel:`Host virtuali > Elenco > Web root path`.

source: If the switch :guilabel:`Enable FTP access` is enabled, it is possible to upload data, configuration and script files to the web root path using a FTP client.
it: Se l'opzione :guilabel:`Abilita accesso FTP` è attiva, è possibile caricare i dati, i file di configurazione e gli script nella root web utilizzando un client FTP.

source: HTTP authentication password should be different from the FTP one, because FTP is used to upload the virtual host contents whilst HTTP is used to see them from the web.
it: La password di autenticazione HTTP dovrebbe essere diversa da quella FTP, poiché FTP viene utilizzato per caricare i contenuti del virtual host mentre HTTP viene utilizzato per visualizzarli dal web.

source: The web site displays a "Welcome" page until a file named :file:`index.html` or :file:`index.php` is uploaded under the web root directory. If this is not desired, it is possible to enable the option :guilabel:`Root directory file listings`, as alternative to the "Welcome" page.
it: Il sito web visualizza una pagina di "Benvenuto" fino a quando un file chiamato :file:`index.html` o :file:`index.php` non viene caricato nella directory web principale. Se non si desidera questo comportamento, è possibile abilitare l'opzione :guilabel:`Elenco dei file della directory principale`, come alternativa alla pagina di benvenuto.

source: FTP uploaded files are owned by the `apache` group with read-only permissions. If write or execution permissions are needed, a FTP client can be used to grant them.
it: I file caricati via FTP sono di proprietà del gruppo `apache` con autorizzazioni di sola lettura. Se fossero necessarie autorizzazioni di scrittura o di esecuzione, sarà possibile concederle tramite un client FTP.

source: If a web site contains executable code, such as PHP scripts, the security implications of file permissions must be evaluated carefully. Grant write access to a limited set of special files and directories, as required by the web application documentation.
it: Se un sito web contiene codice eseguibile, ad esempio script PHP, le implicazioni di sicurezza delle autorizzazioni dei file devono essere valutate attentamente. Si consiglia di concedere l'accesso in scrittura solo a una serie limitata di file e directory speciali, come richiesto dalla documentazione dell'applicazione web.

source: The Apache configuration can be overridden by uploading a file named :file:`.htaccess`. Refer to the official Apache documentation for more information about this feature [#HTACCESS]_.
it: La configurazione di Apache può essere sovrascritta caricando un file chiamato :file:`.htaccess`. Fare riferimento alla documentazione ufficiale di Apache per ulteriori informazioni su questa funzione [#HTACCESS]_.

source: PHP versions and configuration
it: Versioni e configurazione PHP

source: If the PHP version provided by the :guilabel:`Default web stack` does not fit a web application it is possible to select and install an alternative one and override the global PHP default settings, as explained by the :ref:`webserver-settings-section` section.
it: Se la versione di PHP fornita da :guilabel:`Default web stack` non si adatta ad un'applicazione web, è possibile selezionarne e installarne una alternativa e sovrascrivere le impostazioni predefinite globali di PHP, come spiegato nella sezione :ref:`webserver-settings-section`.

source: Disabling a virtual host
it: Disabilitazione di un virtual host

source: The :guilabel:`Disable` action hides the virtual host, making it not accessible from web clients. This operation is reversible, by selecting the :guilabel:`Enable` action.
it: L'azione :guilabel:`Disabilita` nasconde il virtual host, rendendolo inaccessibile ai client web. Questa operazione è reversibile, selezionando l'azione :guilabel:`Abilita`.

source: Deleting a virtual host
it: Cancellazione di un virtual host

source: The :guilabel:`Delete` action removes the virtual host configuration and erases the web root directory. This operation is not reversible.
it: L'azione :guilabel: `Cancella` rimuove la configurazione del virtual host e ne cancella la directory web principale. Questa operazione non è reversibile.

source: As alternative to a virtual host, which stores static files or a PHP web application under a local web root directory, it is possible to forward web requests to another HTTP server and serve responses in behalf of it. This behavior can be configured from the :guilabel:`Reverse proxy` page.
it: In alternativa a un virtual host, che ospita file statici o un'applicazione web PHP in una directory radice web locale, è possibile inoltrare richieste web a un altro server HTTP e fornire risposte per conto di esso. Questo comportamento può essere configurato dalla pagina :guilabel:`Reverse proxy`.

source: Each reverse proxy item is actually a rule that can match an incoming web request. Depending on the rule :guilabel:`Name` field value, the match can occur in either:
it: Ogni elemento del reverse proxy è in realtà una regola che può corrispondere a una richiesta web in entrata. A seconda del valore del campo :guilabel:`Nome`, la corrispondenza può verificarsi per:

source: the requested **web site name**, if :guilabel:`Name` starts with any character, but the slash ``/``, or
it: il **nome del sito web** richiesto, se :guilabel:`Nome` inizia con qualsiasi carattere, tranne la barra` `/` `, oppure

source: the requested **resource path**, if :guilabel:`Name` starts with a slash ``/`` character.
it: il **resource path** richiesto, se :guilabel:`Nome` inizia con un carattere barra` `/` `.

source: If the rule matches, the request is forwarded to another web server, defined by the :guilabel:`Destination URL` field.
it: Se la regola corrisponde, la richiesta viene inoltrata a un altro server web, definito dal campo :guilabel:`URL di destinazione`.

source: Web site name proxy pass
it: Proxy pass per nomi sito web

source: Scenario for a named proxy pass:
it: Scenario per un proxy pass sul nome:

source: |product| is the firewall of your LAN with public name ``http://fw.myfirstdomain.org``
it: |product| è il firewall della LAN, con nome pubblico ``http://fw.myfirstdomain.org``

source: You have a domain ``http://mydomain.com`` pointing to the public IP for |product|
it: Si possiede il dominio ``http://mydomain.com`` che punta all'IP pubblico di |product|

source: You would like ``http://mydomain.com`` to forward to the internal server (internal IP: 192.168.2.100)
it: Si desidera che le richieste per ``http://mydomain.com`` vengano inoltrate ad un server interno (IP privato: 192.168.2.100)

source: In this scenario, create a new record by clicking :guilabel:`Create a reverse proxy` button. Fill the :guilabel:`Name` field with ``mydomain.com`` and the :guilabel:`Destination URL` with ``http://192.168.2.100``.
it: In questo scenario, creare una nuova voce cliccando su :guilabel:`Crea un reverse proxy`. Compilare il campo :guilabel:`Nome` con ``mydomain.com`` e il campo :guilabel:`URL destinazione` destinazione con ``http://192.168.2.100``.

source: Resource path proxy pass
it: Proxy pass su resource path

source: Scenario for path-based proxy pass:
it: Scenario per un proxy pass basato su url

source: |product| is the firewall of your LAN
it: |product| è il firewall della LAN

source: You have a domain ``http://mydomain.com``
it: Si possiede un dominio ``http://mydomain.com``

source: You would like ``http://mydomain.com/mysite`` to forward to the internal server (internal IP: 192.168.2.100)
it: Si desidera che le richieste per ``http://mydomain.com/mysite`` vengano inoltrate ad un server interno (IP privato: 192.168.2.100)

source: In this scenario, create a new record by clicking :guilabel:`Create a reverse proxy` button. Fill the :guilabel:`Name` field with ``/mysite`` and the :guilabel:`Destination URL` with ``http://192.168.2.100``.
it: In questo scenario, creare una nuova voce cliccando su :guilabel:`Crea un reverse proxy`. Compilare il campo :guilabel:`Nome` con ``/mysite`` e il campo :guilabel:`URL destinazione` destinazione con ``http://192.168.2.100``.

source: Extra options
it: Opzioni aggiuntive

source: If only encrypted connections are allowed, enable the :guilabel:`Require SSL encrypted connection`.
it: Se fossero consentite solo connessioni cifrate, abilitare l’opzione :guilabel:`Richiedi connessione SSL cifrata`.

source: Only clients from certain networks can be allowed to connect, by specifying a comma-separated list of CIDR networks under the :guilabel:`Access from CIDR networks` field.
it: Si può restringere l’accesso solo ai client appartenenti ad alcune reti, specificando un elenco separato da virgola di reti in notazione CIDR nel campo :guilabel:`Accedi da reti CIDR`.

source: Options available only for named proxy pass:
it: Opzioni disponibili solo per proxy pass basti su nome:

source: Enable or disable forwarding of ``Host`` header
it: Abilita o disabilita l'inoltro dell'header ``Host``

source: Enable or disable WebSocket forwarding
it: Abilita o disabilita l'inoltro dei WebSocket

source: Accept invalid target SSL certificate: use this option only if the target has a self-signed certificate
it: Accetta certificato SSL di destinazione non valido: utilizzare questa opzione solo se la destinazione dispone di un certificato autofirmato

source: Advanced reverse proxy settings
it: Impostazioni avanzate reverse proxy

source: When the reverse proxy rule matches a **web site name** it is possible to assign it a dedicated certificate, choosing one from the :guilabel:`SSL/TLS certificate` list.
it: Quando la regola del reverse proxy corrisponde a un **nome di sito web** è possibile assegnargli un certificato dedicato, scegliendolo dall'elenco :guilabel:`Certificato SSL/TLS`.

source: It is not possible to select the certificate if the rule matches a **resource path**. In this case only the default certificate can be used.
it: Non è possibile selezionare il certificato se la regola corrisponde a un **resource path**. In questo caso è possibile utilizzare solo il certificato predefinito.

source: Regardless the rule type, the following settings are also available:
it: Indipendentemente dal tipo di regola, sono disponibili anche le seguenti impostazioni:

source: :guilabel:`Access from CIDR networks`: restricts the access from the given list of CIDR networks. Only web clients connecting from those networks are allowed to open the web site.
it: :guilabel:`Accesso dalle reti CIDR`: limita l'accesso ad un dato elenco di reti CIDR. Solo i client web che si connettono da tali reti sono autorizzati ad aprire il sito web.

source: :guilabel:`Require SSL encrypted connection`: if enabled, any `http://` request is redirected to `https://`.
it: :guilabel:`Richiedi connessione crittografata SSL`: se abilitato, qualsiasi richiesta `http:// ` viene reindirizzata a `https:// `.

source: :guilabel:`Accept invalid SSL certificate from target`: if the destination URL starts with `https://` and an invalid certificate is returned, enabling this option ignores the certificate validation error.
it: :guilabel:`Accetta certificato SSL non valido dalla destinazione`: se l'URL di destinazione inizia con `https://` e viene restituito un certificato non valido, abilitando questa opzione si ignora l'errore di convalida del certificato.

source: :guilabel:`Forward HTTP "Host" header to target`: if enabled, a HTTP `Host` header containing the original request host name is forwarded to the destination URL. This could be required by the destination server application to work properly.
it: :guilabel:`inoltra l'intestazione "Host" HTTP alla destinazione`: se abilitato, un'intestazione HTTP `Host` contenente il nome host della richiesta originale viene inoltrata all'URL di destinazione. Ciò potrebbe essere richiesto dall'applicazione del server di destinazione per funzionare correttamente.

source: FTP server
it: Server FTP

source: The FTP protocol is insecure. Passwords and file data are sent in clear text over the network.
it: Il protocollo FTP non è sicuro. Le password e i dati dei file vengono inviati in chiaro sulla rete.

source: The File Transfer Protocol is a standard network protocol used for the transfer of computer files between a client and server [#FTPWIKI]_. The :guilabel:`FTP` page enables the FTP service and configures additional user accounts limited to the FTP service only.
it: Il File Transfer Protocol è un protocollo di rete standard utilizzato per il trasferimento di file tra un client e un server [#FTPWIKI]_. La pagina :guilabel:`FTP` abilita il servizio FTP e permette di configurare account utente aggiuntivi limitati al solo servizio FTP.

source: Users of the FTP service can be restricted to access their own home directory by enabling :guilabel:`Chroot user on home directory`. When this option is enabled the user cannot see the other system directories. This configuration is also known as *jailing*.
it: Gli utenti del servizio FTP possono essere limitati ad accedere alla propria directory home abilitando :guilabel:`Chroot utente nella home directory`. Quando questa opzione è abilitata, l'utente non può vedere le altre directory di sistema. Questa configurazione è anche nota come *jailing*.

source: When a virtual host is created, a random FTP user name is assigned to it. It is possible to upload the virtual host file contents with FTP. Refer to :ref:`configuring-web-app` for more information.
it: Quando viene creato un virtual host, gli viene assegnato un nome utente FTP casuale. È possibile quindi caricare il contenuto del virtual host attraverso FTP. Fare riferimento a :ref:`configuring-web-app` per maggiori informazioni.

source: System users
it: Utenti di sistema

source: This configuration is highly discouraged. Also note that when enabled, the integration with the web server will break.
it: Questa configurazione è altamente sconsigliata. Si noti inoltre che, se abilitata, l'integrazione con il server Web verrà interrotta.

source: After enabling system users, all virtual users will be disabled. All configuration must be done using the command line.
it: Dopo aver abilitato gli utenti di sistema, gli utenti virtuali saranno disabilitati. Tutta la configurazione deve essere eseguita da linea di comando.

source: Enable system users: ::
it: Abilitare gli utenti di sistema: ::

source: Given a user name *goofy*, first make sure the user has Remote shell access. Then, enable the FTP access: ::
it: Dato l’utente *goofy*, per prima cosa assicurarsi che sia abilitato per l’accesso remoto da shell. Vedi Accesso ai servizi. Quindi, abilitare l’accesso: ::

source: To disable an already enabled user: ::
it: Per disabilitare l’accesso ad un utente precedentemente abilitato: ::

source: If not explicitly disabled, all system users are chrooted. To disable a chroot for a system user: ::
it: Se non esplicitamente disabilitato, tutti gli utenti di sistema hanno l’opzione di chroot all’interno della propria home. Per disabilitare il chroot di un utente di sistema: ::
