Repository: NethServer/docs
Catalog: administrator-manual/*/locale/*/LC_MESSAGES/webmail.po
Languages: it

source: The default :index:`webmail` client is :index:`Roundcube`. Roundcube's main features are:
it: :index:`Roundcube` è il client :index:`webmail` predefinito. Le caratteristiche principali di Roundcube sono:

source: Simple and fast
it: Semplice e veloce

source: Built-in address book integrated with internal LDAP
it: Rubrica integrata con LDAP

source: Support for HTML messages
it: Supporto per messaggi HTML

source: Shared folders support
it: Cartelle condivise

source: The webmail is available at the following URLs:
it: La webmail è raggiungibile ai seguenti indirizzi:

source: For example, given a server with IP address *192.168.1.1* and name *mail.mydomain.com*, valid addresses are:
it: Per esempio, dato un server con indirizzo IP *192.168.1.1* e nome *mail.miodominio.com*, gli indirizzi validi sono:

source: If |product| is bound to a remote Active Directory account provider a dedicated user account in AD is required by the module to be fully operational! See :ref:`join-existing-ad-section`.
it: Se |product| è attestato ad un account provider remoto Active Directory, un account utente AD aggiuntivo e dedicato è necessario al modulo per essere pienamente operativo! Fare riferimento alla sezione :ref:`join-existing-ad-section`.

source: Roundcube supports many plugins that are already bundled within the installation.
it: Roundcube supporta molti plugin già inclusi nell’installazione.

source: The plugins that are enabled by default are:
it: I plugin abilitati di default sono:

source: Manage sieve: manage filters for incoming mail
it: Manage sieve: gestione dei filtri sulla posta in arrivo

source: Mark as junk: mark the selected messages as Junk and move them to the configured Junk folder
it: Mark as junk: marca i messaggi come spam e li sposta nell’apposita cartella

source: Recommended plugins:
it: Altri plugin consigliati:

source: New mail notifier
it: Notifica nuova mail

source: Emoticons
it: Emoticon

source: VCard support
it: Supporto VCard

source: Plugins can be added or removed by editing the comma-separated list inside the ``Plugins`` property. For example, to enable "mail notification", "mark as junk" and "manage sieve plugins", execute from command line: ::
it: I plugin possono essere aggiunti o rimossi modificando la lista separata da virgole salvata nell’opzione ``Plugins``. Per esempio, è possibile abilitare i plugin “mail notification”, “mark as junk” e “manage sieve plugins” con il seguente comando: ::

source: A list of bundled plugins can be found inside ``/usr/share/roundcubemail/plugins`` directory. To get the list, just execute: ::
it: Una lista dei plugin inclusi può essere trovata nella directory file: ``/usr/share/roundcubemail/plugins``. Per recuperare la lista, eseguire: ::

source: Access
it: Accesso

source: With default configuration webmail is accessible using HTTPS from any network.
it: La configurazione di default prevede l’accesso HTTPS alla webmail da tutte le reti.

source: If you want to restrict the access only from green and trusted networks, execute: ::
it: Se si desidera restringere l’accesso solo alla reti green e alle reti fidate, eseguire: ::

source: If you want to open the access from any network: ::
it: Se si desidera aprire l’accesso da tutte le reti: ::

source: Removing
it: Rimozione

source: If you want remove Roundcube, run the following command on the server command line. ::
it: Se si desidera rimuovere Roundcube, eseguire il seguente comando. ::
